[
  {
    "id": "AFEN3135BC",
    "name": "Zora Neale Hurston: A Writing Life",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking Locally - New York City\" Requirement (Barnard) Satisfies \"Thinking Technologically and Digitally\" Requirement (Barnard) On her “Record of Freshman Interest” form, Zora Neale Hurston, Barnard class of 1928, wrote in response to the question of what vocation or profession she had in mind after graduation, “I have had some small success as a writer and wish above all to succeed at it. Either teaching or social work would be interesting, but consolation prizes.”  No consolation prize was necessary as Hurston became one of American and African American literature’s finest writers, America’s first Black anthropologist, and a Black feminist ancestor and icon. A deep dive into Hurston’s work and writing life, this course reads Hurston as a narrative stylist and theorist in multiple genres: as poet, essayist, writer of short stories, novelist, playright, folklorist, and autobiographer. The goal of this class is to read Hurston closely and widely and to identify and examine her aesthetic philosophy and stylistic choices as one of the first African American women able to have a writing “career.” In Spring of 2026, this class will center the cultural context in which Hurston wrote, using the New York Historical’s exhibition Gay Harlem Renaissance.  Hurston was an active part of a coterie of artists and intellectuals who made up the “queer mentorship and gay-inclusive salons and friendship circles that helped sustain the Harlem Renaissance.” We will also partner with the Digital Humanities Center at Barnard, as well as Barnard Archives, in the preparation of final digital projects that can be shared with the college community.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Monica Miller",
        "location": "119 MILSTEIN CENTER",
        "capacity": 22,
        "enrollment": 21
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AFEN3196BC",
    "name": "HARLEM RENAISSANCE LITERATURE",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking Locally - New York City\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) Home to Harlem focuses on the relationship between art, activism and social justice during the Harlem/ New Negro Renaissance. Exploring the cultural contexts and aesthetic debates that animated Harlem in 1920s to 1930s, the course discusses the politics of literary and theatrical production, while exploring the fashioning and performance of New Negro identity through fiction, poetry, essays, and artwork.  Topics considered include: role of Africa/slavery/the south in New Negro expression, patronage, passing, primitivism/popular culture, black dialect as literary language, and the problematics of creating a “racial” art in/for a community comprised of differences in gender, class, sexuality, and geographical origin.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "6:10pm-7:25pm",
        "professor": "Maleda Belilgne",
        "location": "405 BARNARD HALL",
        "capacity": 23,
        "enrollment": 17
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AFEN3817BC",
    "name": "Black Shakespeare",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) This course examines Shakespeare’s role in shaping Western ideas about Blackness, in processes of racial formation, and in Black freedom struggle. As one of the most enduring  representations of a Black man in Western art Shakespeare’s Othello will be a focal point. However, this course will examine other “race” plays as well as works perceived as “race-neutral” in tandem with Black “respeakings” of Shakespeare’s works. This class is antiracist in intent and is shaped by several interlocking questions: What is Black Shakespeare? Can creators and scholars separate Shakespeare from the apparatus of white supremacy that has been built around his works? What are the challenges for BIPOC actors performing Shakespeare on the dominant stage? What are the challenges and obstacles for BIPOC scholars working on Shakespeare in academia? Can performing Shakespeare be an activist endeavor",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:00pm",
        "professor": "Kim F Hall",
        "location": "405 BARNARD HALL",
        "capacity": 15,
        "enrollment": 7
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AFRS2005BC",
    "name": "CARIBBEAN CULTURE & SOCIETIES",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Sustainability Related This course offers a chronological study of the Anglophone, Hispanophone, and Francophone insular Caribbean through the eyes of some of the region’s most important writers and thinkers. We will focus on issues that key Caribbean intellectuals--including two Nobel prize-winning authors--consider particularly enduring and relevant in Caribbean cultures and societies. Among these are, for example, colonization, slavery, national and postcolonial identity, race, class, popular culture, gender, sexuality, tourism and migration. This course will also serve as an introduction to some of the exciting work on the Caribbean by professors at Barnard College and Columbia University (faculty spotlights).",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Maja Horn",
        "location": "225 MILBANK HALL",
        "capacity": 25,
        "enrollment": 25
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AFRS2006BC",
    "name": "INTRODUCTION AFRICAN DIASPORA",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) Sustainability Related Interdisciplinary and thematic approach to the African diaspora in the Americas: its motivations, dimensions, consequences, and the importance and stakes of its study. Beginning with the contacts between Africans and the Portuguese in the 15th century, this class will open up diverse paths of inquiry as students attempt to answer questions, clear up misconceptions, and challenge assumptions about the presence of Africans in the New World.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Celia Naylor",
        "location": "409 BARNARD HALL",
        "capacity": 25,
        "enrollment": 19
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AFRS2046BC",
    "name": "Introduction to Afro-diasporic Religions,",
    "description": "Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) This is an introductory lecture course to the study of Afro-diasporic religions particularly its evolution from the period of transatlantic slavery to present. Students will explore the linkages between Africa and its diaspora, particularly Latin America and the Caribbean and the United States. Through an interdisciplinary approach and Black feminist lens, with a focus on the historical, ethnographical, and philosophical, the course will traverse through selected religions and regions such as Santería & Lucumí in Cuba and Puerto Rico, Vodou in Haiti and Dominican Republic, Obeah and Rastafari in Jamaica, Camdomblé in Brazil, Islam in Guyana, African American Christianity and Hoodoo, and Obeah and Orisha tradition in Trinidad and Tobago. Collectively we will explore questions of Black diasporic liberatory practices and formation, queerness, transness, spiritual possession, resistance, and ancestral veneration. Through a combination of lectures, readings, films, audio recordings, and guest presentations, we will explore the historical development, contemporary manifestations, and contentions of these spiritual traditions; their connections and dissimilarities; their impact on visual artists and writers; their relationship to Christianity by way of colonization, and their meaning in the context of the ongoing struggle of Black people to imagine and embody sane, inclusive, healthy alternatives to a pervasive model of white supremacy.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Aurelis Troncoso",
        "location": "202 MILBANK HALL",
        "capacity": 25,
        "enrollment": 22
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AFRS3083BC",
    "name": "Black Women's Freedom Narratives",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies Social Science Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) During the journey of this course, we will individually and collectively utilize myriad materials to examine the intricacies, nuances, and trajectories of freedom, primarily in literary texts grounded in the United States. However, a couple of required books are centered beyond the geographical and imaginary boundaries of the United States. Even though one of the texts for this course is a “traditional” slave narrative of a previously enslaved woman of African descent in the Caribbean (The History of Mary Prince), we will examine different narratives of Black women from the colonial period to the contemporary era that engage and reckon with the processes of freedom- imagining, freedom-creating, and freedom-making. We will approach the subject matter utilizing a variety of genres (e.g., slave narratives, oral histories, speeches, essays, poems, as well as novels (epistolary and science fiction). For this course, students will submit 2 short essays and a final paper/project. Small groups of 2-3 students will also co-lead some sections of class discussions on selected reading assignments.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "4:10pm-6:00pm",
        "professor": "Celia Naylor",
        "location": "403 BARNARD HALL",
        "capacity": 15,
        "enrollment": 13
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AFRS3532BC",
    "name": "ROMARE BEARDEN:HOME IS HARLEM",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Locally - New York City\" Requirement (Barnard) Prerequisites: This course is limited to 20 students Romare Bearden: Home is Harlem, is an exploration into one of the greatest American artists finding home in Harlem. The noted painter, collagist, intellectual and advocate for the arts, spent his childhood and young adult life in Harlem. Known for chronicling the African-American experience, he found rich sources for artistic expression in the Manhattan neighborhoods above 110th Street.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "10:10am-12:00pm",
        "professor": "Diedra Harris-Kelley",
        "location": "402 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 13
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AFRS3552BC",
    "name": "BLACK WOMEN STYLE&PERFRMNCE",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Locally - New York City\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard)",
    "credits": 4,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-12:00pm",
        "professor": "Shirley Taylor",
        "location": "407 BARNARD HALL",
        "capacity": 15,
        "enrollment": 5
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AFRS3565BC",
    "name": "Art & Culture in Harlem",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies Social Science Requirement (Barnard) Satisfies \"Thinking Locally - New York City\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) Harlem is a community with a long and storied legacy of arts and entertainment that dates back to the late 1800s. Its legacy extends through the many cultural movements that have helped to define the community such as the Harlem Renaissance in the early 1900s, the Black Arts Movement in the 1960s, and Hip Hop in the 1970s and 1980s, to the current renaissance of venues that anchor Harlem as a neighborhood vibrant with varied opportunities for cultural engagement. Harlem is home to several historic and iconic venues devoted to the arts and entertainment such as the Apollo Theater, Dance Theatre of Harlem, the Studio Museum in Harlem, and the National Black Theatre. These and many other venues along with many others throughout the neighborhood have helped to anchor Harlem as a beacon for Black creative expression that has been instrumental in shaping American culture. The Schomburg Center for Research in Black Culture, part of the New York Public Library, stands as a repository for much of this history and as an emblem of Harlem’s extensive cultural history. In recent years, Harlem has also seen a burgeoning of new galleries, performance spaces, and cultural events that have reignited and brought new audiences to the community. In this course, we will explore Harlem’s early history and how it evolved from a place known primarily for its entertainment venues to one with a mix of standard and more cutting edge artistic and cultural ventures. Community, politics, and economics will also be considered as we look at various cultural and artistic movements. As part of our exploration, we will examine whether shifts in demographics and the ideas, notions, and sometimes, myths about the neighborhood have influenced arts and entertainment in the community. We will seek to define what distinguishes arts and entertainment in Harlem from other New York City neighborhoods and how Harlem has contributed over the years to Black arts and entertainment in NYC and beyond. This course will include visits to venues and visits from guest speakers, all relative to in-class discussions and deeper exploration of the space arts and entertainment have continued to hold for the community and for the people of Harlem. Along with guided walking tours, visits to selected venues will help to delineate Harlem’s cultural past and its continuing evolution through the work of artists, curators, administrators, scholars, culture bearers, and others. Students are encouraged to attend events at some of the institutions and venues covered in the course. Dates, times, and links for events, activities, and guest speakers will be provided in advance.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "12:10pm-2:00pm",
        "professor": "Shirley Taylor",
        "location": "308 Diana Center",
        "capacity": 15,
        "enrollment": 14
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS1002BC",
    "name": "INTRODUCTION TO ART HISTORY II",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) The second part of the Introduction to Art History goes from about 1400 to 2015, circles the world, and includes all media. It is organized around one theme for each lecture, and approximately 100 works of art. Visits to New York museums and discussions sections are crucial parts of the course.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Anne Higonnet",
        "location": "304 BARNARD HALL",
        "capacity": 150,
        "enrollment": 97
      },
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Anne Higonnet",
        "location": "OTHR OTHER",
        "capacity": 21,
        "enrollment": 21
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS1012BC",
    "name": "AHIS-BC1002 DISCUSSION",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-5:00pm",
        "professor": "",
        "location": "502 Diana CenterJan 20, 2026 – May 4, 2026",
        "capacity": 15,
        "enrollment": 0
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "5:10pm-6:00pm",
        "professor": "",
        "location": "Jan 20, 2026 – May 4, 2026",
        "capacity": 15,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "9:10am-10:00am",
        "professor": "",
        "location": "502 Diana CenterJan 20, 2026 – May 4, 2026",
        "capacity": 15,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "10:10am-11:00am",
        "professor": "",
        "location": "502 Diana CenterJan 20, 2026 – May 4, 2026",
        "capacity": 15,
        "enrollment": 0
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "10:10am-11:00am",
        "professor": "",
        "location": "Jan 20, 2026 – May 4, 2026",
        "capacity": 15,
        "enrollment": 0
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "11:10am-12:00pm",
        "professor": "",
        "location": "Jan 20, 2026 – May 4, 2026",
        "capacity": 15,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-5:00pm",
        "professor": "",
        "location": "Jan 20, 2026 – May 4, 2026",
        "capacity": 15,
        "enrollment": 0
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "7:10pm-8:00pm",
        "professor": "",
        "location": "502 Diana CenterJan 20, 2026 – May 4, 2026",
        "capacity": 15,
        "enrollment": 0
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS2001BC",
    "name": "DRAWING STUDIO",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Sustainability Related This course delves into drawing as an expansive, exploratory practice that underpins all forms of visual art. Designed primarily as a hands-on workshop, the class is enriched with slide lectures, video presentations, and field trips. Throughout the semester, students will engage in individual and group critiques, fostering dialogue about their work. Beginning with still life and progressing to drawings of artworks, artifacts, and figure studies, the course investigates drawing as a dynamic practice connected to a wide array of visual cultures.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "2:10pm-6:00pm",
        "professor": "Irena Haiduk",
        "location": "402 Diana Center",
        "capacity": 18,
        "enrollment": 18
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS2006BC",
    "name": "PAINTING II",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) A continuation of painting I - III, open to all skill levels. Students will further develop techniques to communicate individual and collective ideas in painting. This course will focus on individual and collaborative projects designed to explore the fundamental principles of image making. Students acquire a working knowledge of traditional studio skills and related concepts in contemporary art through class critiques, discussion, and individual meetings with the professor. Reading materials will provide historical and philosophical background to the class assignments. Class projects will range from traditional to experimental and multi-media. Image collections will be discussed in class with an awareness of contemporary image production.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "2:10pm-6:00pm",
        "professor": "Joan Snitzer",
        "location": "402 Diana Center",
        "capacity": 16,
        "enrollment": 17
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS2008BC",
    "name": "PAINTING IV",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) A continuation of painting I - III, open to all skill levels. Students will further develop techniques to communicate individual and collective ideas in painting. This course will focus on individual and collaborative projects designed to explore the fundamental principles of image making. Students acquire a working knowledge of traditional studio skills and related concepts in contemporary art through class critiques, discussion, and individual meetings with the professor. Reading materials will provide historical and philosophical background to the class assignments. Class projects will range from traditional to experimental and multi-media. Image collections will be discussed in class with an awareness of contemporary image production.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "2:10pm-6:00pm",
        "professor": "Joan Snitzer",
        "location": "402 Diana Center",
        "capacity": 6,
        "enrollment": 6
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS2901BC",
    "name": "Contemporary Latin American Art",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Focusing on South America, this course examines contemporary art produced in the region known as Latin America and its diasporas, roughly since mid-1940s to the present. The first half of the class attends to two tendencies of the 1940s–1970s, abstraction and conceptualism, lionized through a slew of acclaimed group and solo exhibitions organized across the hemisphere in the last twenty years. We will analyze these two tendencies in the distinct social, political, and economic contexts of their emergence in various “centers” of the continent paying special attention to the ideologies of modernization, progress, and economic development; political upheavals including violent dictatorships and other crises; artists’ relationship to Western European and U.S. cultural centers, and transnational circulation networks; and the role of art institutions. To this end, we will pay special attention to how these trends have been historicized to date, and to what ends. The second half of the class will examine practices since the mid-1970s to the present in a comparative perspective: one, through the lens of identity politics and, two, analyzing the dynamics of the increased global dissemination of works from Latin America and by Latin-American descendants. Several visits to art institutions in NYC will be required as a part of the course.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Dorota Biczel",
        "location": "504 Diana Center",
        "capacity": 60,
        "enrollment": 60
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS3003BC",
    "name": "SUPERVISED PROJ PHOTOGRAPHY",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Technologically and Digitally\" Requirement (Barnard) In this course, you will conduct independent projects in photography in a structured setting under faculty supervision.  You are responsible for arranging for your photographic equipment in consultation with the instructor. This course will afford you a framework in which to intensively develop a coherent body of photographs, critique this work with your classmates, and correlate your goals with recent issues in contemporary photography. Students are required to enroll in an additional fifteen contact hours of instruction at the International Center for Photography. Courses range from one-day workshops to full-semester courses. Permission of instructor only.  The class will be limited to 20 students.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "11:00am-12:50pm",
        "professor": "John Miller",
        "location": "501 Diana Center",
        "capacity": 20,
        "enrollment": 22
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS3004BC",
    "name": "Photographing the Anthropocene",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) How have artists been informed and influenced by the natural world? This course will examine how photographic artists have responded to nature, ecology, and the environment. Augmented by literary texts by artists, scientists, poets, and ecologists, we will explore how close-looking might inform an artist’s practice regarding the living environment - its bounty - and its degradation. Readings include texts by Robin Wall Kimmerer, Masanobu Fukuoka, Robert Macfarlane, Terry Tempest Williams, Rebecca Solnit, Barry Lopez, John McPhee, Akira Hasegawa, and others. Calling on a canon of photographic works from around the globe, students will study book-length photographic essays whose makers have seen art as a form of praise of the natural world and those who investigate the relationship between art and environmental activism. Susan Derges; Meghann Riepenhoff; Masahisa Fukashe; Pedro David; Stephen Gill; Ron Jude; Dornith Doherty; David Maisel, Zhao Renhui; Mandy Barker; Pablo Lopez Luz are some of the artists studied. The course will start by exploring techniques photographers have used over the past two centuries to respond to the natural world’s beauty and complexity. During the second half of the term, we will examine how artists have depicted shrinking natural landscapes, environmental destruction, and global warming and why they might question human centrality in the sentient world. Students will produce a semester-long photographic project on an ecological theme. This course will start by exploring techniques photographers have used over the past century to respond to the natural world’s beauty and complexity. During the second half of the term, we will examine how contemporary photographers are depicting shrinking natural landscapes, environmental destruction, and global warming and why some artists are beginning to question human centrality in the sentient world.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "2:10pm-5:00pm",
        "professor": "Diana Matar",
        "location": "613 MILSTEIN CENTER",
        "capacity": 12,
        "enrollment": 9
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS3031BC",
    "name": "IMAGERY AND FORM IN THE ARTS",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Operation of imagery and form in dance, music, theater, visual arts and writing; students are expected to do original work in one of these arts. Concepts in contemporary art will be explored.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "10:10am-12:00pm",
        "professor": "Jozefina Chetko",
        "location": "501 Diana Center",
        "capacity": 24,
        "enrollment": 27
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS3032BC",
    "name": "Worlding Otherwise: Speculative Fictions and Game Engine Ecologies",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Technologically and Digitally\" Requirement (Barnard) Sustainability Related Worlding Otherwise is a studio course exploring how artists use game engines to craft speculative and ecological narratives. Using tools like Unreal Engine and Blender, students will visualize alternate futures, mythologies, and socio-political realities through creating immersive virtual environments. Key questions include: How might the game environment lend itself to storytelling? How can speculative fiction act as a method of critique? What can we learn from artists who blend technology with mythology and alternative futures? The semester culminates in a final project: a short cinematic piece, interactive environment, or hybrid installation created within a game engine.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "6:10pm-9:00pm",
        "professor": "Jozefina Chetko",
        "location": "402 Diana Center",
        "capacity": 20,
        "enrollment": 17
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS3531BC",
    "name": "ADVANCED SENIOR STUDIO II",
    "description": "Advanced Senior Studio II is a critique class that serves as a forum for senior Visual Arts majors to develop and complete one-semester studio theses.  The priorities are producing a coherent body of studio work and understanding this work in terms of critical discourse.  The class will comprise group critiques and small group meetings with the instructor. Field trips and visiting artist lectures will augment our critiques. Please visit: https://arthistory.barnard.edu/senior-thesis-project-art-history-and-visual-arts-majors",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "2:10pm-6:00pm",
        "professor": "John Miller",
        "location": "",
        "capacity": 20,
        "enrollment": 7
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS3625BC",
    "name": "Rewriting History: Queer-Feminist Art from the 1970s to Now",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) In 1987, the queer-feminist Chicana scholar and poet Gloria Anzaldúa reflected on the politics of writing and rewriting histories. Mobilized by the social revolutions of the 1970s and 1980s, Anzaldúa sought to intervene in contemporary history, arguing that the act of retrieval—mining and sifting through our past—is necessary for sensing and creating uninhibited possibilities. Drawing on Anzaldúa’s understanding of the stakes of historiography, this course explores how artists have sought to reimagine queer-feminist pasts and enact latent futures. It focuses on the period from the 1970s onward, when the proliferation of mnemonic, time-based media, such as video, sound, slides, and photography, as well as ephemeral forms like performance and participation, emerged as significant material and conceptual foci for artists. Artists’ engagements with institutions crucial to the creation and circulation of history, memory, and knowledge—such as universities, the mass media, AI companies, and museums—are examined alongside enduring queer-feminist themes of education, motherhood, family, home, exile, kin, and futurity. Students will become cognizant of how contemporary art influences cultural, political, and social traditions and institutions, and how “old” and “new” ideas co-exist and conflict. The course offers an art historical perspective on contemporary art, mapping its relations to late modern art, while also foregrounding the question: how can we, as “contemporaries,” engage with art and art history in a way that responds to the demands of the present? Artists we examine include Mary Kelly, Ana Mendieta, Magali Lara, Jenny Holzer, Emily Kame Kngwarray, Madeleine Hunt-Ehrlich, D. Harding, Simone Leigh, and Jesse Darling. Writers include Anzaldúa, Rosalyn Deutsche, Tina Campt, Aileen Moreton Robinson, and Ruha Benjamin.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Veronica Tello",
        "location": "328 MILBANK HALL",
        "capacity": 55,
        "enrollment": 18
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS3782BC",
    "name": "Prints in 17th-Century Holland: A Curatorial Seminar",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Holland in the seventeenth century was home to some of the most innovative and influential printmakers in the history of art, most important among them, Rembrandt van Rijn. In addition, known for producing the most professional engravers, it became the main center for the issuing and distribution of prints in Europe. Held primarily in The Met’s Drawings and Prints Study Room, this class examines printmaking from this period in its many forms – from masterworks of Dutch landscape to political broadsheets. Reproductive printmakers and peintres-graveur, professional printmakers and amateurs will be considered. How prints were made, published, and sold will be explored. Students will learn how to identify techniques as well as quality of impression by examining original works in the collection of The Met’s Department of Drawings and Prints. We will also look at the subject from the point of view of the museum curator – how works are collected and exhibitions created.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "10:10am-12:00pm",
        "professor": "Nadine Orenstein",
        "location": "111 MILSTEIN CENTER",
        "capacity": 15,
        "enrollment": 15
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS3864BC",
    "name": "Signals: Networks, Publics, and Performance",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Technologically and Digitally\" Requirement (Barnard) This visual arts seminar explores the pirating, transformation, and circulation of media from the 1960s to the present. It examines the ways that media artists question public participation, democratic commitment, and collective memory. During the 1960s in the United States and abroad, the promise of networked communication prompted a consideration of global connectivity that brought artists and artworks outside of the gallery into the public sphere. Artist, often activists, explored the dissemination of information, and they commandeered messaging. Many of these artists positioned their output against mainstream media, while other artists seized existing media streams with the aim, optimistically, to alter them. Case studies include Stan VanDerBeek, Dara Birnbaum, Black Audio Collective, Tiffany Sia, Sondra Perry, and CAMP.  This course brings together seminar discussions, the practice of making, and the hosting of practitioners; it is designed to offer students an introduction to various aspects of media as it is crafted and curated within and without museum environments.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "10:10am-12:00pm",
        "professor": "Janina Marshall",
        "location": "501 Diana Center",
        "capacity": 15,
        "enrollment": 13
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS3867BC",
    "name": "Photo as Material: A Studio Lab in Interdisciplinary Practices",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Images today can feel increasingly unstable, untethered to physical and interpersonal experience, and also unstoppable, generating and proliferating at accelerating speeds. What do we do with all this material? What are the global consequences of the mass circulation of images? And how do artists specifically make sense of the contemporary state of photography? This course invites students into a non-conventional, interdisciplinary approach to making, reading, critiquing, and relating to images. We begin with the fundamentally physical elements of photography—space, light, and lens—and end with the embedded histories, social relations, and personal narratives that photographs can trace or carry. We discuss case studies and readings by and about artists and theorists who research and make work across international contexts, exploring, for example, how early colonial histories of photography prefigure its contemporary conditions, and how images can echo or challenge patterns of displacement and resistance. We create artworks informed by this research, exploring how to physically manipulate, present, and disseminate images in hands-on thematic projects that push photography beyond the screen or frame and into the material world.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "10:10am-2:00pm",
        "professor": "Mira Dayal",
        "location": "402 Diana Center",
        "capacity": 15,
        "enrollment": 15
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS3868BC",
    "name": "Tokyo",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) This seminar will take an interdisciplinary approach to the history of the complex and dynamic city of Tokyo from the mid-19th century to the present. The class will discuss the impact that industrialization and sustained migration have had on the city’s housing and infrastructure and will examine the often equivocal and incomplete urban planning projects that have attempted to address these changes from the Ginza Brick Town of the 1870s, to the reconstruction efforts after the Great Kanto Earthquake. We will examine the impact of and response to natural disasters and war. We will discuss the emergence of so-called “new town” suburban developments since the 1960s and the ways in which these new urban forms reshaped daily life. We will discuss the bucolic prints of the 1910s through the 1930s that obscured the crowding, pollution and political violence and compare them with the more politically engaged prints and journalistic photographs of the era. We will also consider the apocalyptic imagery that is so pervasive in the treatment of Tokyo in post-war film and anime. There are no prerequisites, but coursework in modern art history, urban studies, and modern Japanese history are highly recommended.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Jonathan Reynolds",
        "location": "502 Diana Center",
        "capacity": 15,
        "enrollment": 15
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS3933BC",
    "name": "BUOYANCY",
    "description": "“Be like a duck. Calm on the surface, but always paddling like the dickens underneath.”,Michael Caine , We do not live our own desires. Pressing ourselves into heavy molds not made for our bodies compresses us, tears our skin, and bruises our features. It is hard to breathe. We sink. Weight harbors the downward pull. It attaches itself in many ways but there are countless ways to set it down, to be free. This takes practice and skill. The common task of this visual arts seminar is to distinguish ourselves from the weight we carry. Through a variety or reading, writing, and making activities we shall seek out and contact levity: that gravity that changes our bodies, make us light of touch, aerates and propels us toward the state of buoyancy. Not for the faint of heart.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Irena Haiduk",
        "location": "402 Diana Center",
        "capacity": 20,
        "enrollment": 11
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHIS3960BC",
    "name": "SENIOR RESEARCH SEMINAR",
    "description": "Prerequisites: Course open to Barnard Art History majors only. Independent research for the senior thesis. Students develop and write their senior thesis in consultation with an individual faculty adviser in Art History and participate in group meetings scheduled throughout the senior year.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "6:10pm-8:00pm",
        "professor": "Elizabeth Hutchinson",
        "location": "502 Diana Center",
        "capacity": 25,
        "enrollment": 21
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHUM1399UN",
    "name": "COLLOQUIUM ON MAJOR TEXTS: MIDDLE EAST/INDIA",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) This seminar is an exploration of some \"great books\" from the Middle East and South Asia. We will read books, plays, stories, and poems in English translation that were originally written in Arabic, Persian, Bangla, Sanskrit. From the Thousand and One Nights to an Arabic epic about a warrior princess to the Bhagavad Gita, we will examine themes of storytelling, gender, politics, and the nature of divinity. With the exception of one Sudanese novel, we will be focusing on texts from the premodern period, and our focus will be on how to interpret texts, develop arguments about those texts, and learning about cultures of reading and writing in the past.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "6:10pm-8:00pm",
        "professor": "Matthew Keegan",
        "location": "119 MILSTEIN CENTER",
        "capacity": 20,
        "enrollment": 20
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AHUM1400UN",
    "name": "COLLOQUIUM ON MAJOR TEXTS",
    "description": "Satisfies Global Core Requirement (Columbia College and General Studies) Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) This course explores the core classical literature in Chinese, Japanese and Korean Humanities. The main objective of the course is to discover the meanings that these literature offer, not just for the original audience or for the respective cultures, but for us. As such, it is not a survey or a lecture-based course. Rather than being taught what meanings are to be derived from the texts, we explore meanings together, informed by in-depth reading and thorough ongoing discussion.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Lili Xia",
        "location": "111 MILSTEIN CENTER",
        "capacity": 25,
        "enrollment": 25
      },
      {
        "days": [
          "Monday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Seong-Uk Kim",
        "location": "101 KNOX HALL",
        "capacity": 25,
        "enrollment": 25
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "12:10pm-2:00pm",
        "professor": "Gavin Healy",
        "location": "227 PUPIN LABORATORIES",
        "capacity": 25,
        "enrollment": 25
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Michael Como",
        "location": "477 ALFRED LERNER HALL",
        "capacity": 25,
        "enrollment": 0
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AMST1001BC",
    "name": "WHAT IS AMERICAN STUDIES?",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) Sustainability Related Prerequisites: None Corequisites: None What is America? Who is American? How do we live in America? This new lecture course will introduce you to the dynamic, inter-disciplinary field of American Studies.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Lisa Jahn",
        "location": "202 MILBANK HALL",
        "capacity": 35,
        "enrollment": 37
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AMST1011BC",
    "name": "WHAT IS AMERICAN STUDIES-DIS",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "12:00pm-12:50pm",
        "professor": "",
        "location": "202 MILBANK HALLJan 20, 2026 – May 4, 2026",
        "capacity": 35,
        "enrollment": 1
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AMST1112BC",
    "name": "Elementary American Sign Language (ASL) II",
    "description": "This course is an introduction to the basic skills in developing production and comprehension skills in American Sign Language (ASL). Students will learn ASL vocabulary, structure, and grammar. Course content also includes the manual alphabet and numbers. Students will develop basic conversational abilities, culturally appropriate behaviors, and learn about the culture and history of Deaf communities.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday",
          "Friday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Kailyn Aaron-Lozano",
        "location": "405 BARNARD HALL",
        "capacity": 15,
        "enrollment": 15
      },
      {
        "days": [
          "Monday",
          "Wednesday",
          "Friday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Kailyn Aaron-Lozano",
        "location": "405 BARNARD HALL",
        "capacity": 15,
        "enrollment": 16
      },
      {
        "days": [
          "Monday",
          "Wednesday",
          "Friday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Kailyn Aaron-Lozano",
        "location": "405 BARNARD HALL",
        "capacity": 15,
        "enrollment": 15
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AMST3704BC",
    "name": "SENIOR RESEARCH ESSAY SEMINAR",
    "description": "",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Dani Joslyn",
        "location": "613 MILSTEIN CENTER",
        "capacity": 8,
        "enrollment": 3
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Manu Karuka",
        "location": "613 MILSTEIN CENTER",
        "capacity": 8,
        "enrollment": 6
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AMST4210GU",
    "name": "Du Bois Seminar",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies Social Science Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) This seminar engages the life and work of W.E.B. Du Bois, widely understood to be the greatest intellectual in U.S. history. Students will read and discuss Du Bois’s autobiography, and major works across his long and prolific career. Major themes include pan-Africanism, socialism, and peace.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "6:10pm-8:00pm",
        "professor": "Manu Karuka",
        "location": "406 BARNARD HALL",
        "capacity": 16,
        "enrollment": 16
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AMST4400GU",
    "name": "Crime, Sex, Race and the Politics of Purity",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies Social Science Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) The politics of what and who counts as worthy, good, or pure mediates possibilities for political and legal life. This course takes as its central question: how do certain ideas around purity and innocence come to appear natural? By considering a wide range of topics including carceral studies, immigration, race-making, settler colonialism, gender and sexuality and cultural studies, we will uncover the ways that cultural objects circulate and do political work. How are notions of race, crime, and purity produced, policed, and lived? And finally, how might we live otherwise—against innocence?",
    "credits": 4,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "10:10am-12:00pm",
        "professor": "Daria Reaven",
        "location": "119 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 16
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AMST4529GU",
    "name": "The Science of Sex",
    "description": "Satisfies Social Science Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) What is good sex? What, even, is sex? Who should be having it with whom, and when? Why does sex hurt sometimes? Why does it feel incredible, when it does? What makes sex healthy? Normal? Who says? How do they know? Why? Across the past hundred and fifty years, time doctors, biologists, psychologists, feminists, phrenologists, and LGBTQ activists have spent lifetimes struggling over the answers to these questions and more. In this class, we will explore the growth and development of the field of sexology, its vast impact on U.S. and German life and its imbrications with structures of oppression and visions of (often imperfect) liberation. To do so, we will read a range of both primary and secondary sources from a variety of different schools and perspectives. The attempt to scientifically study and define sex fundamentally reshaped both sex and science. It changed how everyday people lived their lives and helping give birth to new scientific disciplines. It also helped produce and police idea of normal, healthy sex, and provided evolutionary justifications for heterosexuality and patriarchy. The activist response – both in and outside of the field of sexology – helped build the modern feminist and LGBTQ movements and reshaped how everyday people made sex of sex, gender, and sexuality. Even if deeply flawed, sexology was also widely contentious, with major scholars having their books burned and banned in both the United States and Germany.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "11:00am-12:50pm",
        "professor": "Dani Joslyn",
        "location": "",
        "capacity": 16,
        "enrollment": 13
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "AMST4697GU",
    "name": "Protect the Dolls: Trans Panics and Queer Liberation",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) Life as a trans person can feel like an unrelenting cacophony of hammers. Around the world, fascist parties and paramilitaries have set their sights on transgender people and through a torrent of accusations of crime and depravity all but authorized violence against trans people. Through explorations of trans* history and social movements in the United States, Turkey, India, and Pakistan (and to a lesser extent Argentina), this course will provide a space to both understand the global anti-gender and anti-trans panic and to relate ourselves to the strategies that trans people have used to both survive and the demands that they have made for structural change and liberation. The goal of this course will be to provide a space of critical study and a site of learning to be in community as well as to equip you with both the knowledge and capacity to understand and intervene in contemporary trans panics wherever you encounter them. Assignments will be a combination of collaborative skill-building, self-reflections, and analyses of the tactics and strategies employed by social movements.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "11:00am-12:50pm",
        "professor": "Dani Joslyn",
        "location": "912 MILSTEIN CENTER",
        "capacity": 15,
        "enrollment": 12
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ANTH2012BC",
    "name": "LAB METHODS ARCHAEOLOGY",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) Only the most recent chapters of the past are able to be studied using traditional historiographical methods focused on archives of textual documents. How, then, are we to analyze the deep history of human experiences prior to the written word? And even when textual archives do survive from a given historical period, these archives are typically biased toward the perspectives of those in power. How, then, are we to undertake analyses of the past that take into account the lives and experiences of all of society’s members, including the poor, the working class, the colonized, and others whose voices appear far less frequently in historical documents? From its disciplinary origins in nineteenth century antiquarianism, archaeology has grown to become a rigorous science of the past, dedicated to the exploration of long-term and inclusive social histories. “Laboratory Methods in Archaeology” is an intensive introduction to the analysis of archaeological artifacts and samples in which we explore how the organic and inorganic remains from archaeological sites can be used to build rigorous claims about the human past. The 2022 iteration of the course centers on assemblages from two sites, both excavated by Barnard’s archaeological field program in the Taos region of northern New Mexico: (1) the Spanish colonial site of San Antonio del Embudo founded in 1725 and (2) the hippie commune known as New Buffalo, founded in 1967. Participants in ANTH BC2012 will be introduced to the history, geology, and ecology of the Taos region, as well as to the excavation histories of the two sites. Specialized laboratory modules focus on the analysis of chipped stone artifacts ceramics, animal bone, glass, and industrial artifacts. The course only demands participation in the seminars and laboratory modules and successful completion of the written assignments, but all students are encouraged to develop specialized research projects to be subsequently expanded into either (1) a senior thesis project or (2) a conference presentation at the Society for American Archaeology, Society for Historical Archaeology, or Theoretical Archaeology Group meeting.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:00pm",
        "professor": "Severin Fowles",
        "location": "113 MILSTEIN CENTER",
        "capacity": 14,
        "enrollment": 14
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ANTH2427BC",
    "name": "ANTHROPOLOGY OF CLIMATE CHANGE",
    "description": "Satisfies Social Science Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Sustainability Focused This course focuses on some of the present, and possible future, socio-ecological conditions of life on planet earth. In particular we will work to understand the historic, economic, political, and socio-cultural forces that created the conditions we call climate change. With this we will take a particular interest in the question of how race, ethnicity, Indigeneity, class, and gender articulate with the material effects of climate change. The course also focuses on how we, as scholars, citizens, and activists can work to alter these current conditions in ways that foster social and ecological justice for all living beings. Although we will ground our scholarship in anthropology, to encourage interdisciplinary and even transdisciplinary thought, weekly readings will be drawn from across scholarly and activist canons. While becoming familiar with scholarly and activist conversations about space and place, risk and vulnerability, and ontology and epistemology, we will work through a series of recent events as case studies to understand causes, effects, affects, and potential solutions. <gdiv></gdiv>",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Paige West",
        "location": "405 MILBANK HALL",
        "capacity": 213,
        "enrollment": 40
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ANTH3160UN",
    "name": "THE BODY AND SOCIETY",
    "description": "As an introduction to the field of medical anthropology, this seminar addresses themes of health, affliction, and healing across sociocultural domains.  Concerns include critiques of biomedical, epidemiological and other models of disease and suffering; the entwinement of religion and healing; technocratic interventions in healthcare; and the sociomoral underpinnings of human life, death, and survival.  A 1000 level course in Anthropology is recommended as a prerequisite, although not required.  Enrollment limited to 30. 4 units",
    "credits": 4,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "10:10am-12:00pm",
        "professor": "Gina Jae",
        "location": "111 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 17
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ANTH3223BC",
    "name": "Gender Archaeolxgy",
    "description": "Satisfies \"Thinking About Social Difference\" Requirement (Barnard) This seminar critically reexamines the ancient world from the perspective of gender archaeology. Though the seedlings of gender archaeology were first sown by of feminist archaeologists during the 70’s and 80’s, this approach involves far more than simply ‘womanizing’ androcentric narratives of past. Rather, gender archaeology criticizes interpretations of the past that transplant contemporary social roles onto the archaeological past, casting the divisions and inequalities of today as both timeless and natural. This class challenges the idea of a singular past, instead championing a turn towards multiple, rich, messy, intersectional pasts. The ‘x’ in ‘archaeolxgy’ is an explicit signal of our focus on this diversity of pasts and a call for a more inclusive field of practice today.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "10:10am-12:00pm",
        "professor": "Camilla Sturm",
        "location": "102 SULZBERGER HALL",
        "capacity": 16,
        "enrollment": 4
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ANTH3234BC",
    "name": "Indigenous Place-Thought",
    "description": "Satisfies Social Science Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Sustainability Related This seminar considers what it means to be of a place and to think with and be committed to that place—environmentally, politically, and spiritually. After locating ourselves in our own particular places and place-based commitments, our attention turns to the Indigenous traditions of North America, to accounts of tribal emergence and pre-colonial being, to colonial histories of land dispossession, to ongoing struggles to protect ecological health and land-based sovereignty, to the epistemological and moral systems that have developed over the course of many millennia of living with and for the land, and to the contributions such systems might make to our collective future. The seminar’s title is borrowed from an essay on “Indigenous place-thought” by Mohawk/Anishinaabe scholar Vanessa Watts.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Severin Fowles",
        "location": "324 MILBANK HALL",
        "capacity": 30,
        "enrollment": 19
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ANTH3242X",
    "name": "Madness in The Welfare City: Freedom and Capture in American Social Service Systems",
    "description": "Satisfies Social Science Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Madness in the Welfare City: Freedom and Capture in American Social Service Systems examines how contemporary welfare and nonprofit public health, housing, and mental health systems shape daily life and inner worlds. The course explores the psychic life of social service systems where care is often delivered  by intermediary nonprofits. We examine how clients come to feel and/or understand that money is made off them, that they are being surveilled, manipulated, or disappeared inside care systems; and how these understandings and attendant feelings reflect the extraction and opacity characteristic of devolved social service systems. Moving across ethnography, political anthropology, and psychoanalytic readings, we ask how these systems produce forms of distress that may appear as paranoia, withdrawal, or deadly forms of self-harm. How are madness and reason, greed and altruism, freedom and captivity, distributed in encounters with care providers on the ground? By the end of the course, students will be able to connect political economy, affect theory, and psychoanalytic approaches to understand how decentralized welfare regimes alternately trap and exclude clients—a process that can be experienced as madness itself. Students will map a local care system for their final project.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Clare Casey",
        "location": "",
        "capacity": 15,
        "enrollment": 0
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ANTH3243BC",
    "name": "Sin, Disease, Subversion and the Experience of Race in Latin America",
    "description": "Satisfies Social Science Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Course Description This course provides an exploration of how race and racism are produced, reproduced, and resisted from a Latin American perspective. We will examine a conception of race that is often ambiguous, hybrid, and fluid, yet coexists with deeply entrenched forms of racism. We begin by tracing the origins of racial formations to the colonial period, focusing on how race and religion became intertwined. The course then investigates Latin America's role in the medicalization of racialized bodies, particularly in the context of nation-building projects. We will analyze how racism has operated during periods of political violence, authoritarian rule, and transitions to democracy. Given the region's vast heterogeneity, we will critically examine \"Latin America\" as a category and use representative case studies to explore how race is mediated through signifiers such as education, gender, geography, occupation, dress, language, and religion—while ultimately being inscribed on and through the body. Students will explore Indigenous ontologies and epistemologies, and reflect on how the legacies of colonial and state violence persist but are contested. The first half of this course provides an overview of historical events and theoretical debates around the study of race in Latin America. The second half is dedicated to reading ethnographic work on questions of race. The selected books present cases in Peru, Ecuador, Brazil, Puerto Rico, and of immigrants in the United States.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "10:10am-12:00pm",
        "professor": "Paloma Rodrigo Gonzales",
        "location": "101A BARNARD HALL",
        "capacity": 15,
        "enrollment": 13
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ANTH3661UN",
    "name": "SOUTH ASIA",
    "description": "This course draws on ethnography, history, fiction, and other genres to think about diverse peoples and places in the region known as South Asia. Rather than attempt to fix or define \"South Asia\" as a singular category, we will explore how particular social and scholarly categories through which dimensions of South Asian life have come to be known (such as caste, class, religion, gender, sexuality, disability, and kinship) are experienced, negotiated, and reworked by actual persons in specific situations. By examining both categories and practices, we will ask: What kinds of relationships exist between the messiness of everyday life and the classifications used by both scholars and \"local\" people to describe and make sense of it? How do scholarly and bureaucratic ideas not merely reflect but also shape lived realities? How do lived realities affect the ways in which categories are named and understood? In addressing such questions, categories sometimes thought of as stable or timeless emerge as, in fact, contingent and embodied.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Elizabeth Green",
        "location": "912 MILSTEIN CENTER",
        "capacity": 15,
        "enrollment": 4
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ANTH3663UN",
    "name": "The Ancient Table: Archaeology of Cooking and Cuisine",
    "description": "Prerequisites: None Humans don’t just eat to live. The ways we prepare, eat, and share our food is a complex reflection of our histories, environments, and ideologies. Whether we prefer coffee or tea, cornbread or challah, chicken breast or chicken feet, our tastes are expressive of social ties and social boundaries, and are linked to ideas of family and of foreignness. How did eating become such a profoundly cultural experience? This seminar takes an archaeological approach to two broad issues central to eating: First, what drives human food choices both today and in the past? Second, how have social forces shaped practices of food acquisition, preparation, and consumption (and how, in turn, has food shaped society)? We will explore these questions from various evolutionary, physiological, and cultural viewpoints, highlighted by information from the best archaeological and historic case studies. Topics that will be covered include the nature of the first cooking, beer-brewing and feasting, writing of the early recipes, gender roles and ‘domestic’ life, and how a national cuisine takes shape. Through the course of the semester we will explore food practices from Pleistocene Spain to historic Monticello, with particular emphasis on the earliest cuisines of China, Mesoamerica, and the Mediterranean.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "12:10pm-2:00pm",
        "professor": "Camilla Sturm",
        "location": "214 MILBANK HALL",
        "capacity": 16,
        "enrollment": 18
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ANTH3665UN",
    "name": "The Politics of Care",
    "description": "Satisfies Social Science Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Semester: What are the consequences of entrenched inequalities in the context of care? How might we (re)imagine associated practices as political projects? Wherein lie the origins of utopic and dystopic visions of daily survival? How might we track associated promises and failures as they travel across social hierarchies, nationalities, and geographies of care? And what do we mean when we speak of “care”? These questions define the scaffolding for this course. Our primary goals throughout this semester are threefold.  First, we begin by interrogating the meaning of “care” and its potential relevance as a political project in medical and other domains. Second, we will track care’s associated meanings and consequences across a range of contents, including urban and rural America, an Amazonia borderland, South Africa, France, and Mexico. Third, we will address temporal dimensions of care, as envisioned and experienced in the here-and-now, historically, and in a futuristic world of science fiction. Finally, and most importantly, we will remain alert to the relevance of domains of difference relevant to care, most notably race, gender, class, and species. Upper level seminar; 4 points Summer: What do we mean when we speak of “care”? How might we (re)imagine practices of care as political and moral projects? What promises, paradoxes, or failures surface amid entrenched inequalities? And what hopes, desires, and fears inform associated utopic and dystopic visions of daily survival? These questions will serve as a scaffolding of sorts for this course, and our primary goals are fourfold. First, we will begin by interrogating the meaning of “care” and its potential relevance as a political project in medical and other domains. Second, we will track care’s associated meanings and consequences across a range of contents, communities, and geographies of care. Third, we will remain alert to the temporal dimensions of care, as envisioned and experienced historically, in the here-and-now, and in the futuristic world of science fiction. Finally, we will consider the moral underpinnings of intra-human alongside interspecies care. Enrollment limited to 10; 4 points",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "12:10pm-2:00pm",
        "professor": "Gina Jae",
        "location": "102 SULZBERGER HALL",
        "capacity": 16,
        "enrollment": 17
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ANTH3828UN",
    "name": "THE ANTHROPOLOGY OF WAR",
    "description": "In this class, we will think about the various ways in which philosophers, social theorists, historians and anthropologists have thought about war, violence, and responsibility. The course focuses on a set of themes and questions: for example, the nature of violence and the question of responsibility or accountability, shifting technologies of warfare, and the phenomenology and aftermath of warfare, for civilians and for combatants. The reading list incorporates different approaches to such questions—from historical to philosophical to ethnographic accounts.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:00pm",
        "professor": "Nadia Abu El-Haj",
        "location": "111 MILSTEIN CENTER",
        "capacity": 20,
        "enrollment": 15
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ANTH3872BC",
    "name": "SENIOR THESIS SEMINAR II",
    "description": "Prerequisites: Must complete ANTH BC3871x. Limited to Barnard Senior Anthropology Majors. Offered every Spring. Discussion of research methods and planning and writing of a Senior Essay in Anthropology will accompany research on problems of interest to students, culminating in the writing of individual Senior Essays. The advisory system requires periodic consultation and discussion between the student and her adviser as well as the meeting of specific deadlines set by the department each semester.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Elizabeth Green",
        "location": "502 Diana Center",
        "capacity": 30,
        "enrollment": 24
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ANTH3932BC",
    "name": "CLIM CHNG/GLOBAL MIGR/HUM RGT",
    "description": "Satisfies Social Science Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) While the existence of processes of anthropogenic climate change is well established, predictions regarding the future consequences of these processes are far less certain. In no area is the uncertainty regarding near and long term effects as pronounced as in the question of how climate change will affect global migration. This course will address the issue of climate migration in four ways. First, the course will examine the theoretical and empirical literatures that have elucidated the nature of international migration in general. Second, the course will consider the phenomena of anthropogenic climate change as it relates to migration. Third, the course will consider how human rights and other legal regimes do or do not address the humanitarian issues created by anthropogenic climate change. Fourth, the course will synthesize these topics by considering how migration and climate change has arisen as a humanitarian, political, and economic issue in the Pacific. Human Rights elective.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Stephanie Ratte",
        "location": "308 Diana Center",
        "capacity": 20,
        "enrollment": 20
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ARCH1010UN",
    "name": "DESIGN FUTURES: NEW YORK CITY",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Locally - New York City\" Requirement (Barnard) Satisfies \"Thinking Technologically and Digitally\" Requirement (Barnard) How does design operate in our lives? What is our design culture? In this course, we explore the many scales of design in contemporary culture -- from graphic design to architecture to urban design to global, interactive, and digital design. The format of this course moves between lectures, discussions, collaborative design work and field trips in order to engage in the topic through texts and experiences.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-4:25pm",
        "professor": "Richard Rouhe",
        "location": "502 Diana Center",
        "capacity": 20,
        "enrollment": 20
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-4:25pm",
        "professor": "Marina Correia",
        "location": "504 Diana Center",
        "capacity": 20,
        "enrollment": 19
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-4:25pm",
        "professor": "Clara Kraft Isono",
        "location": "501 Diana Center",
        "capacity": 20,
        "enrollment": 20
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ARCH1020UN",
    "name": "INTRO-ARCH DESIGN/VIS CULTURE",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Introductory design studio to introduce students to architectural design through readings and studio design projects. Intended to develop analytic skills to critique existing media and spaces. Process of analysis used as a generative tool for the students own design work. Must apply for placement in course. Priority to upperclass students. Class capped at 16.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-3:00pm",
        "professor": "Madeline Schwartzman",
        "location": "116 LEWISOHN HALL",
        "capacity": 14,
        "enrollment": 10
      },
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-3:00pm",
        "professor": "Jesse McCormick",
        "location": "116 LEWISOHN HALL",
        "capacity": 14,
        "enrollment": 7
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ARCH2101UN",
    "name": "ARCHITECTURAL DESIGN: SYSTEMS AND MATERIALS",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Technologically and Digitally\" Requirement (Barnard) Sustainability Focused This architectural design studio explores material assemblies, techniques of fabrication, and systems of organization. These explorations will be understood as catalysts for architectural analysis and design experimentation. Both designed objects and the very act of making are always embedded within a culture, as they reflect changing material preferences, diverse approaches to durability and obsolescence, varied understandings of comfort, different concerns with economy and ecology. They depend on multiple resources and mobilize varied technological innovations. Consequently, we will consider that making always involves making a society, for it constitutes a response to its values and a position regarding its technical and material resources. Within this understanding, this studio will consider different cultures of making through a number of exercises rehearse design operations at different scales—from objects to infrastructures.",
    "credits": 5,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "9:00am-11:50am",
        "professor": "Michael Schissel",
        "location": "404 Diana Center",
        "capacity": 16,
        "enrollment": 16
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ARCH2103UN",
    "name": "ARCHITECTURAL DESIGN: ENVIRONMENTS AND MEDIATIONS",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Technologically and Digitally\" Requirement (Barnard) Sustainability Related This architectural design studio course explores modes of visualization, technologies of mediation and environmental transformations. These explorations will be used as catalysts for architectural analysis and design experimentation. Introducing design methodologies that allow us to see and to shape environmental interactions in new ways, the studio will focus on how architecture may operate as a mediator – an intermediary that negotiates, alters or redirects multiple forces in our world: physical, cultural, social, technological, political etc. The semester will progress through three projects that examine unique atmospheric, spatial and urban conditions with the aid of multimedia visual techniques; and that employ design to develop creative interventions at the scales of an interface, space and city.",
    "credits": 5,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "9:00am-11:50am",
        "professor": "Marina Correia",
        "location": "404 Diana Center",
        "capacity": 16,
        "enrollment": 14
      },
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "9:00am-11:50am",
        "professor": "Ines Yupanqui",
        "location": "404 Diana Center",
        "capacity": 16,
        "enrollment": 13
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ARCH3117UN",
    "name": "MOD ARCHITECTURE IN THE WORLD",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) Note: Designed for but not limited to sophomores; enrollment beyond 60 is at the discretion of the instructor. Co-requisite: ARCH UN3118. How has architecture been “modern”? This course will introduce students to this contentious and contradictory concept emerging across the world during a time in which ideas and tools similar to ours were used for seeing and ordering constructed environments and architectural thinking. It introduces students to the history of modern architecture as an art of building as well as a discursive field, whose historical consciousness played a part in its historical development. The course is structured chronologically and encourages experiential learning around episodes that informed the development of the built environment and the architecturally “modern.” Students will gain hands-on practice in researching and writing architectural history, theory, and criticism: skills that lie at the basis of conceptual architectural practices. While a one-semester course will not provide a full survey of buildings, events, and people associated with modern architecture, students will develop the critical tools to identify, approach, and comprehend such histories. The following areas of focus anchor the course, and students learn about each by understanding the establishment and institution of structures nourishing and supporting them, which have persisted into the present: Architecture as made, thought, and taught—enmeshed with power and ideas, social concerns, intellectual and public debates, and diverse forms of cultural production Makers, thinkers, and organizers of the designed or built environment Designed constructions as the material ends and means of extraction, refinement, trade, and the labor associated with each Sites, institutions, media, events, and practices that have come to hold meaning in architectural discourse Concerns with both the past and the future as a basis for architectural theory Modernization, modernism, and modernity as drivers for events, their historical narration, and the dissemination of these architectural narratives The conceptual writing practices of history, theory, and criticism The course is designed to accommodate multiple styles of learning. Course components include weekly lectures and discussions of assigned readings; research and writing assignments designed so that students may pursue individual interests and develop a variety of skills; shared visits to archives; and individual and small group visits to museums. This course has no prerequisites, but demands critical thinking and reading skills.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Anooradha Siddiqi",
        "location": "323 MILBANK HALL",
        "capacity": 60,
        "enrollment": 61
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ARCH3118UN",
    "name": "MODERN ARCHITECTURE IN THE WORLD - DISC",
    "description": "N/A",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Anooradha Siddiqi",
        "location": "502 Diana Center",
        "capacity": 20,
        "enrollment": 20
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Anooradha Siddiqi",
        "location": "502 Diana Center",
        "capacity": 20,
        "enrollment": 13
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Anooradha Siddiqi",
        "location": "501 Diana Center",
        "capacity": 20,
        "enrollment": 21
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ARCH3120UN",
    "name": "CITY,LANDSCAPE, & ECOLOGY",
    "description": "Satisfies Social Science Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking with Historical Perspective\" Requirement (Barnard) Sustainability Focused City, Landscape, Ecology is a thematically driven course that centers on issues and polemics related to landscape, land settlement and ecology over the past two centuries. The class looks at changing attitudes to the natural world from the eighteenth century to the present, tracing important historical shifts in the consideration of nature across the ecological sciences, conservation practices, landscape design, and environmental activism, law and policy. Lectures focus on the critical role that artists and architects have played, and are to play, in making visible the sources of environmental degradation and in developing new means of mitigating anthropogenic ecological change. City, Landscape, Ecology is divided into three parts. Part I explores important episodes in the history of landscape: picturesque garden theory, notions of “wilderness” as epitomized in national and state parks in the United States, Modern and Postmodern garden practices, and place of landscape in the work of artists from the 1960s to the present. The purpose here is to better understand the role that territorial organization plays in the construction of social practices, human subjectivities, and technologies of power. Lectures in this part are shaped around a dialectical pair of historical episodes–– for example, the picturesque garden is paired with the enclosure of the commons, and American national parks are discussed in relation to the systematic removal of native peoples. We then turn to ecology and related issues of climate, urbanization and sustainability in Part II. Here we will look at the rise of ecological thinking in the 1960s; approaches to the environment that were based on the systems-thinking approach of the era. In the session “Capitalism, Race and Population Growth” we examine the history of the “crisis” of scarcity from Thomas Robert Malthus, to Paul R. Ehrlich (The Population Bomb, 1968) to today and look at questions of environmental racism, violence and equity. The course concludes with Part III on Environmental Repair. At this important juncture in the course, we will ask what is to be done today. We’ll examine the work of contemporary theorists, architects, landscape architects, policy makers and environmentalists who have channeled some of the lessons of the past in proposing lasting solutions to our land management and ecological crises of the present and future.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Ralph Ghoche",
        "location": "504 Diana Center",
        "capacity": 60,
        "enrollment": 60
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ARCH3202UN",
    "name": "ADVANCED ARCHITECTURAL DESIGN II",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Locally - New York City\" Requirement (Barnard) Satisfies \"Thinking Technologically and Digitally\" Requirement (Barnard) Prerequisite: ARCH UN3201. Advanced Architectural Design II culminates the required studio sequence in the major. Students are encouraged to consider it as a synthetic studio where they advance concepts, research methodologies and representational skills learned in all previous studios towards a semester-long design project. Field trips, lectures, and discussions are organized in relation to studio exercises.",
    "credits": 5,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "9:00am-11:50am",
        "professor": "Nick Chapman",
        "location": "116 LEWISOHN HALL",
        "capacity": 42,
        "enrollment": 33
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ARCH3312UN",
    "name": "SPECIAL TOPICS IN ARCHITECTURE",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) See the Barnard and Columbia Architecture Department website for the course description: https://architecture.barnard.edu/architecture-department-course-descriptions",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Leah Meisterlin",
        "location": "501 Diana Center",
        "capacity": 16,
        "enrollment": 16
      },
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Marlon Davis",
        "location": "501 Diana Center",
        "capacity": 16,
        "enrollment": 16
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ARCH3901UN",
    "name": "SENIOR SEMINAR",
    "description": "See the Barnard and Columbia Architecture Department's website for the course description: https://architecture.barnard.edu/architecture-department-course-descriptions",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "12:10pm-2:00pm",
        "professor": "Anooradha Siddiqi",
        "location": "502 Diana Center",
        "capacity": 16,
        "enrollment": 8
      },
      {
        "days": [
          "Monday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Ignacio Gonzalez Galan",
        "location": "404 BARNARD HALL",
        "capacity": 16,
        "enrollment": 16
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ARCH4300GU",
    "name": "The Just City: Global Debates in Urban Planning and Policy",
    "description": "Satisfies Social Science Requirement (Barnard) Satisfies \"Thinking About Social Difference\" Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Urbanization is inherently unequal, inscribing social, economic, environmental, and political unevenness into the spatial fabric of the city. But the distribution of such inequality is not inevitable. Urbanization is a product of the collective decisions we make (or choose not to make) in response to the shared challenges we face in our cities. And, thus, the patterns of urbanization can be changed. This is the task of urban planning and the starting point for this advanced seminar, which asks how we can reshape our cities to be more just—to alleviate inequality rather than compound it. In embarking on this effort, we face numerous “wicked” problems without clear-cut solutions. The approaches one takes in addressing urban inequality are therefore fundamentally normative—they are shaped by one’s place in the world and one’s view of it. The central challenge in addressing inequality is thus establishing a basis for collective action amongst diverse actors with differing—and sometimes conflicting—values and views. In other words, planning the just city a matter of both empathy and debate. In this course, we will endeavor to develop informed positions that can help us engage with others as a basis for taking collective action. The course is organized into four 3-week modules, each of which addresses a dimension of the just city: equity, democracy, diversity, and sustainability. In the first week of each module, we will discuss how the issue has been understood in history and theory (with an emphasis on tradeoffs between different priorities and values); in the second week, we will apply this discussion to a global case study prepared and presented by a team of students; and in the third week, we will hold an in-class debate to determine what should be done. Specific case studies vary each year.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Nick Smith",
        "location": "502 Diana Center",
        "capacity": 16,
        "enrollment": 14
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ASCM2003UN",
    "name": "INTRO TO ISLAMIC CIVILIZATION",
    "description": "Satisfies Global Core Requirement (Columbia College and General Studies) This course offers an introduction to the intellectual, social, political, and cultural formations resulting from the revelation of Islam in the Arabian Peninsula in the 7th century until around 1800 CE. It is a “civilization” course and is introductory in nature. It is not a course in Islamic history, religion, philosophy, art, science, or literature, although all of these will be considered in various ways throughout the semester. The intent of the course is to survey the structures, themes, keywords, and subjects that are of interest for the study of Islamic societies, and to encounter a sampling of the historical sources that inform such surveys. Whether through documents, letters, sermons, explanations, publications, songs, or literature, the intention is to use historical sources in order to illuminate our understanding of the events of the past, and in particular, to help the student evaluate narratives about the past for themselves. The course consists of a lecture and a recitation. All students must be registered for and attend both. The lectures will contextualize the required readings and primary sources, and students will participate in discussions about them in recitation. In addition to weekly readings, assignments include a weekly response post (~1 page), a midterm exam and a final exam. All of the course materials are presented in English",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Nathanael Shelley",
        "location": "302 BARNARD HALL",
        "capacity": 45,
        "enrollment": 45
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ASCM2008UN",
    "name": "CONTEMP ISLAMIC CIVILIZATION",
    "description": "Satisfies Global Core Requirement (Columbia College and General Studies) Lecture and recitation. No previous study of Islam is required. The early modern, colonial, and post-colonial Islamic world studied through historical case studies, translated texts, and recent anthropological research. Topics include Sufism and society, political ideologies, colonialism, religious transformations, poetry, literature, gender, and sexuality.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Matthew Keegan",
        "location": "207 MILBANK HALL",
        "capacity": 40,
        "enrollment": 36
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ASCM2113UN",
    "name": "INTRO TO ISLAMIC CIV-REC",
    "description": "This course offers an introduction to the intellectual, social, political, and cultural formations resulting from the revelation of Islam in the Arabian Peninsula in the 7th century until around 1800 CE. It is a “civilization” course and is introductory in nature. It is not a course in Islamic history, religion, philosophy, art, science, or literature, although all of these will be considered in various ways throughout the semester. The intent of the course is to survey the structures, themes, keywords, and subjects that are of interest for the study of Islamic societies, and to encounter a sampling of the historical sources that inform such surveys. Whether through documents, letters, sermons, explanations, publications, songs, or literature, the intention is to use historical sources in order to illuminate our understanding of the events of the past, and in particular, to help the student evaluate narratives about the past for themselves. The course consists of a lecture and a recitation. All students must be registered for and attend both. The lectures will contextualize the required readings and primary sources, and students will participate in discussions about them in recitation. In addition to weekly readings, assignments include a weekly response post (~1 page), a midterm exam and a final exam. All of the course materials are presented in English",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "1:10pm-2:00pm",
        "professor": "Nathanael Shelley",
        "location": "501 Diana Center",
        "capacity": 20,
        "enrollment": 1
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "3:10pm-4:00pm",
        "professor": "Nathanael Shelley",
        "location": "222 MILBANK HALL",
        "capacity": 20,
        "enrollment": 2
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ASCM2118UN",
    "name": "CONTMP ISLAMIC CIVILIZATN-DISC",
    "description": "Required discussion section for ASCM UN2008: Contemporary Islamic Civilization",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-11:00am",
        "professor": "Matthew Keegan",
        "location": "225 MILBANK HALL",
        "capacity": 15,
        "enrollment": 2
      },
      {
        "days": [
          "Friday"
        ],
        "time": "11:10am-12:00pm",
        "professor": "Matthew Keegan",
        "location": "214 MILBANK HALL",
        "capacity": 15,
        "enrollment": 1
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ASRL2034BC",
    "name": "AN INTRODUCTION TO BUDDHIST BELIEF AND PRACTICE IN SOUTHEAST ASIA",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) This course seeks to introduce students to the diversity of doctrines held- and practices performed by Buddhists in Southeast Asia.  By focusing on how specific beliefs and practices are tied to particular locations and particular times we will be able to explore in detail the religious institutions, artistic, architectural, and musical traditions, textual production and legal and doctrinal developments of Buddhism over time and within its socio-historical context. Religion is never divorced from its place and its time. Furthermore, by geographically and historically grounding the study of these religions we will be able to examine how their individual ethical, cosmological and soteriological systems effect local history, economics, politics and material culture. We will concentrate first on the person of the Buddha, his many biographies and how he has been followed and worshipped in a variety of ways from Mandalay, Myanmar to Phrae, Thailand, and beyond.  From there we touch on the foundational teachings of the Buddha with an eye to how they have evolved and transformed over time. Finally, we focus on the practice of Buddhist ritual, magic and ethics in monasteries and among lay communities across Southeast Asia.  This section will confront the way Buddhists have thought of issues such as “Just-War,” Women’s Rights and Abortion, Material Culture, etc.. While no one semester course could provide a detailed presentation of the beliefs and practices of Southeast Asian Buddhism, my hope is that we will be able to look closely at certain aspects of the tradition by focusing on how they are practiced across the region. While we will focus on the Theravada lineage of Buddhism, we will also look at Mahayana practices in places like Vietnam and Malaysia, as well as Buddhist encounters with Hindu, Muslim, Catholic, and Taoist practices in the region.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "4:10pm-6:00pm",
        "professor": "",
        "location": "207 MILBANK HALLJan 20, 2026 – May 4, 2026",
        "capacity": 30,
        "enrollment": 12
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ASRL3115BC",
    "name": "WHY DO BAD THINGS HAPPEN TO GOOD PEOPLE?",
    "description": "Satisfies Arts and Humanities Requirement (Barnard) Satisfies \"Thinking Through Global Inquiry\" Requirement (Barnard) Sustainability Related This course is an introduction to the field of inquiry called The Problem of Evil, or Theodicy – that is, the investigation of God in the face of evil and suffering in the world.  How do we justify God? How do we reconcile disaster, pain, and suffering with an all-good, all-knowing, all-compassionate God?   This question arises in all religious traditions, but here we will study only four: the Jewish, Christian, Muslim, and Hindu traditions, each of which proposes its own array of answers. Our emphasis will be on primary texts from each tradition, with introductory and interpretive secondary sources brought in as supplementary.  These primary sources will be discussed in class, but especially in required section meetings.  A sub-theme of the course is the “pastoral” dimension of answers to the Problem of Evil: to what extent are the answers we study comforting?  This course has been created with the many crises presently afflicting our world – COVID-19, climate change, and the injustice of racism, to name a few – in mind.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Rachel McDermott",
        "location": "405 MILBANK HALL",
        "capacity": 78,
        "enrollment": 78
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "ASTR1754BC",
    "name": "STARS GALAXIES & COSMOLOGY",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Satisfies \"Thinking Quantitatively and Empirically\" Requirement (Barnard) Prerequisites: Recommended preparation: A working knowledge of high school algebra. Corequisites: Suggested parallel laboratory course: ASTR C 1904y. Examines the properties of stars, star formation, stellar evolution and nucleosynthesis, the Milky Way and other galaxies, and the cosmological origin and evolution of the universe. Students may not receive credit for both ASTR BC 1754 and ASTR C1404.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Nicholas Luber",
        "location": "408 ZANKEL",
        "capacity": 120,
        "enrollment": 97
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL1001BC",
    "name": "REVOLUTIONARY CONCEPTS IN BIOL",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Exploration of the major discoveries and ideas that have revolutionized the way we view organisms and understand life. This is an introductory survey course that explores basic concepts of molecular and cellular biology, genetics and evolution. Students will focus on biological concepts, biotechnology and bioethics, which inundate contemporary society.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Gabrielle Corradino",
        "location": "152 HORACE MANN HALL",
        "capacity": 45,
        "enrollment": 14
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL1502BC",
    "name": "INTRO CELL AND MOLECULAR BIOL",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Detailed introduction to cellular and subcellular biology: cell structures and functions, energy metabolism, biogenesis of cell components, biology of inheritance, molecular genetics, regulation of gene expression, and genes in development.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Rishita Shah",
        "location": "304 BARNARD HALL",
        "capacity": 60,
        "enrollment": 62
      },
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Jonathan Snow",
        "location": "LL002 MILSTEIN CENTER",
        "capacity": 60,
        "enrollment": 62
      },
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Jonathan Snow",
        "location": "405 MILBANK HALL",
        "capacity": 70,
        "enrollment": 76
      },
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Kristin Presnell",
        "location": "LL002 MILSTEIN CENTER",
        "capacity": 70,
        "enrollment": 71
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL1503BC",
    "name": "INTRO LAB CELLULAR&MOLEC BIO",
    "description": "A laboratory-based introduction to cell and molecular biology. Both classic and modern approaches are used to investigate principles of heredity as well as the structure and function of cells and their molecular components. Lab exercises introduce practical techniques and data analysis.",
    "credits": 2,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "1:10pm-4:00pm",
        "professor": "Henry Truong",
        "location": "LL016 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 16
      },
      {
        "days": [
          "Monday"
        ],
        "time": "1:10pm-4:00pm",
        "professor": "Henry Truong",
        "location": "LL018 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 14
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "9:10am-12:00pm",
        "professor": "Henry Truong",
        "location": "LL016 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 16
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "9:10am-12:00pm",
        "professor": "Henry Truong",
        "location": "LL018 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 15
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "1:10pm-4:00pm",
        "professor": "Henry Truong",
        "location": "LL016 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 16
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "1:10pm-4:00pm",
        "professor": "Henry Truong",
        "location": "LL018 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 16
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "9:10am-12:00pm",
        "professor": "Henry Truong",
        "location": "LL016 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 16
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "9:10am-12:00pm",
        "professor": "Henry Truong",
        "location": "LL018 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 15
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "1:10pm-4:00pm",
        "professor": "Henry Truong",
        "location": "LL016 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 16
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "1:10pm-4:00pm",
        "professor": "Henry Truong",
        "location": "LL018 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 8
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "9:10am-12:00pm",
        "professor": "Henry Truong",
        "location": "LL016 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 13
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "9:10am-12:00pm",
        "professor": "Henry Truong",
        "location": "LL018 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 11
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "1:10pm-4:00pm",
        "professor": "Henry Truong",
        "location": "LL016 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 16
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "1:10pm-4:00pm",
        "professor": "Henry Truong",
        "location": "LL018 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 16
      },
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-1:00pm",
        "professor": "Jessica Goldstein",
        "location": "LL016 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 16
      },
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-1:00pm",
        "professor": "Jessica Goldstein",
        "location": "LL018 MILSTEIN CENTER",
        "capacity": 16,
        "enrollment": 16
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL1599BC",
    "name": "SCIENCE JOURNAL CLUB",
    "description": "Prerequisites: ) Limited to 16 students who are participating in the Science Pathways Scholars Program. Students in this seminar course will be introduced to the scientific literature by reading a mix of classic papers and papers that describe significant new developments in the field. Seminar periods will be devoted to oral reports, discussion of assigned reading, and student responses. Section 1: Limited to students in the Science Pathways Scholars Program. Section 2: Limited to first-year students who received a 4 or 5 on the AP and are currently enrolled in BIOL BC1500.",
    "credits": 1,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "8:00am-9:00am",
        "professor": "Sedelia Rodriguez",
        "location": "306 MILBANK HALL",
        "capacity": 15,
        "enrollment": 10
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL2100BC",
    "name": "MOLECULAR & MENDELIAN GENETICS",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Mendelian and molecular genetics of both eukaryotes and prokaryotes, with an emphasis on human genetics. Topics include segregation, recombination and linkage maps, cytogenetics, gene structure and function, mutation, molecular aspects of gene expression and regulation, genetic components of cancer, and genome studies.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Brian Morton",
        "location": "323 MILBANK HALL",
        "capacity": 60,
        "enrollment": 29
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL2278BC",
    "name": "Evolution",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Prerequisites: BIOL BC1500, 1501, 1502, 1503 or equivalent Theodosius Dobzhansky—an influential evolutionary biologist who spent much of his career at Columbia University—famously wrote, “Nothing in biology makes sense except in the light of evolution.” Evolution underlies all biodiversity, from the COVID-19 virus to redwood trees, from New York rats to our own bodies and minds. This course introduces students to the evolutionary processes at all scales, from molecular evolution and population genetics within single species, to macro patterns of diversification and evolution in deep time as studies through phylogenies and the fossil record. The overarching goal of the course is for students to gain a solid command of the major concepts in evolutionary theory and how they are interweaved with all life around us.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Rafael Marcondes",
        "location": "325 MILBANK HALL",
        "capacity": 30,
        "enrollment": 8
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL2280BC",
    "name": "ANIMAL BEHAVIOR",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Sustainability Related Prerequisites: BIOL BC1500, BIOL BC1501, BIOL BC1502, BIOL BC1503 or equivalent. This introduction to animal behavior takes an integrative approach to understand the physiological and genetic basis of behavior, the ecological context of behavior, and the evolutionary consequences of behavior. This course focuses on the process of scientific research, including current research approaches in animal behavior and practical applications of these findings.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Alison Pischedda",
        "location": "140 HORACE MANN HALL",
        "capacity": 45,
        "enrollment": 31
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL2490BC",
    "name": "CODING IN BIOLOGY",
    "description": "Satisfies \"Thinking Technologically and Digitally\" Requirement (Barnard) An introduction to the basics of Python and R coding in the context of solving basic problems in molecular biology. Python will be used to write programs that analyze various features of DNA sequence data and R will be used to analyze output from RNA-seq experiments. No prior programming experience is necessary. The work will involve modifying existing code as well as developing simple programs from the ground up.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "1:10pm-4:00pm",
        "professor": "Brian Morton",
        "location": "913 MILSTEIN CENTER",
        "capacity": 12,
        "enrollment": 14
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL2500BC",
    "name": "Programming for Scientists",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Satisfies \"Thinking Quantitatively and Empirically\" Requirement (Barnard) Satisfies \"Thinking Technologically and Digitally\" Requirement (Barnard) Learning objectives: This course will provide a comprehensive foundation in programming methodology for quantitative biology applications that can be readily applied to any programming language. It is recommended for students interested in establishing or expanding their computational biology skillset. After completing this course, students should be able to: 1. Understand and explain the role of numerical and statistical methods in biology 2. Execute numerical computations using a widely-used programming language 3. Recognize common programming motifs that can be readily applied to other widely used languages 4. Design and troubleshoot algorithms to analyze diverse biological data and implement them using functions and scripts 5. Apply statistical programming techniques to model biological systems 6. Generate and interpret diverse plots based on biological datasets Course overview: Once a small subfield of biology, computational biology has evolved into a massive field of its own, with computational methods fast becoming a vital toolkit leveraged by biologists across the discipline. As the size and complexity of biological datasets grows, computational methods allow scientists to make sense of these data, scaling quantitative methods to extract meaningful insights that help us better understand ourselves and the living world around us. In this course, we will learn the basics of computer programming in R, a powerful programming language with wide use in the biological sciences. Topics will include a basic introduction to R and the RStudio environment, data types and control structures, reading and writing files in R, data processing and visualization, manipulating common biological datasets; and statistical testing and modeling in R.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "10:10am-1:00pm",
        "professor": "Vincent FitzPatrick",
        "location": "912 MILSTEIN CENTER",
        "capacity": 14,
        "enrollment": 16
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL2841BC",
    "name": "LAB-PLANT EVOLUTION & DIVERSITY",
    "description": "Satisfies \"Thinking Locally - New York City\" Requirement (Barnard) Satisfies \"Thinking Technologically and Digitally\" Requirement (Barnard) Sustainability Related Prerequisites: () Enrollment is limited to 16; must attend first lab to hold place. Studies of the structure, ecology, and evolution of plants. Laboratory exercises include field problems, laboratory experiments, plant collections and identification, and examination of the morphology of plant groups.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "1:10pm-6:00pm",
        "professor": "Hilary Callahan",
        "location": "306 MILBANK HALL",
        "capacity": 14,
        "enrollment": 11
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3000BC",
    "name": "Biological Chemistry",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Satisfies \"Thinking Quantitatively and Empirically\" Requirement (Barnard) The goal of this course is to gain an understanding of the chemical principles that govern biological systems. We will look at the structure and function of biomolecules (proteins, carbohydrates, nucleic acids, and lipids), with an emphasis on interactions between them, enzyme kinetics, and metabolic pathways. Key topics will include protein folding and function, enzyme mechanisms, bioenergetics, and the regulation of key metabolic cycles. In addition to lecture we will spend time examining case studies and selected articles from primary literature, and engaging in group discussions.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Kristin Presnell",
        "location": "302 BARNARD HALL",
        "capacity": 50,
        "enrollment": 50
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3141BC",
    "name": "Advanced R in Biology",
    "description": "Satisfies \"Thinking Technologically and Digitally\" Requirement (Barnard) This course serves as a continuation of BIOL2500 R for Scientists. The course will meet weekly. Students will explore a range of methods and resources used by contemporary computational biologists. These include advanced statistical modeling approaches, manipulating genomic and spatial data, and working in R outside of the RStudio environment (including git, bash, Shiny and high-performance computing). Students will have opportunities to explore diverse biological and statistical R packages in the context of homework assignments, and will analyze a dataset of their own choosing for a semester project.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-1:00pm",
        "professor": "Vincent FitzPatrick",
        "location": "516 MILSTEIN CENTER",
        "capacity": 14,
        "enrollment": 8
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3272BC",
    "name": "Marine Ecology Lab",
    "description": "Satisfies \"Thinking Locally - New York City\" Requirement (Barnard) Sustainability Related This laboratory-intensive course introduces students to the biological and ecological processes that shape marine ecosystems. Even in the heart of New York City, marine ecology can be discovered and studied firsthand through experiments, data analysis and field sampling in the Hudson River and coastal environments. Students will explore marine biodiversity, physiology, and ecological interactions and there is an emphasis on experimental design, microscopy, and quantitative methods. Students will prepare lab reports, engage in group projects, and develop skills in scientific communication. One field excursion outside of New York City will be available for participation, but not required.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "1:10pm-6:00pm",
        "professor": "Gabrielle Corradino",
        "location": "718 FAIRCHILD LIFE SCIENCES BLDG",
        "capacity": 14,
        "enrollment": 14
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3306BC",
    "name": "PROJECT LAB MOLECULAR GENETCS",
    "description": "Satisfies \"Thinking Technologically and Digitally\" Requirement (Barnard) Prerequisites: BIOL BC1500, BIOL BC1501, BIOL BC1502, BIOL BC1503, BIOL BC2100, BIOL BC3305.   Enrollment limited to 12. Laboratory course in which students conduct original research projects in molecular genetics. Students interested in getting involved in research, or those looking to deepen research design and lab skills in this area, are encouraged to begin with this course. Students will participate in experimental design, conduct and data analysis, and work with key techniques for studying gene structure, expression and function such as nucleic acid extraction and synthesis, cloning, bioinformatics analysis including RNA-Seq, PCR and quantitative PCR,  immunofluorescence and confocal microscopy. Students will present their results orally and in writing. Enrollment in both semesters (BIOL BC3305 and BIOL BC3306) of this full-year course is required for credit, and fulfills two upper-level lab courses for the Barnard Biology major. Must be taken in sequence, beginning in the fall. - J. Mansfield",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "1:10pm-6:00pm",
        "professor": "Jennifer Mansfield",
        "location": "718 FAIRCHILD LIFE SCIENCES BLDG",
        "capacity": 12,
        "enrollment": 8
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3320BC",
    "name": "MICROBIOLOGY",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Satisfies \"Thinking Quantitatively and Empirically\" Requirement (Barnard) Prerequisites: BIOL BC1500, BIOL BC1501, BIOL BC1502, BIOL BC1503 or the equivalent, and BIOL BC2100. Survey of the diversity, cellular organization, physiology, and genetics of the major microbial groups. Also includes aspects of applied microbiology and biotechnology, the function of microorganisms in the environment, and the role of microbes in human diseases.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Stephen Sturley",
        "location": "302 BARNARD HALL",
        "capacity": 45,
        "enrollment": 45
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3321BC",
    "name": "LABORATORY IN MICROBIOLOGY",
    "description": "Satisfies \"Thinking Quantitatively and Empirically\" Requirement (Barnard) Enrollment limited to 16. Provides experience in the isolation, cultivation, and analysis of pure cultures of microorganisms. Methods used for the study of cell structure, growth, physiology, and genetics of microbes will be incorporated into laboratory exercises.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "1:10pm-6:00pm",
        "professor": "Gabrielle Corradino",
        "location": "718 FAIRCHILD LIFE SCIENCES BLDG",
        "capacity": 14,
        "enrollment": 15
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3333BC",
    "name": "Ornithology",
    "description": "Sustainability Related You saw a bird today. You saw a bird yesterday. You will surely see a bird tomorrow. Without knowing you, or knowing what you do with your days, I know this for a fact about you. Unless they are under absolute confinement, chances are that every human being anywhere on the planet will see at least one bird every day. Birds are everywhere. They are mostly diurnal, they fly and they vocalize. Probably more so than any other kind of animal, this makes birds particularly conspicuous and appealing to humans. But when you saw a bird today, did you really see it? Did it register at all? Probably not—no more than a passing car or cloud or a stranger in the sidewalk. That’s a shame, because birds have shaped modern biology more than any other group, inspiring discoveries in ecology, evolution, and behavior. They also move billions of dollars each year through birdwatching. The overarching goal of this class is for you to start really seeing birds for the wondrous animals that they are and all that they have taught us about biology. This will include identifying and naming bird species, having the basic vocabulary to talk about birds, and relating your bird observations in the field to conceptual knowledge about their evolution and ecology. Towards that goal, students will participate in a combination of lectures, readings, group discussions, written assignments, and group and solo outings to observe birds in Central Park. Topics addressed will include: evolutionary origins of birds; bird systematics and classification; the biology of feathers; bioacoustics and birdsong; the biology of migration; bird reproductive behavior; and bird conservation.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "5:40pm-6:55pm",
        "professor": "Rafael Marcondes",
        "location": "325 MILBANK HALL",
        "capacity": 15,
        "enrollment": 15
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3352BC",
    "name": "DEVELOPMENT",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Introduction to animal developmental biology and its applications. This course will examine the basic mechanisms through which animal bodies organize themselves, from an integrative perspective at the levels of genes and gene networks, cell properties and behaviors, coordinated interactions of cells in developing tissues, organs and organ systems, and the role of developmental processes in morphological evolution. Topics include: fertilization, cleavage and gastrulation, establishment of body axes, neural development, organ formation, tissue and organ regeneration, stem cells and medical applications, evolution of developmental programs, and teratogenesis.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Jennifer Mansfield",
        "location": "328 MILBANK HALL",
        "capacity": 45,
        "enrollment": 17
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3360BC",
    "name": "PHYSIOLOGY",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Prerequisites: BIOL BC1500, BIOL BC1501, BIOL BC1502, BIOL BC1503 or the equivalent. This course examines how mammals carry out basic functions like manipulating objects, sensing the external world, oxygenating tissues, and processing food. Emphasis is placed on (a) how the body regulates itself through the integrated action of multiple organ systems and (b) what goes awry in disease.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "John Glendinning",
        "location": "152 HORACE MANN HALL",
        "capacity": 60,
        "enrollment": 54
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3361BC",
    "name": "LABORATORY IN PHYSIOLOGY",
    "description": "Prerequisites: Pre- (or co-) requisite is a physiology lecture class (e.g. BIOL BC3360). Enrollment limited to 16. Provides a hands-on introduction to the different physiological systems in vertebrates and invertebrates. Emphasizes the operation of a variety of physiological monitoring devices and the collection and analysis of physiological data.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-3:00pm",
        "professor": "Jordan Balaban",
        "location": "922 SCHERMERHORN HALL",
        "capacity": 16,
        "enrollment": 13
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3380BC",
    "name": "APPLIED ECOLOGY AND EVOLUTION",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Sustainability Related Ecological and evolutionary models of populations (exponential and density-dependent growth; species interactions; genetic differentiation resulting from mating, random drift, and selection) applied to problems resulting from human-induced environmental change (endangered species; use of pesticides and antibiotics; escaping transgenic organisms; global climate change; emerging pathogens; other invaders; etc.)",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Hilary Callahan",
        "location": "LL001 MILSTEIN CENTER",
        "capacity": 45,
        "enrollment": 5
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3590BC",
    "name": "SR SEM IN BIOLOGY",
    "description": "Required for all majors who do not select the year-long Senior Thesis Research & Seminar (BIOL BC3593 & BC3594) to fulfill their senior capstone requirement. These seminars allow students to explore the primary literature in the Biological Sciences in greater depth than can be achieved in a lecture course. Attention will be focused on both theoretical and empirical work. Seminar periods are devoted to oral reports and discussion of assigned readings and student reports. Students will write one extensive literature review of a topic related to the central theme of the seminar section. Topics vary per semester and include, but are not limited to: Plant Development, Animal Development & Evolution, Molecular Evolution, Microbiology & Global Change, Genomics, Comparative & Reproductive Endocrinology, and Data Intensive Approaches in Biology.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "9:10am-11:00am",
        "professor": "Rishita Shah",
        "location": "227 MILBANK HALL",
        "capacity": 10,
        "enrollment": 9
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3592BC",
    "name": "GUIDED RESEARCH & SEMINAR",
    "description": "This year-long course is open to junior and senior Biology majors and minors. Students will complete an independent research project in Biology under the guidance of a faculty mentor at Barnard or another local institution. Attendance at the weekly seminar is required. By the end of the year, students will write a scientific paper about their project and give a poster presentation about their research at the Barnard Biology Research Symposium. Completion of this year-long course fulfills two upper-level laboratory requirements for the Biology major or minor. This course must be taken in sequence, beginning with BIOL BC3591 in the Fall and continuing with BIOL BC3592 in the Spring. Acceptance into this course requires confirmation of the research project by the course instructors. A Barnard internal mentor is required if the research project is not supervised by a Barnard faculty member. This course cannot be taken at the same time as BIOL BC3593-BIOL BC3594.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "1:10pm-4:00pm",
        "professor": "Alison Pischedda",
        "location": "912 MILSTEIN CENTER",
        "capacity": 10,
        "enrollment": 10
      },
      {
        "days": [
          "Monday"
        ],
        "time": "1:10pm-3:00pm",
        "professor": "Alison Pischedda",
        "location": "913 MILSTEIN CENTER",
        "capacity": 10,
        "enrollment": 9
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "BIOL3594BC",
    "name": "SENIOR THESIS RESEARCH & SEMINAR",
    "description": "This year-long course is open to senior Biology majors. Students will complete an independent research project in Biology under the guidance of a faculty mentor at Barnard or another local institution. Attendance at the weekly seminar is required. By the end of the year, students will write a scientific paper about their project and give an oral presentation about their research at the Barnard Biology Research Symposium. Completion of this year-long course fulfills the senior capstone requirement for the Biology major. This course must be taken in sequence, beginning with BIOL BC3593 in the Fall and continuing with BIOL BC3594 in the Spring. Acceptance into this course requires confirmation of the research project by the course instructors. A Barnard internal mentor is required if the research project is not supervised by a Barnard faculty member. This course cannot be taken at the same time as BIOL BC3591-BIOL BC3592.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "1:10pm-3:00pm",
        "professor": "Alison Pischedda",
        "location": "LL003 BARNARD HALL",
        "capacity": 10,
        "enrollment": 10
      },
      {
        "days": [
          "Monday"
        ],
        "time": "1:10pm-3:00pm",
        "professor": "Kristin Presnell",
        "location": "LL001 MILSTEIN CENTER",
        "capacity": 40,
        "enrollment": 9
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "CCIS3999BC",
    "name": "Environmental Humanities Senior Discussion",
    "description": "Sustainability Focused This course will help students who are pursuing the Environmental Humanities Concentration and Minor to contextualize their senior projects within the larger field of Environmental Humanities. Students will also form a cohort to offer peer review and shared knowledge production in support of their projects.",
    "credits": 1,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "12:10pm-2:00pm",
        "professor": "Jayne Hildebrand",
        "location": "404 BARNARD HALL",
        "capacity": 10,
        "enrollment": 0
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "CHEM3230BC",
    "name": "ORGANIC CHEMISTRY I-LEC",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Prerequisites: CHEM BC2001 or equivalent. Credit will not be given for any course below the 3000 level after completing CHEM BC3230 or its equivalent. Corequisites: With lab, counts towards Lab Science requirement. Atomic and molecular structure; stereochemistry of organic molecules; introduction to organic reactions, reaction mechanisms, and synthesis.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday",
          "Friday"
        ],
        "time": "1:10pm-2:00pm",
        "professor": "Dina Merrer",
        "location": "304 BARNARD HALL",
        "capacity": 240,
        "enrollment": 217
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "CHEM3232BC",
    "name": "Descriptive Inorganic Chemistry",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Prerequisites: CHEM BC2001. This course explores the periodic table in ways that deepen appreciation of the chemistry of the elements. It extends tools introduced in general chemistry with a particular focus on the rich and varied chemistry of the transition metal elements. Requiring only general chemistry, this course is open to students with interests in the role that metal ions play in biology, biochemistry, neuroscience and environmental science.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Rachel Austin",
        "location": "LL002 MILSTEIN CENTER",
        "capacity": 95,
        "enrollment": 85
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "CHEM3242BC",
    "name": "QUANTITATIVE ANALYSIS",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Satisfies \"Thinking Quantitatively and Empirically\" Requirement (Barnard) Prerequisites: CHEM BC3231, MATH UN1101, and permission of instructor. Survey of topics appropriate for a student majoring in chemistry or biochemistry, including examinations of uncertainty analysis and data processing, use of basic laboratory equipment, complex equilibria (pH, solubility, etc.), advanced solution chemistry and chemical activity, and the theoretical foundations of modern techniques in electrochemistry, chromatography and analytical experimental techniques.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Angela Paoletta",
        "location": "223 MILBANK HALL",
        "capacity": 40,
        "enrollment": 31
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "CHEM3252BC",
    "name": "THERMODYNAMICS-KINETICS",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Satisfies \"Thinking Quantitatively and Empirically\" Requirement (Barnard) Prerequisites: CHEM BC3231, PHYS BC2001, PHYS BC 2002, MATH UN1102 or MATH UN1201. Introduction to the laws of thermodynamics; application primarily to ideal systems. Free energy and equilibrium. Kinetics: rate laws and mechanisms, experimental techniques.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Marisa Buzzeo",
        "location": "202 MILBANK HALL",
        "capacity": 20,
        "enrollment": 11
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "CHEM3271BC",
    "name": "INORGANIC CHEMISTRY",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Satisfies \"Thinking Quantitatively and Empirically\" Requirement (Barnard) Prerequisites: CHEM BC3231 or Permission of Instructor. Structure, bonding and spectroscopy in inorganic compounds: applications of group theory to chemistry; ligand field theory; vibrational and electronic spectroscopy of transition metal complexes; selected topics from coordination chemistry, organometallics, bioinorganic chemistry, solid state and materials chemistry, mineralogy, and biogeochemistry.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Michael Campbell",
        "location": "203 Diana Center",
        "capacity": 45,
        "enrollment": 41
      }
    ],
    "school": "Barnard College"
  },
  {
    "id": "CHEM3280BC",
    "name": "ADVANCED ORGANIC CHEMISTRY",
    "description": "Satisfies 3 credit Science Lecture or Lab Requirement (Barnard) Prerequisites: One year of organic chemistry. Survey of topics in structural, mechanistic, and synthetic organic chemistry, including molecular orbital treatment of structure, bonding, and chemical reactivity; elucidation of organic reaction mechanisms; pericyclic reactions; stereoelectronic effects; reactive intermediates; asymmetric reactions; and natural product total synthesis.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Michael Campbell",
        "location": "207 MILBANK HALL",
        "capacity": 25,
        "enrollment": 10
      }
    ],
    "school": "Barnard College"
  }
]