[
  {
    "id": "AERO4101E",
    "name": "Aerospace Structures",
    "description": "Analysis of aerospace structures (solid and thin-walled structures), including bending, shear, and torsion; aircraft loading bearing members; introduction to aerospace materials; analysis of structural instability; experimental method in aerospace structures.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Addis Kidane",
        "location": "415 SCHAPIRO CEPSER",
        "capacity": 40,
        "enrollment": 14
      }
    ]
  },
  {
    "id": "AERO4432E",
    "name": "Space Resource and Planetary Protection",
    "description": "Planetary defense against asteroids and comets; astronaut rescue and emergency response; satellite constellations and orbital congestion; space debris and long-term sustainability; space law, treaties, and Artemis Accords; planetary protection, cislunar competition, and future international strategies. Weekly case studies on national doctrines, commercial actors, and modern enforcement challenges. Systems Tool Kit Astrogator software used to model satellite constellations, cislunar surveillance orbits, lunar frozen orbits, and defense scenarios connecting spaceflight mechanics with law and policy.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Anthony Genova",
        "location": "829 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 10
      }
    ]
  },
  {
    "id": "AERO4440E",
    "name": "Rapid Prototyping for Aerospace Products",
    "description": "Graduate-level design course focused on the rapid prototyping, integration, testing, and validation of aerospace systems. Students work in teams to design and build engineering models of aerospace systems (e.g., drones, CubeSat subsystems, ground systems, balloon payloads, or related aerospace hardware). Projects progress from concept to pre-production functional prototype through iterative sprint cycles emphasizing scoping, design, build, and test. Deliverables include mission-driven specifications and design reviews, working prototypes, and supporting documentation. Involves brainstorming concept generation, literature review, production of layout drawing(s) in Computer Aided Design (CAD) software tools, incorporation of multiple constraints, and adherence to appropriate engineering codes and standards. Business and product framing activities will support the technical work with market and mission relevance.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Evan Lerner",
        "location": "603 HAMILTON HALL",
        "capacity": 24,
        "enrollment": 24
      }
    ]
  },
  {
    "id": "AERO4810E",
    "name": "Introduction to Human Spaceflight",
    "description": "Introduction to human spaceflight from a systems engineering perspective. Historical and current space programs and spacecraft. Motivation, cost, and rationale for human space exploration. Overview of space environment needed to sustain human life and health, including physiological and psychological concerns in space habitat. Astronaut selection and training processes, spacewalking, robotics, mission operations, and future program directions. Systems integration for successful operation of a spacecraft. Highlights from current events and space research, Space Shuttle, Hubble Space Telescope, and International Space Station (ISS). Includes team design project.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Michael Massimino",
        "location": "325 PUPIN LABORATORIES",
        "capacity": 20,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "APAM3999E",
    "name": "UNDERGRADUATE FIELDWORK",
    "description": "May be repeated for credit, but no more than 3 total points may be used toward the 128credit degree requirement. Only for APAM undergraduate students who include relevant off-campus work experience as part of their approved program of study. Final report and letter of evaluation required. Fieldwork credits may not count toward any major core, technical, elective, and nontechnical requirements. May not be taken for pass/fail credit or audited.",
    "credits": 2,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Yuan Yang",
        "location": "",
        "capacity": 5,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "APAM4999E",
    "name": "SUPERVISED INTERNSHIP",
    "description": "Only for masters students in the Department of Applied Physics and Applied Mathematics who may need relevant work experience a part of their program of study. Final report required. May not be taken for pass/fail or audited.",
    "credits": 3,
    "times": []
  },
  {
    "id": "APAM6650E",
    "name": "RESEARCH PROJECT",
    "description": "May be repeated for credit. A special investigation of a problem in nuclear engineering, medical physics, applied mathematics, applied physics, and/or plasma physics consisting of independent work on the part of the student and embodied in a formal report.",
    "credits": 6,
    "times": []
  },
  {
    "id": "APAM9301E",
    "name": "DOCTORAL RESEARCH",
    "description": "Required of doctoral candidates.",
    "credits": 15,
    "times": []
  },
  {
    "id": "APMA2000E",
    "name": "MULTV. CALC. FOR ENGI & APP SCI",
    "description": "Differential and integral calculus of multiple variables. Topics include partial differentiation; optimization of functions of several variables; line, area, volume, and surface integrals; vector functions and vector calculus; theorems of Green, Gauss, and Stokes; applications to selected problems in engineering and applied science.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Drew Youngren",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 52,
        "enrollment": 47
      },
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Drew Youngren",
        "location": "402 CHANDLER",
        "capacity": 126,
        "enrollment": 126
      }
    ]
  },
  {
    "id": "APMA2001E",
    "name": "MULTV. CALC. FOR ENGI & APP SCI",
    "description": "Required recitation session for students enrolled in APMA E2000.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "2:40pm-3:30pm",
        "professor": "",
        "location": "302 FAYERWEATHERJan 20, 2026 – May 4, 2026",
        "capacity": 30,
        "enrollment": 17
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-5:00pm",
        "professor": "",
        "location": "407 MATHEMATICS BUILDINGJan 20, 2026 – May 4, 2026",
        "capacity": 30,
        "enrollment": 30
      },
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-11:00am",
        "professor": "",
        "location": "302 FAYERWEATHERJan 20, 2026 – May 4, 2026",
        "capacity": 30,
        "enrollment": 14
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-5:00pm",
        "professor": "",
        "location": "C01 KNOX HALLJan 20, 2026 – May 4, 2026",
        "capacity": 30,
        "enrollment": 25
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "5:10pm-6:00pm",
        "professor": "",
        "location": "407 MATHEMATICS BUILDINGJan 20, 2026 – May 4, 2026",
        "capacity": 30,
        "enrollment": 15
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "11:40am-12:30pm",
        "professor": "",
        "location": "307 PUPIN LABORATORIESJan 20, 2026 – May 4, 2026",
        "capacity": 30,
        "enrollment": 30
      }
    ]
  },
  {
    "id": "APMA2101E",
    "name": "INTRO TO APPLIED MATHEMATICS",
    "description": "A unified, single-semester introduction to differential equations and linear algebra with emphases on (1) elementary analytical and numerical technique and (2) discovering the analogs on the continuous and discrete sides of the mathematics of linear operators: superposition, diagonalization, fundamental solutions. Concepts are illustrated with applications using the language of engineering, the natural sciences, and the social sciences. Students execute scripts in Mathematica and MATLAB (or the like) to illustrate and visualize course concepts (programming not required).",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Yuan He",
        "location": "207 MATHEMATICS BUILDING",
        "capacity": 152,
        "enrollment": 140
      }
    ]
  },
  {
    "id": "APMA3102E",
    "name": "APPLIED MATHEMATICS II: PDE'S",
    "description": "Introduction to partial differential equations; integral theorems of vector calculus. Partial differential equations of engineering in rectangular, cylindrical, and spherical coordinates. Separation of the variables. Characteristic-value problems. Bessel functions, Legendre polynomials, other orthogonal functions; their use in boundary value problems. Illustrative examples from the fields of electromagnetic theory, vibrations, heat flow, and fluid mechanics.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Michael Tippett",
        "location": "825 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 45
      }
    ]
  },
  {
    "id": "APMA4008E",
    "name": "Advanced and Applied Linear Algebra",
    "description": "Advanced topics in linear algebra with applications to data analysis, algorithms, dynamics and differential equations, and more. (1) General vector spaces, linear transformations, spaces isomorphisms; (2) spectral theory - normal matrices and their spectral properties, Rayleigh quotient, Courant-Fischer Theorem, Jordan forms, eigenvalue perturbations; (3) least squares problem and the Gauss-Markov Theorem; (4) singular value decomposition, its approximation properties, matrix norms, PCA and CCA.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Yuan He",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 52,
        "enrollment": 51
      },
      {
        "days": [],
        "time": "",
        "professor": "Yuan He",
        "location": "",
        "capacity": 99,
        "enrollment": 10
      }
    ]
  },
  {
    "id": "APMA4101E",
    "name": "APPL MATH III:DYNAMICAL SYSTMS",
    "description": "An introduction to the analytic and geometric theory of dynamical systems; basic existence, uniqueness and parameter dependence of solutions to ordinary differential equations; constant coefficient and parametrically forced systems; Fundamental solutions; resonance; limit points, limit cycles and classification of flows in the plane (Poincare-Bendixson Therem); conservative and dissipative systems; linear and nonlinear stability analysis of equilibria and periodic solutions; stable and unstable manifolds; bifurcations, e.g. Andronov-Hopf; sensitive dependence and chaotic dynamics; selected applications.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Xuenan Li",
        "location": "313 FAYERWEATHER",
        "capacity": 75,
        "enrollment": 63
      },
      {
        "days": [],
        "time": "",
        "professor": "Xuenan Li",
        "location": "",
        "capacity": 99,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "APMA4150E",
    "name": "APPLIED FUNCTIONAL ANALYSIS",
    "description": "Introduction to modern tools in functional analysis that are used in the analysis of deterministic and stochastic partial differential equations and in the analysis of numerical methods: metric and normed spaces. Banach space of continuous functions, measurable spaces, the contraction mapping theorem, Banach and Hilbert spaces bounded linear operators on Hilbert spaces and their spectral decomposition, and time permitting distributions and Fourier transforms.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Michael Weinstein",
        "location": "825 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 30
      }
    ]
  },
  {
    "id": "APMA4200E",
    "name": "PARTIAL DIFFERENTIAL EQUATIONS",
    "description": "Techniques of solution of partial differential equations. Separation of the variables. Orthogonality and characteristic functions, nonhomogeneous boundary value problems. Solutions in orthogonal curvilinear coordinate systems. Applications of Fourier integrals, Fourier and Laplace transforms. Problems from the fields of vibrations, heat conduction, electricity, fluid dynamics, and wave propagation are considered.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Curtiss Lyman",
        "location": "1127 SEELEY W. MUDD BUILDING",
        "capacity": 52,
        "enrollment": 51
      },
      {
        "days": [],
        "time": "",
        "professor": "Curtiss Lyman",
        "location": "",
        "capacity": 99,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "APMA4300E",
    "name": "COMPUT MATH:INTRO-NUMERCL METH",
    "description": "Programming experience in Python extremely useful. Introduction to fundamental algorithms and analysis of numerical methods commonly used by scientists, mathematicians and engineers. Designed to give a fundamental understanding of the building blocks of scientific computing that will be used in more advanced courses in scientific computing and numerical methods for PDEs (e.g. APMA E4301, E4302). Topics include numerical solutions of algebraic systems, linear least-squares, eigenvalue problems, solution of non-linear systems, optimization, interpolation, numerical integration and differentiation, initial value problems and boundary value problems for systems of ODEs. All programming exercises will be in Python.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Kui Ren",
        "location": "702 HAMILTON HALL",
        "capacity": 85,
        "enrollment": 85
      },
      {
        "days": [],
        "time": "",
        "professor": "Kui Ren",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      },
      {
        "days": [],
        "time": "",
        "professor": "Kui Ren",
        "location": "",
        "capacity": 99,
        "enrollment": 5
      }
    ]
  },
  {
    "id": "APMA4301E",
    "name": "NUMERICAL METHODS/PDE'S",
    "description": "Numerical solution of differential equations, in particular partial differential equations arising in various fields of application. Presentation emphasizes finite difference approaches to present theory on stability, accuracy, and convergence with minimal coverage of alternate approaches (left for other courses). Method coverage includes explicit and implicit time-stepping methods, direct and iterative solvers for boundary-value problems.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Qiang Du",
        "location": "545 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 22
      },
      {
        "days": [],
        "time": "",
        "professor": "Qiang Du",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      },
      {
        "days": [],
        "time": "",
        "professor": "Qiang Du",
        "location": "",
        "capacity": 99,
        "enrollment": 5
      }
    ]
  },
  {
    "id": "APMA4302E",
    "name": "METHODS IN COMPUTATIONAL SCI",
    "description": "Introduction to the key concepts and issues in computational science aimed at getting students to a basic level of understanding where they can run simulations on machines aimed at a range of applications and sizes from a single workstation to modern super-computer hardware. Topics include but are not limited to basic knowledge of UNIX shells, version control systems, reproducibility, Open MP, MPI, and many-core technologies. Applications will be used throughout to demonstrate the various use cases and pitfalls of using the latest computing hardware.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Marc Spiegelman",
        "location": "522A KENT HALL",
        "capacity": 10,
        "enrollment": 2
      }
    ]
  },
  {
    "id": "APMA4306E",
    "name": "Applied Stochastic Analysis",
    "description": "Provides elementary introduction to fundamental ideas in stochastic analysis for applied mathematics. Core material includes: (i) review of probability theory (including limit theorems), and introduction to discrete Markov chains and Monte Carlo methods; (ii) elementary theory of stochastic process, Ito's stochastic calculus and stochastic differential equations; (iii) introductions to probabilistic representation of elliptic partial differential equations (the Fokker-Planck equation theory); (iv) stochastic approximation algorithms; and (v) asymptotic analysis of SDEs.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Liliana Borcea",
        "location": "545 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 45
      },
      {
        "days": [],
        "time": "",
        "professor": "Liliana Borcea",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      },
      {
        "days": [],
        "time": "",
        "professor": "Liliana Borcea",
        "location": "",
        "capacity": 99,
        "enrollment": 3
      }
    ]
  },
  {
    "id": "APPH3300E",
    "name": "APPLIED ELECTROMAGNETISM",
    "description": "Vector analysis, electrostatic fields, Laplaces equation, multipole expansions, electric fields in matter: dielectrics, magnetostatic fields, magnetic materials, and superconductors. Applications of electromagnetism to devices and research areas in applied physics.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Sherry Zhang",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 10
      }
    ]
  },
  {
    "id": "APPH3900E",
    "name": "UNDERGRAD RESRCH-APPLD PHYSICS",
    "description": "This course may be repeated for credit, but no more than 6 points of this course may be counted toward the satisfaction of the B.S. degree requirements. Candidates for the B.S. degree may conduct an investigation in applied physics or carry out a special project under the supervision of the staff. Credit for the course is contingent upon the submission of an acceptable thesis or final report.",
    "credits": 4,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Elizabeth Paul",
        "location": "",
        "capacity": 5,
        "enrollment": 1
      },
      {
        "days": [],
        "time": "",
        "professor": "Carlos Paz Soldan",
        "location": "",
        "capacity": 10,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "APPH4018E",
    "name": "APPLIED PHYSICS LABORATORY",
    "description": "Sustainability Related Typical experiments are in the areas of plasma physics, microwaves, laser applications, optical spectroscopy physics, and superconductivity.",
    "credits": 3,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Aravind Devarakonda",
        "location": "",
        "capacity": 25,
        "enrollment": 20
      }
    ]
  },
  {
    "id": "APPH4110E",
    "name": "MODERN OPTICS",
    "description": "Ray optics, matrix formulation, wave effects, interference, Gaussian beams, Fourier optics, diffraction, image formation, electromagnetic theory of light, polarization and crystal optics, coherence, guided wave and fiber optics, optical elements, photons, selected topics in nonlinear optics.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Nanfang Yu",
        "location": "545 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 21
      },
      {
        "days": [],
        "time": "",
        "professor": "Nanfang Yu",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "APPH4114E",
    "name": "Quantum and Nonlinear Photonics",
    "description": "Advanced senior-level/MS/PhD course covering interaction of laser light with matter in both classical and quantum domains. First half introduces microscopic origin of optical nonlinearities through formal derivation of nonlinear susceptibilities, emphasis on second- and third-order optical processes. Topics include Maxwell's wave equation, and nonlinear optical processes such as second-harmonic, difference frequency generation, four-wave mixing, and self-phase modulation, including various applications of processes such as frequency conversion, and optical parametric amplifiers and oscillators. Second half describes two-level atomic systems and quantization of electromagnetic field. Descriptions of coherent, Fock, and squeezed states of light discussed and techniques to generate such states outlined.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Alexander Gaeta",
        "location": "212A LEWISOHN HALL",
        "capacity": 25,
        "enrollment": 15
      }
    ]
  },
  {
    "id": "APPH4210E",
    "name": "GEOPHYSICAL FLUID DYNAMICS",
    "description": "Fundamental concepts in the dynamics of rotating, stratified flows. Geostrophic and hydrostatic balances, potential vorticity, f and beta plane approximations, gravity and Rossby waves, geostrophic adjustment and quasigeostrophy, baroclinic and barotropic instabilities, Sverdrup balance, boundary currents, Ekman layers.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Dhruv Balwada",
        "location": "555 EXT SCHERMERHORN HALL",
        "capacity": 25,
        "enrollment": 7
      }
    ]
  },
  {
    "id": "APPH4500E",
    "name": "HEALTH PHYSICS",
    "description": "Fundamental principles and objectives of health physics (radiation protection), the quantities of radiation dosimetry (the absorbed dose, equivalent dose, and effective dose) used to evaluate human radiation risks, elementary shielding calculations and protection measures for clinical environments, characterization and proper use of health physics instrumentation, and regulatory and administrative requirements of health physics programs in general and as applied to clinical activities.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "5:30pm-8:00pm",
        "professor": "Peter Caracappa",
        "location": "253 ENGINEERING TERRACE",
        "capacity": 12,
        "enrollment": 11
      }
    ]
  },
  {
    "id": "APPH4550E",
    "name": "MEDICAL PHYSICS SEMINAR",
    "description": "Required for all graduate students in the Medical Physics Program. Practicing professionals and faculty in the field present selected topics in medical physics.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "9:00am-10:15am",
        "professor": "Cheng Wuu",
        "location": "253 ENGINEERING TERRACE",
        "capacity": 10,
        "enrollment": 6
      }
    ]
  },
  {
    "id": "APPH4990E",
    "name": "SPEC TOPICS IN APPLIED PHYSICS",
    "description": "May be repeated for credit. Topics and instructors change from year to year. For advanced undergraduate students and graduate students in engineering, physical sciences, and other fields.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Michele Simoncelli",
        "location": "829 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 18
      }
    ]
  },
  {
    "id": "APPH6102E",
    "name": "PLASMA PHYSICS II",
    "description": "Magnetic coordinates. Equilibrium, stability, and transport of torodial plasmas. Ballooning and tearing instabilities. Kinetic theory, including Vlasov equation, Fokker-Planck equation, Landau damping, kinetic transport theory. Drift instabilities.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Carlos Paz Soldan",
        "location": "545 SEELEY W. MUDD BUILDING",
        "capacity": 25,
        "enrollment": 8
      },
      {
        "days": [],
        "time": "",
        "professor": "Carlos Paz Soldan",
        "location": "",
        "capacity": 99,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "APPH6319E",
    "name": "CLIN NUCLEAR MEDICINE PHYSICS",
    "description": "Introduction to the instrumentation and physics used in clinical nuclear medicine and PET with an emphasis on detector systems, tomography and quality control. Problem sets, papers and term project.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "5:30pm-8:00pm",
        "professor": "Pat Zanzonico",
        "location": "253 ENGINEERING TERRACE",
        "capacity": 10,
        "enrollment": 8
      }
    ]
  },
  {
    "id": "APPH6330E",
    "name": "DIAGNOSTIC RADIOLOGY PHYSICS",
    "description": "Physics of medical imaging. Imaging techniques: radiography, fluoroscopy, computed tomography, mammography, ultrasound, magnetic resonance. Includes conceptual, mathematical/theoretical, and practical clinical physics aspects.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "5:30pm-8:30pm",
        "professor": "Boyu Peng",
        "location": "253 ENGINEERING TERRACE",
        "capacity": 10,
        "enrollment": 8
      }
    ]
  },
  {
    "id": "APPH6335E",
    "name": "RADIATION THERAPY PHYSICS",
    "description": "Review of X-ray production and fundamentals of nuclear physics and radioactivity. Detailed analysis of radiation absorption and interactions in biological materials as specifically related to radiation therapy and radiation therapy dosimetry. Surveys of use of teletherapy isotopes and X-ray generators in radiation therapy plus the clinical use of interstitial and intracavitary isotopes. Principles of radiation therapy treatment planning and isodose calculations. Problem sets taken from actual clinical examples are assigned.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "5:00pm-8:00pm",
        "professor": "Cheng Wuu",
        "location": "522A KENT HALL",
        "capacity": 10,
        "enrollment": 8
      }
    ]
  },
  {
    "id": "APPH9500E",
    "name": "Plasma and Fusion Colloquium",
    "description": "Sustainability Related Plasma and Fusion Colloquium: All plasma and fusion graduate students are strongly encouraged to attend the department seminar as long as they are in residence. Interested undergraduates are also welcome. No degree credit is granted.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "3:00pm-5:00pm",
        "professor": "Carlos Paz Soldan",
        "location": "233 SEELEY W. MUDD BUILDING",
        "capacity": 48,
        "enrollment": 23
      },
      {
        "days": [
          "Friday"
        ],
        "time": "2:00pm-4:30pm",
        "professor": "Shalmali Joshi",
        "location": "304 URIS HALL",
        "capacity": 20,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "BMCS4575E",
    "name": "High-dimensional statistics for biomedical data",
    "description": "Statistical machine learning techniques and advanced mathematical concepts for analysis of high-dimensional biomedical data. Topics include optimal transport and probabilistic modeling for multi-modal genomic and imaging data integration and analysis of spatial and temporal dynamics. Programming assignments, problem sets, and a final project will be required.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "10:10am-12:40pm",
        "professor": "Elham Azizi",
        "location": "829 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 18
      }
    ]
  },
  {
    "id": "BMEN3020E",
    "name": "BIOMEDICAL ENGINEERING II",
    "description": "Various concepts within the field of biomedical engineering, foundational knowledge of engineering methodology applied to biological and/or medical problems through modules in biomechanics, bioinstrumentation, and biomedical imaging.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Clark Hung",
        "location": "633 SEELEY W. MUDD BUILDING",
        "capacity": 65,
        "enrollment": 50
      }
    ]
  },
  {
    "id": "BMEN3820E",
    "name": "BIOMEDICAL ENGINEERING LAB II",
    "description": "Biomedical experimental design and hypothesis testing. Statistical analysis of experimental measurements. Analysis of experimental measurements. Analysis of variance, post hoc testing. Fluid shear and cell adhesion, neuro-electrophysiology, soft tissue biomechanics, biomecial imaging and ultrasound, characterization of excitable tissues, microfluidics.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "1:10pm-3:45pm",
        "professor": "Barclay Morrison",
        "location": "382 ENGINEERING TERRACE",
        "capacity": 27,
        "enrollment": 20
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "1:10pm-3:45pm",
        "professor": "Barclay Morrison",
        "location": "382 ENGINEERING TERRACE",
        "capacity": 27,
        "enrollment": 30
      }
    ]
  },
  {
    "id": "BMEN3899E",
    "name": "Research Training",
    "description": "Research training course. Recommended in preparation for laboratory related research.",
    "credits": 3,
    "times": []
  },
  {
    "id": "BMEN3920E",
    "name": "BIOMEDICAL ENGIN DESIGN II",
    "description": "A two-semester design sequence to be taken in the senior year. Elements of the design process, with specific applications to biomedical engineering: concept formulation, systems synthesis, design analysis, optimization, biocompatibility, impact on patient health and comfort, health care costs, regulatory issues, and medical ethics. Selection and execution of a project involving the design of an actual engineering device or system. Introduction to entrepreneurship, biomedical start-ups, and venture capital. Semester I: statistical analysis of detection/classification systems (receiver operation characteristic analysis, logistic regression), development of design prototype, need, approach, benefits and competition analysis. Semester II: spiral develop process and testing, iteration and refinement of the initial design/prototype and business plan development. A lab fee of $100 each is collected.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Lauren Heckelman",
        "location": "750 SCHAPIRO CEPSER",
        "capacity": 55,
        "enrollment": 32
      }
    ]
  },
  {
    "id": "BMEN3998E",
    "name": "PROJECTS IN BIOMEDICAL ENGIN",
    "description": "Independent projects involving experimental, theoretical, computational, or engineering design work. May be repeated, but no more than 3 points of this or any other projects or research course may be counted toward the technical elective degree requirements as engineering technical electives.",
    "credits": 3,
    "times": []
  },
  {
    "id": "BMEN3999E",
    "name": "UNDERGRADUATE FIELDWORK",
    "description": "May be repeated for credit, but no more than 3 total points may be used toward the 128-credit degree requirement. Only for BMEN undergraduate students who include relevant off-campus work experience as part of their approved program of study. Final report and letter of evaluation required. Fieldwork credits may not count toward any major core, technical, elective, and non-technical requirements. May not be taken for pass/fail credit or audited.",
    "credits": 2,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Lauren Heckelman",
        "location": "",
        "capacity": 100,
        "enrollment": 2
      }
    ]
  },
  {
    "id": "BMEN4000E",
    "name": "SPECIAL TOPICS IN BIOMEDICAL ENGINEERING",
    "description": "Current topics in biomedical engineering. Subject matter will vary by year.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "4:10pm-6:30pm",
        "professor": "Nuttida Rungratsameetaweemana",
        "location": "644 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 27
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Tal Danino",
        "location": "401 CHANDLER",
        "capacity": 25,
        "enrollment": 22
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "12:10pm-2:40pm",
        "professor": "Ke Cheng",
        "location": "",
        "capacity": 24,
        "enrollment": 22
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "2:00pm-4:30pm",
        "professor": "Parisa Yousefpour",
        "location": "516 HAMILTON HALL",
        "capacity": 24,
        "enrollment": 9
      }
    ]
  },
  {
    "id": "BMEN4002E",
    "name": "QUANT PHYSIOLOGY II:ORGAN SYST",
    "description": "Students are introduced to a quantitative, engineering approach to cellular biology and mammalian physiology. Beginning with biological issues related to the cell, the course progresses to considerations of the major physiological systems of the human body (nervous, circulatory, respiratory, renal).",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Barclay Morrison",
        "location": "833 SEELEY W. MUDD BUILDING",
        "capacity": 90,
        "enrollment": 53
      }
    ]
  },
  {
    "id": "BMEN4350E",
    "name": "Biomechanics of Developmental Biology",
    "description": "Biophysical mechanisms of tissue organization during embryonic development: conservation laws, reaction-diffusion, finite elasticity, and fluid mechanics are reviewed and applied to a broad range of topics in developmental biology, from early development to later organogenesis of the central nervous, cardiovascular, musculoskeletal, respiratory, and gastrointestinal systems. Subdivided into modules on patterning (conversion of diffusible cues into cell fates) and morphogenesis (shaping of tissues), the course will include lectures, problem sets, reading of primary literature, and a final project.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Nandan Nerurkar",
        "location": "524 SEELEY W. MUDD BUILDING",
        "capacity": 42,
        "enrollment": 16
      },
      {
        "days": [],
        "time": "",
        "professor": "Nandan Nerurkar",
        "location": "",
        "capacity": 99,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "BMEN4410E",
    "name": "PRIN OF ULTRASOUND IN MEDICINE",
    "description": "Fourier analysis. Physics of diagnostic ultrasound and principles of ultrasound imaging instrumentation. Propagation of plane waves in lossless medium; ultrasound propagation through biological tissues; single-element and array transducer design; pulse-echo and Doppler ultrasound instrumentation, performance evaluation of ultrasound imaging systems using tissue-mimicking phantoms, ultrasound tissue characterization; ultrasound nonlinearity and bubble activity; harmonic imaging; acoustic output of ultrasound systems; biological effects of ultrasound.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "2:30pm-5:00pm",
        "professor": "Elisa Konofagou",
        "location": "545 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 16
      },
      {
        "days": [],
        "time": "",
        "professor": "Elisa Konofagou",
        "location": "",
        "capacity": 99,
        "enrollment": 2
      }
    ]
  },
  {
    "id": "BMEN4460E",
    "name": "Deep Learning in Biomedical Imaging",
    "description": "Introduction to methods in deep learning, with focus on applications to quantitative problems in biomedical imaging and Artificial Intelligence (AI) in medicine. Network models: Deep feedforward networks, convolutional neural networks and recurrent neural networks. Deep autoencoders for denoising. Segmentation and classification of biological tissues and biomarkers of disease. Theory and methods lectures will be accompanied with examples from biomedical image including analysis of neurological images of the brain (MRI), CT images of the lung for cancer and COPD, cardiac ultrasound. Programming assignments will use tensorflow / Pytorch and Jupyter Notebook. Examinations and a final project will also be required.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Andrew Laine",
        "location": "517 HAMILTON HALL",
        "capacity": 70,
        "enrollment": 46
      }
    ]
  },
  {
    "id": "BMEN4525E",
    "name": "Advanced Cell and Tissue Engineering: From Concepts to Translation",
    "description": "Covers advancements in the fields of cellular and developmental biology, molecular biology and materials science towards the development of “tissue engineered” therapies.  Emphasis on tissue engineering therapies applied to musculoskeletal tissues, such as bone, cartilage, and skeletal muscle, and nervous tissues (central and peripheral nervous system). Design considerations and concepts in market analysis examined.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Treena Arinzeh",
        "location": "633 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 30
      }
    ]
  },
  {
    "id": "BMEN4535E",
    "name": "Immunoengineering with Biomaterials and Nanotechnology",
    "description": "Introduction to fundamental aspects of immunology and engineering strategies to modulate the immune system to improve human health. We will cover the innate and adaptive immune system and current methods to characterize the immune response. Applications focus on cancer, vaccines, and autoimmune disorders.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Santiago Correa",
        "location": "545 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 47
      }
    ]
  },
  {
    "id": "BMEN4545E",
    "name": "Multimodal Neuroimaging",
    "description": "Practical implementation of neuroimaging techniques, data types, processing methods and clinical findings on independent datasets across a variety of neurological and psychiatric conditions. Basics from anatomy to digital image analysis will be explored culminating in a final project.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Frank Provenzano",
        "location": "327 SEELEY W. MUDD BUILDING",
        "capacity": 24,
        "enrollment": 24
      }
    ]
  },
  {
    "id": "BMEN4550E",
    "name": "MICRO/NANO STRUCT CELL ENG",
    "description": "Design, fabrication, and application of micro-/nanostructured systems for cell engineering. Recognition and response of cells to spatial aspects of their extracellular environment. Focus on neural, cardiac, coculture, and stem cell systems. Molecular complexes at the nanoscale.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Lance Kam",
        "location": "1024 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 37
      },
      {
        "days": [],
        "time": "",
        "professor": "Lance Kam",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "BMEN4580E",
    "name": "FOUND OF NANOBIOSCI/NANOBIOTECH",
    "description": "Fundamentals of nanobioscience and nanobiotechnology, scientific foundations, engineering principles, current and envisioned applications. Includes discussion of intermolecular forces and bonding, of kinetics and thermodynamics of self-assembly, of nanoscale transport processes arising from actions of biomolecular motors, computation and control in biomolecular systems, and of mitochondrium as an example of a nanoscale factory.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Henry Hess",
        "location": "1024 SEELEY W. MUDD BUILDING",
        "capacity": 55,
        "enrollment": 28
      },
      {
        "days": [],
        "time": "",
        "professor": "Henry Hess",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "BMEN4590E",
    "name": "BIOMEMS:CELL/MOLECULAR APPLIC",
    "description": "Topics include biomicroelectromechanical, microfluidic, and lab-on-a-chip systems in biomedical engineering, with a focus on cellular and molecular applications. Microfabrication techniques, biocompatibility, miniaturization of analytical and diagnostic devices, high-throughput cellular studies, microfabrication for tissue engineering, and in vivo devices.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Samuel Sia",
        "location": "702 HAMILTON HALL",
        "capacity": 80,
        "enrollment": 41
      },
      {
        "days": [],
        "time": "",
        "professor": "Samuel Sia",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "BMEN4899E",
    "name": "Research Training",
    "description": "Research training course. Recommended in preparation for laboratory related research.",
    "credits": 3,
    "times": []
  },
  {
    "id": "BMEN4999E",
    "name": "FIELDWORK",
    "description": "Only for BMEN graduate students who need relevant work experience as part of their program of study. Final reports required. May not be taken for pass/fail credit or audited.",
    "credits": 2,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Clark Hung",
        "location": "",
        "capacity": 100,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "BMEN6000E",
    "name": "GRADUATE SPECIAL TOPIC",
    "description": "Current topics in biomedical engineering. Subject matter will vary by year.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "1:00pm-3:00pm",
        "professor": "Sanja Vickovic",
        "location": "227 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 4
      }
    ]
  },
  {
    "id": "BMEN6003E",
    "name": "COMP MODELING-PHYSIOL SYSTEMS",
    "description": "Advanced computational modeling and quantitative analysis of selected physiological systems from molecules to organs. Selected systems are analyzed in depth with an emphasis on modeling methods and quantitative analysis. Topics may include cell signaling, molecular transport, excitable membranes, respiratory physiology, nerve transmission, circulatory control, auditory signal processing, muscle physiology, data collection and analysis.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "301 PUPIN LABORATORIES",
        "capacity": 180,
        "enrollment": 126
      }
    ]
  },
  {
    "id": "BMEN6005E",
    "name": "BIOMEDICAL INNOVATION I",
    "description": "Project-based design experience for graduate students. Elements of design process, including need identification, concept generation, concept selection, and implementation. Development of design prototype and introduction to entrepreneurship and implementation strategies. Real-world training in biomedical design and innovation.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Megan Heenan",
        "location": "616 Martin Luther King Building",
        "capacity": 50,
        "enrollment": 30
      }
    ]
  },
  {
    "id": "BMEN6007E",
    "name": "LAB-TO-MARKET",
    "description": "Introduction to and application of commercialization of biomedical innovations. Topics include needs clarification, stakeholder analysis, market analysis, value proposition, business models, intellectual property, regulatory, and reimbursement. Development of path-to-market strategy and pitch techniques.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-7:25pm",
        "professor": "Megan Heenan",
        "location": "633 SEELEY W. MUDD BUILDING",
        "capacity": 70,
        "enrollment": 49
      }
    ]
  },
  {
    "id": "BMEN6301E",
    "name": "MODELING OF BIOL TISS WITH FEM",
    "description": "Structure-function relations and linear/nonlinear constitutive models of biological tissues: anisotropic elasticity, viscoelasticity, porous media theories, mechano-electrochemical models, infinitesimal and large deformations. Emphasis on the application and implementation of constitutive models for biological tissues into existing finite element software packages. Model generation from biomedical images by extraction of tissue geometry, inhomogeneity and anisotropy. Element-by-element finite element solver for large-scale image based models of trabecular bone. Implementation of tissue remodeling simulations in finite element models.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "X. Edward Guo",
        "location": "327 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 7
      }
    ]
  },
  {
    "id": "BMEN6510E",
    "name": "STEM CELL, GENOME ENG & REGEN MED",
    "description": "General lectures on stem cell biology followed by student presentations and discussion of the primary literature. Themes presented include: basic stem cell concepts; basic cell and molecular biological characterization of endogenous stem cell populations; concepts related to reprogramming; directed differentiation of stem cell populations; use of stem cells in disease modeling or tissue replacement/repair; clinical translation of stem cell research.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "9:00am-11:00am",
        "professor": "Gordana Vunjak-Novakovic",
        "location": "LL205 HAMMER HLTH SCIENCES CENTER",
        "capacity": 70,
        "enrollment": 34
      }
    ]
  },
  {
    "id": "BMEN9100E",
    "name": "MASTERS RESEARCH",
    "description": "Candidates for the M.S. degree may conduct an investigation of some problem in biomedical engineering. No more than 6 points in this course may be counted for graduate credit.",
    "credits": 6,
    "times": []
  },
  {
    "id": "BMEN9200E",
    "name": "Master's Thesis in BME",
    "description": "This is a Pass/Fail zero credit course, “BME Master's Thesis” for MS students who are in the process of doing a thesis (BMEN E9100).   It would be registered for before/during the final semester, the semester when the student will be defending the thesis.   It must be approved by the faculty mentor.",
    "credits": 3,
    "times": []
  },
  {
    "id": "BMEN9500E",
    "name": "DOCTORAL RESEARCH",
    "description": "Doctoral candidates are required to make an original investigation of a problem in biomedical engineering, the results of which are presented in the dissertation.",
    "credits": 6,
    "times": []
  },
  {
    "id": "BMEN9700E",
    "name": "BIOMEDICAL ENGINEERING SEMINAR",
    "description": "All matriculated graduate students are required to attend the seminar as long as they are in residence. No degree credit is granted. The seminar is the principal medium of communication among those with biomedical engineering interests within the University. Guest speakers from other institutions, Columbia faculty, and students within the Department who are advanced in their studies frequently offer sessions.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Elizabeth Olson",
        "location": "301 PUPIN LABORATORIES",
        "capacity": 272,
        "enrollment": 115
      }
    ]
  },
  {
    "id": "BMEN9800E",
    "name": "DOCTORAL RESEARCH INSTRUCTION",
    "description": "A candidate for the Eng.Sc.D. degree in biomedical engineering must register for 12 points of doctoral research instruction. Registration may not be used to satisfy the minimum residence requirement for the degree.",
    "credits": 3,
    "times": []
  },
  {
    "id": "BMEN9900E",
    "name": "DOCTORAL DISSERTATION",
    "description": "A candidate for the doctorate in biomedical engineering or applied biology may be required to register for this course in every term after the students course work has been completed and until the dissertation has been accepted.",
    "credits": 3,
    "times": []
  },
  {
    "id": "CBMF4761W",
    "name": "COMPUTATIONAL GENOMICS",
    "description": "Computational techniques for analyzing genomic data including DNA, RNA, protein and gene expression data. Basic concepts in molecular biology relevant to these analyses. Emphasis on techniques from artificial intelligence and machine learning. String-matching algorithms, dynamic programming, hidden Markov models, expectation-maximization, neural networks, clustering algorithms, support vector machines. Students with life sciences backgrounds who satisfy the prerequisites are encouraged to enroll.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "5:40pm-6:55pm",
        "professor": "Cassandra Burdziak",
        "location": "209 HAVEMEYER HALL",
        "capacity": 60,
        "enrollment": 50
      }
    ]
  },
  {
    "id": "CHAP4120E",
    "name": "STATISTICAL MECHANICS AND COMP METHODS",
    "description": "Boltzmann’s entropy hypothesis and its restatement to calculate the Helmholtz and Gibbs free energies and the grand potential. Applications to interfaces, liquid crystal displays, polymeric materials, crystalline solids, heat capacity and electrical conductivity of crystalline materials, fuel cell solid electrolytes, rubbers, surfactants, molecular self assembly, ferroelectricity. Computational methods for molecular systems. Monte Carlo (MC) and molecular dynamics (MD) simulation methods. MC method applied to liquid-gas and ferromagnetic phase transitions. Deterministic MD simulations of isolated gases and liquids. Stochastic MD simulation methods.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "5:40pm-8:25pm",
        "professor": "Ben O'Shaughnessy",
        "location": "1127 SEELEY W. MUDD BUILDING",
        "capacity": 60,
        "enrollment": 34
      }
    ]
  },
  {
    "id": "CHEN3020E",
    "name": "ANALYSIS OF CHEM ENGIN PROBLMS",
    "description": "Advance chemical-engineering problem-solving skills through the use of computational tools (primarily developed in Excel or Python).  Examples are drawn from thermodynamics, transport phenomena, and chemical kinetics. The course is project based, emphasizing data analysis and report writing. Unstructured collaboration with peers is highly encouraged. Requisite numerical methods and Chemical Engineering concepts introduced.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Alexander Urban",
        "location": "227 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 36
      }
    ]
  },
  {
    "id": "CHEN3230E",
    "name": "REACTOR KINETICS/REACTOR DESIGN",
    "description": "Reaction kinetics, applications to the design of batch and continuous reactors. Multiple reactions, non-isothermal reactors. Analysis and modeling of reactor behavior.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Asher Williams",
        "location": "227 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 26
      }
    ]
  },
  {
    "id": "CHEN3810E",
    "name": "CHEM ENG & APPLIED CHEM LAB",
    "description": "Emphasizes active, experiment-based resolution of open-ended problems involving use, design, and optimization of equipment, products, or materials. Under faculty guidance students formulate, carry out, validate, and refine experimental procedures, and present results in oral and written form. Develops analytical, communications, and cooperative problem-solving skills in the context of problems that span from traditional, large scale separations and processing operations to molecular level design of materials or products. Sample projects include: scale up of apparatus, process control, chemical separations, microfluidics, surface engineering, molecular sensing, and alternative energy sources. Safety awareness is integrated.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:00pm-5:00pm",
        "professor": "Aghavni Bedrossian",
        "location": "703 HAMILTON HALL",
        "capacity": 40,
        "enrollment": 29
      }
    ]
  },
  {
    "id": "CHEN3899E",
    "name": "Research Training",
    "description": "Research training course. Recommended in preparation for laboratory related research.",
    "credits": 3,
    "times": []
  },
  {
    "id": "CHEN3900E",
    "name": "UNDERGRADUATE RESEARCH PROJECT",
    "description": "Candidates for the B.S. degree may conduct an investigation of some problem in chemical engineering or applied chemistry or carry out a special project under the supervision of the staff. Up to 6 points may be counted toward the technical elective content requirement. (Note that if more than 3 points of research are pursued, an undergraduate thesis is required.)",
    "credits": 6,
    "times": []
  },
  {
    "id": "CHEN4010E",
    "name": "MATH METHODS IN CHEMICAL ENGIN",
    "description": "Mathematical description of chemical engineering problems and the application of selected methods for their solution. General modeling principles, including model hierarchies. Linear and nonlinear ordinary differential equations and their systems, including those with variable coefficients. Partial differential equations in Cartesian and curvilinear coordinates for the solution of chemical engineering problems.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Vivian McNeill",
        "location": "545 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 21
      },
      {
        "days": [],
        "time": "",
        "professor": "Vivian McNeill",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "CHEN4112E",
    "name": "TRANSPORT IN FLUID MIXTURES",
    "description": "Develops and applies non-equilibrium thermodynamics for modeling of transport phenomena in fluids and their mixtures. Continuum balances of mass, energy and momentum for pure fluids; non-equilibrium thermodynamic development of Newtons law of viscosity and Fouriers law; applications (conduction dominated energy transport, forced and free convection energy transport in fluids); balance laws for fluid mixtures; non-equilibrium thermodynamic development of Ficks law; applications (diffusion-reaction problems, analogy between energy and mass transport processes, transport in electrolyte solutions, sedimentation).",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Christopher Durning",
        "location": "524 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 44
      },
      {
        "days": [],
        "time": "",
        "professor": "Christopher Durning",
        "location": "",
        "capacity": 99,
        "enrollment": 2
      }
    ]
  },
  {
    "id": "CHEN4140E",
    "name": "ENGINEERING SEPARATIONS",
    "description": "Design and analysis of unit operations employed in chemical engineering separations. Fundamental aspects of single and multistaged operations using both equilibrium and rate-based methods. Examples include distillation, absorption and stripping, extraction, membranes, crystallization, bioseparations, and environmental applications.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Daniel Esposito",
        "location": "524 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 31
      }
    ]
  },
  {
    "id": "CHEN4330E",
    "name": "ADVANCED CHEMICAL KINETICS",
    "description": "Complex reactive systems. Catalysis. Heterogeneous systems, with an emphasis on coupled chemical kinetics and transport phenomena. Reactions at interfaces (surfaces, aerosols, bubbles). Reactions in solution.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Juliana Silva Alves Carneiro",
        "location": "1127 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 11
      },
      {
        "days": [],
        "time": "",
        "professor": "Robert Bozic",
        "location": "",
        "capacity": 99,
        "enrollment": 2
      }
    ]
  },
  {
    "id": "CHEN4380E",
    "name": "Green Chemical Engineering & Innovation",
    "description": "Approaches used in chemistry and chemical engineering to design green, sustainable products and processes; focus of using the tenets of green chemistry as a means for chemical innovation. Technical and design practice and measuring the impacts of green and conventional approaches emphasized. Themes of business, regulatory, ethical, and social considerations relevant to chemical engineering practice.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Christopher Chen",
        "location": "524 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 26
      },
      {
        "days": [],
        "time": "",
        "professor": "Christopher Chen",
        "location": "",
        "capacity": 99,
        "enrollment": 3
      }
    ]
  },
  {
    "id": "CHEN4444E",
    "name": "Climate Technology",
    "description": "Scientific and economic analysis of real-world technologies for climate change mitigation and adaptation.  Partner with students from the business school to assess and assigned technology based on technical viability, commercial opportunity, and impact on mitigating or adapting to climate change. Assigned technologies provided by the investment community to teams of four, with expectations for independent research on the technologies, with deliverables of written and oral presentations.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "9:00am-12:00pm",
        "professor": "Alan West",
        "location": "",
        "capacity": 16,
        "enrollment": 15
      }
    ]
  },
  {
    "id": "CHEN4501E",
    "name": "PROCESS SAFETY",
    "description": "Aimed at seniors and graduate students. Provides classroom experience on chemical engineering process safety as well as Safety in Chemical Engineering certification. Process safety and process control emphasized. Application of basic chemical engineering concepts to chemical reactivity hazards, industrial hygiene, risk assessment, inherently safer design, hazard operability analysis, and engineering ethics. Application of safety to full spectrum of chemical engineering operations.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Robert Bozic",
        "location": "524 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 10
      },
      {
        "days": [],
        "time": "",
        "professor": "Robert Bozic",
        "location": "",
        "capacity": 99,
        "enrollment": 2
      }
    ]
  },
  {
    "id": "CHEN4510E",
    "name": "PROCESS & PRODUCT DESIGN II",
    "description": "Students carry out a semester-long process or product design project. The project culminates with a formal written design report and a public presentation.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "5:40pm-6:55pm",
        "professor": "Sakul Ratanalert",
        "location": "1224 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 17
      }
    ]
  },
  {
    "id": "CHEN4630E",
    "name": "TOPICS IN SOFT MATERIALS",
    "description": "Self-contained treatments of selected topics in soft materials (e.g. polymers, colloids, amphiphiles, liquid crystals, glasses, powders). Topics and instructor may change from year to year. Intended for junior/senior level undergraduates and graduate students in engineering and the physical sciences.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Christopher Durning",
        "location": "524 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 28
      },
      {
        "days": [],
        "time": "",
        "professor": "Christopher Durning",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "CHEN4660E",
    "name": "BIOCHEMICAL ENGINEERING",
    "description": "Engineering of biochemical and microbiological reaction systems. Kinetics, reactor analysis, and design of batch and continuous fermentation and enzyme processes. Recovery and separations in biochemical engineering systems.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:55pm",
        "professor": "Scott Banta",
        "location": "140 URIS HALL",
        "capacity": 45,
        "enrollment": 9
      }
    ]
  },
  {
    "id": "CHEN4670E",
    "name": "CHEMICAL ENGINEERING DATA ANALYSIS",
    "description": "Course is aimed at senior undergraduate and graduate students. Introduces fundamental concepts of Bayesian data analysis as applied to chemical engineering problems. Covers basic elements of probability theory, parameter estimation, model selection, and experimental design. Advanced topics such as nonparametric estimation and Markov chain Monte Carlo (MEME) techniques are introduced. Example problems and case studies drawn from chemical engineering practice are used to highlight the practical relevance of the material. Theory reduced to practice through programming in Mathematica. Course grade based on midterm and final exams, biweekly homework assignments, and final team project.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Kyle Bishop",
        "location": "1127 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 13
      },
      {
        "days": [],
        "time": "",
        "professor": "Kyle Bishop",
        "location": "",
        "capacity": 99,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "CHEN4720E",
    "name": "Pharmacokinetics for Engineers",
    "description": "Develop process models of the human body to predict pharmaceutical effects as a function of time and organ (or cell) type to work for a wide variety of pharmaceuticals, including small molecules, biologics, and chemotherapy agents. Computer models of pharmacokinetic behavior will be developed and then used to analyze and design drug delivery regimens. Covers: spectrum of factors affecting pharmaceutical effects on physiology, including drug formulation, mode of dosing and dosing rate, metabolism and metabolic cascades, storage in fatty tissues, and diffusional limitations.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Sakul Ratanalert",
        "location": "524 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 19
      },
      {
        "days": [],
        "time": "",
        "professor": "Sakul Ratanalert",
        "location": "",
        "capacity": 99,
        "enrollment": 2
      }
    ]
  },
  {
    "id": "CHEN4870E",
    "name": "Synthetic Organogenesis",
    "description": "The goal of synthetic organogenesis is to use stem cells to reconstitute aspects of embryo development and organ formation in vitro. Examines the molecular basis of human embryogenesis. Introduces synthetic organogenesis as an interdisciplinary field. Students learn to recognize generic molecular mechanisms behind signaling and cell lineage specification. Covers recent advances in applying engineering and contemporary biology to creating organoids and organs on chips using human stem cells.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:55pm",
        "professor": "Mijo Simunovic",
        "location": "227 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 30
      }
    ]
  },
  {
    "id": "CHEN4880E",
    "name": "ATOMISTIC SIMULATIONS FOR SCIENCE AND EN",
    "description": "Many materials properties and chemical processes are governed by atomic-scale phenomena such as phase transformations, atomic/ionic transport, and chemical reactions. Thanks to progress in computer technology and methodological development, now there exist atomistic simulation approaches for the realistic modeling and quantitative prediction of such properties. Atomistic simulations are therefore becoming increasingly important as a complement for experimental characterization, to provide parameters for meso- and macroscale models, and for the in-silico discovery of entirely new materials. This course aims at providing a comprehensive overview of cutting-edge atomistic modeling techniques that are frequently used both in academic and industrial research and engineering. Participants will develop the ability to interpret results from atomistic simulations and to judge whether a problem can be reliably addressed with simulations. The students will also obtain basic working knowledge in standard simulation software.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Alexander Urban",
        "location": "545 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 38
      },
      {
        "days": [],
        "time": "",
        "professor": "Alexander Urban",
        "location": "",
        "capacity": 99,
        "enrollment": 2
      }
    ]
  },
  {
    "id": "CHEN4900E",
    "name": "TOPICS IN CHEMICAL ENGINEERING",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Sanat Kumar",
        "location": "644 SEELEY W. MUDD BUILDING",
        "capacity": 20,
        "enrollment": 5
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:55pm",
        "professor": "Jingguang Chen",
        "location": "503 HAMILTON HALL",
        "capacity": 45,
        "enrollment": 17
      },
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-12:50pm",
        "professor": "Lauren Marbella",
        "location": "227 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 4
      }
    ]
  },
  {
    "id": "CHEN4949E",
    "name": "Chemical Engineering of Wine Making",
    "description": "Sustainability Related Course aimed at seniors and graduate students.  Provides classroom experience on wine making.  Wine making chemistry, design, safety, and process control are emphasized in classroom instruction.  Applies basic chemical engineering concepts to chemical reactivity in wine making.  Written and oral reports required. Wine making can be used anywhere in the world and the principles of the fermentation extend into other industries.  Academic and industry contributions to the content of chemical engineering concepts in wine making include chemical reactivity hazards, industrial hygiene, risk assessment, inherently safer design, and hazard operability analysis.  With the ultimate aim of leaning a skill set and safer operations in the chemical engineering profession, the applications of wine making will be emphasized.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "2:40pm-5:25pm",
        "professor": "Robert Bozic",
        "location": "829 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 18
      }
    ]
  },
  {
    "id": "CHEN4999E",
    "name": "FIELDWORK",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Christopher Chen",
        "location": "",
        "capacity": 10,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "CHEN9000E",
    "name": "CHEMICL ENGINEERING COLLOQUIUM",
    "description": "All graduate students are required to attend the department colloquium as long as they are in residence. No degree credit is granted.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "3:00pm-4:00pm",
        "professor": "Mijo Simunovic",
        "location": "750 SCHAPIRO CEPSER",
        "capacity": 50,
        "enrollment": 41
      }
    ]
  },
  {
    "id": "CHEN9400E",
    "name": "MASTERS RESEARCH",
    "description": "Sustainability Related Prescribed for M.S. candidates; elective for others with the approval of the Department. Degree candidates are to conduct an investigation of some problem in chemical engineering. No more than 6 points in this course may be counted for graduate credit.",
    "credits": 6,
    "times": []
  },
  {
    "id": "CHEN9500E",
    "name": "DOCTORAL RESEARCH",
    "description": "Open only to certified candidates for the Ph.D. and Eng.Sc.D. degrees. Doctoral candidates in chemical engineering are required to make an original investigation of a problem in chemical engineering or applied chemistry, the results of which are presented in their dissertations. No more than 15 points of credit toward the degree may be granted when the dissertation is accepted by the department.",
    "credits": 15,
    "times": []
  },
  {
    "id": "CHEN9800E",
    "name": "DOCTORAL RESEARCH INSTRUCTION",
    "description": "",
    "credits": 12,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Allie Obermeyer",
        "location": "",
        "capacity": 1,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "CIEN3000E",
    "name": "THE ART OF STRUCTURAL DESIGN",
    "description": "Basic scientific and engineering principles used for the design of buildings, bridges, and other parts of the built infrastructure. Application of principles to analysis and design of actual large-scale structures. Coverage of the history of major structural design innovations and of the engineers who introduced them. Critical examination of the unique aesthetic/artistic perspectives inherent in structural design. Consideration of management, socioeconomic, and ethical issues involved in design and construction of large-scale structures. Introduction to recent developments in sustainable engineering, including green building design and adaptable structural systems.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "George Deodatis",
        "location": "313 FAYERWEATHER",
        "capacity": 75,
        "enrollment": 62
      }
    ]
  },
  {
    "id": "CIEN3004E",
    "name": "URBAN INFRASTRUCTURE SYSTEMS",
    "description": "Sustainability Related Introduction to: (a) the infrastructure systems that support urban socioeconomic activities and (b) fundamental system design and analysis methods. Coverage of water supply, transportation, buildings, and energy infrastructure, as well as their interdependencies. Emphasis upon the process that these systems serve, the factors that influence their performance, the basic mechanisms that govern their design and operation, and the impacts that they have regionally and globally. Student teams complete a design/analysis project on a large-scale urban development site in New York City with equal emphasis given to water resources/environmental engineering, geotechnical engineering, and construction engineering and management topics.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Markus Schlaepfer",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 30
      }
    ]
  },
  {
    "id": "CIEN3121E",
    "name": "STRUCTURAL ANALYSIS",
    "description": "Methods of structural analysis. Trusses, arches, cables, frames; influence lines; deflections; force method; displacement method; computer applications.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Maria Feng",
        "location": "829 SEELEY W. MUDD BUILDING",
        "capacity": 35,
        "enrollment": 14
      }
    ]
  },
  {
    "id": "CIEN3125E",
    "name": "STRUCTURAL DESIGN",
    "description": "Design criteria for varied structural applications, including buildings and bridges; design of elements using steel, concrete, masonry, wood, and other materials.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Tom Panayotidi",
        "location": "415 SCHAPIRO CEPSER",
        "capacity": 35,
        "enrollment": 19
      }
    ]
  },
  {
    "id": "CIEN3126E",
    "name": "COMPUTER-AIDED STRUCTRL DESIGN",
    "description": "Corequisites: CIEN E3125. Introduction to software for structural analysis, design, and modeling with lab. Integration of software into project workflows. Introduction to best practices for modeling and verification of results using hand calculations.",
    "credits": 1,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "252 ENGINEERING TERRACEJan 20, 2026 – May 4, 2026",
        "capacity": 22,
        "enrollment": 21
      }
    ]
  },
  {
    "id": "CIEN3128E",
    "name": "DESIGN PROJECTS",
    "description": "Capstone design project in civil engineering. This project integrates structural, geotechnical and environmental/water resources design problems with construction management tasks and sustainability, legal and other social issues. Project is completed in teams, and communication skills are stressed. Outside lecturers will address important current issues in engineering practice. Every student in the course will be exposed with equal emphasis to issues related to geotechnical engineering, water resources / environmental engineering, structural engineering, and construction engineering and management.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "1:10pm-3:25pm",
        "professor": "Tom Panayotidi",
        "location": "252 ENGINEERING TERRACE",
        "capacity": 23,
        "enrollment": 23
      }
    ]
  },
  {
    "id": "CIEN3303E",
    "name": "IND STUDIES-CIVIL ENGIN-JUNIOR",
    "description": "A project on civil engineering subjects approved by the chairman of the department.",
    "credits": 3,
    "times": []
  },
  {
    "id": "CIEN3304E",
    "name": "IND STUDIES-CIVIL ENGIN-SENIOR",
    "description": "A project on civil engineering subjects approved by the chairman of the department.",
    "credits": 3,
    "times": []
  },
  {
    "id": "CIEN4011E",
    "name": "BIG DATA IN TRANSPORTATION",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Xuan Di",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 13
      }
    ]
  },
  {
    "id": "CIEN4100E",
    "name": "EARTHQUAKE & WIND ENGINEERING",
    "description": "Sustainability Related Basic concepts of seismology. Earthquake characteristics, magnitude, response spectrum, dynamic response of structures to ground motion. Base isolation and earthquake-resistant design. Wind loads and aeroelastic instabilities. Extreme winds. Wind effects on structures and gust factors.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Luciana Balsamo",
        "location": "524 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 26
      }
    ]
  },
  {
    "id": "CIEN4129E",
    "name": "MANAGING ENG & CONST PROCESSES",
    "description": "Introduction to the principles, methods and tools necessary to manage design and construction processes. Elements of planning, estimating, scheduling, bidding and contractual relationships. Valuation of project cash flows. Critical path method. Survey of construction procedures. Cost control and effectiveness. Field supervision.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:00pm",
        "professor": "Timothy McManus",
        "location": "616 Martin Luther King Building",
        "capacity": 50,
        "enrollment": 19
      }
    ]
  },
  {
    "id": "CIEN4131E",
    "name": "PRIN OF CONSTRUCTN TECHNIQUES",
    "description": "Current methods of construction, cost-effective designs, maintenance, safe work environment. Design functions, constructability, site and environmental issues.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Dominick Pilla",
        "location": "524 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 26
      }
    ]
  },
  {
    "id": "CIEN4132E",
    "name": "PREV&RESOL OF CONSTR DISPUTES",
    "description": "Contractual relationships in the engineering and construction industry and the actions that result in disputes. Emphasis on procedures required to prevent disputes and resolve them quickly and cost-effectively. Case studies requiring oral and written presentations.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Denis Serkin",
        "location": "545 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 8
      },
      {
        "days": [],
        "time": "",
        "professor": "Denis Serkin",
        "location": "",
        "capacity": 99,
        "enrollment": 2
      }
    ]
  },
  {
    "id": "CIEN4136E",
    "name": "ENTREPRENEURSHP - ENG & CONSTR",
    "description": "Capstone practicum where teams develop strategies and business plans for a new enterprise in the engineering and construction industry. Identification of attractive market segments and locations; development of an entry strategy; acquisition of financing, bonding and insurance; organizational design; plans for recruiting and retaining personnel; personnel compensation/incentives. Invited industry speakers. Priority given to graduate students in Construction Engineering and Management.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Pierce Reynoldson",
        "location": "524 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 14
      },
      {
        "days": [],
        "time": "",
        "professor": "Pierce Reynoldson",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "CIEN4137E",
    "name": "MANAGE CIV INSTRASTUCTURE SYST",
    "description": "Examination of the fundamentals of infrastructure planning and management, with a focus on the application of rational methods that support infrastructure decision-making. Institutional environment and issues. Decision-making under certainty and uncertainty. Capital budgeting and financing. Group decision processes. Elements of decision and finance theory. Priority given to graduate students in Construction Engineering and Management.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "",
        "location": "627 SEELEY W. MUDD BUILDINGJan 20, 2026 – May 4, 2026",
        "capacity": 50,
        "enrollment": 20
      }
    ]
  },
  {
    "id": "CIEN4138E",
    "name": "REAL ESTATE FIN/CONST MANAG",
    "description": "Introduction to financial mechanics of public and private real-estate development and management. Working from perspectives of developers, investors and taxpayers, financing of several types of real estate and infrastructure projects are covered. Basics of real-estate accounting and finance, followed by in-depth studies of private, public, and public/private-partnership projects and their financial structures. Focused on U.S.-based financing, with some international practices introduced and explored. Financial risks and rewards, and pertinent capital markets and their financing roles. Impacts and incentives of various government programs, such as LEED certification and solar power tax credits. Case studies provide opportunity to compare U.S. practices to several international methods.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Kevin Riordan",
        "location": "1024 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 27
      },
      {
        "days": [],
        "time": "",
        "professor": "Kevin Riordan",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "CIEN4141E",
    "name": "PUBLIC-PRIVATE PARTNERSHIP IN GLOBAL INF",
    "description": "Delivery of infrastructure assets through Public-Private Partnerships (PPP). Value for Money analysis. Project organization. Infrastructure sector characterization. Risk analysis, allocation and mitigation. Monte Carlo methods and Real Options. Project finance and financing instruments. Case studies from transportation, water supply and energy sectors.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Patrick Foye",
        "location": "524 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 39
      },
      {
        "days": [],
        "time": "",
        "professor": "Patrick Foye",
        "location": "",
        "capacity": 99,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "CIEN4148E",
    "name": "Construction Engineering and Management Industry Field Studies",
    "description": "Expose students to various aspects of project management in the construction industry, enhance learning experience with real-world challenges and prepare for internships and future employment. Run for two semesters. First semester focuses on Traditional Project Management, and second semester focuses on Agile Project Management. For class project, development of a Project Management Plan (PMP) and an Operations Dashboard based on real-life examples of contracts (traditional project management) and operational excellence initiatives (agile project management).",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "12:00pm-2:30pm",
        "professor": "Thomas Kyd",
        "location": "305 URIS HALL",
        "capacity": 15,
        "enrollment": 5
      },
      {
        "days": [
          "Friday"
        ],
        "time": "12:00pm-2:30pm",
        "professor": "Nare Aghasarkissian",
        "location": "404 HAMILTON HALL",
        "capacity": 15,
        "enrollment": 3
      },
      {
        "days": [
          "Monday"
        ],
        "time": "10:30am-1:00pm",
        "professor": "Ibrahim Odeh",
        "location": "611 SEELEY W. MUDD BUILDING",
        "capacity": 15,
        "enrollment": 0
      },
      {
        "days": [],
        "time": "",
        "professor": "Ibrahim Odeh",
        "location": "",
        "capacity": 99,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "CIEN4150E",
    "name": "LEADERSHIP IN DESIGN & CONSTRUCTION",
    "description": "Introduces and employs various tools, concepts, and analytical frameworks to enhance students’ ability to define and analyze leadership issues. In-depth analysis of the leadership literature and practical situational immersion using industry case studies. Multiple guest lecturers from the private and public sectors throughout the semester. Term project exploring leadership challenges in the design and construction industry.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Fredric Bell",
        "location": "644 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 8
      }
    ]
  },
  {
    "id": "CIEN4210E",
    "name": "FORENSIC STRUCTURL ENGINEERING",
    "description": "Review of significant failures, civil/structural engineering design and construction practices, ethical standards and the legal positions as necessary background to forensic engineering. Discussion of standard-of-care. Study of the process of engineering evaluation of structural defects and failures in construction and in service. Examination of the roles, activities, conduct and ethics of the forensic consultant and expert witness. Students are assigned projects of actual cases of non-performance or failure of steel, concrete, masonry, geotechnical and temporary structures, in order to perform, discuss and report their own investigations under the guidance of the instructor.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Troy Morgan",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 12
      }
    ]
  },
  {
    "id": "CIEN4226E",
    "name": "ADV DESIGN OF STEEL STRUCTURES",
    "description": "Review of loads and structural design approaches. Material considerations in structural steel design. Behavior and design of rolled steel, welded, cold-formed light-gauge, and composite concrete/steel members. Design of multi-story buildings and space structures.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Virginia Mosquera",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 26
      }
    ]
  },
  {
    "id": "CIEN4233E",
    "name": "DESIGN OF LARGE SCALE BRIDGES",
    "description": "Design of large-scale and complex bridges with emphasis on cable-supported structures. Static and dynamic loads, component design of towers, superstructures and cables; conceptual design of major bridge types including arches, cable stayed bridges and suspension bridges.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Theodore Zoli",
        "location": "903 SCHOOL OF SOCIAL WORK",
        "capacity": 50,
        "enrollment": 12
      }
    ]
  },
  {
    "id": "CIEN4234E",
    "name": "DESIGN OF LARGE SCALE BUILDINGS",
    "description": "Modern challenges in the design of large-scale building structures will be studied. Tall buildings, large convention centers and major sports stadiums present major opportunities for creative solutions and leadership on the part of engineers. This course is designed to expose the students to this environment by having them undertake the complete design of a large structure from initial design concepts on through all the major design decisions. The students work as members of a design team to overcome the challenges inherent in major projects. Topics include overview of major projects, project criteria and interface with architecture, design of foundations and structural systems, design challenges in the post 9/11 environment and roles, responsibilities and legal issues.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Elisabeth Malsch",
        "location": "516 HAMILTON HALL",
        "capacity": 50,
        "enrollment": 23
      }
    ]
  },
  {
    "id": "CIEN4242E",
    "name": "GEOTECHNICAL EARTHQUAKE ENGIN",
    "description": "Prerequisites: (CIEN E3141) or equivalent Seismicity, earthquake intensity, propagation of seismic waves, design of earthquake motion, seismic site response analysis, in situ and laboratory evaluation of dynamic soil properties, seismic performance of underground structures, seismic performance of port and harbor facilities, evaluation and mitigation of soil liquefaction and its consequences. Seismic earth pressures, slopes stability, safety of dams and embankments, seismic code provisions and practice. To alternate with E4244.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Hoe Ling",
        "location": "516 HAMILTON HALL",
        "capacity": 30,
        "enrollment": 5
      }
    ]
  },
  {
    "id": "CIEN4258E",
    "name": "Embodied AI for Construction and Facilities Management",
    "description": "Sensor modalities and their applications in construction and facilities management. Deep learning concepts and their application in robot perception. Markov Decision Process (MDP) and its application in planning and control. Formulation of embodied AI perception and control problems as MDP. Application of classic reinforcement learning algorithms to solve MDP problems. Analysis of agents’ performance through objective and subjective metrics. Understanding the critical interactions between users/occupants and embodied AI agents. Hands-on experience with robot simulation and/or collaborative robots in controlled lab environments.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "10:10am-12:40pm",
        "professor": "Zhengbo Zou",
        "location": "644 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 5
      }
    ]
  },
  {
    "id": "CIEN4999E",
    "name": "FIELDWORK",
    "description": "May be repeated for credit, but no more than 3 total points may be used for degree credit. Only for Civil Engineering and Engineering Mechanics graduate students who include relevant off-campus work experience as part of their approved program of study. Final report and letter of evaluation required. May not be taken for pass/fail credit or audited.",
    "credits": 2,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Raimondo Betti",
        "location": "",
        "capacity": 30,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "CIEN9101E",
    "name": "CIVIL ENGINEERING RESEARCH",
    "description": "Advanced study in a specialized field under the supervision of a member of the department staff. Before registering, the student must submit an outline of the proposed work for approval of the supervisor and the department chair.",
    "credits": 6,
    "times": []
  },
  {
    "id": "CIEN9500E",
    "name": "DEPARTMENTAL SEMINAR",
    "description": "All doctoral students are required to attend the department seminar as long as they are in residence. No degree credit is granted.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "1:30pm-3:00pm",
        "professor": "",
        "location": "829 SEELEY W. MUDD BUILDINGJan 20, 2026 – May 4, 2026",
        "capacity": 40,
        "enrollment": 10
      }
    ]
  },
  {
    "id": "CIEN9900E",
    "name": "DOCTORAL DISSERTATION",
    "description": "A candidate for the doctorate may be required to register for this course every term after the students coursework has been completed and until the dissertation has been accepted.",
    "credits": 3,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Raimondo Betti",
        "location": "",
        "capacity": 10,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "COMS1004W",
    "name": "INTRO-COMPUT SCI/PROG IN JAVA",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) A general introduction to computer science for science and engineering students interested in majoring in computer science or engineering. Covers fundamental concepts of computer science, algorithmic problem-solving capabilities, and introductory Java programming skills. Assumes no prior programming background. Columbia University students may receive credit for only one of the following two courses: 1004 or 1005.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Chris Murphy",
        "location": "501 SCHERMERHORN HALL",
        "capacity": 189,
        "enrollment": 122
      },
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Chris Murphy",
        "location": "501 SCHERMERHORN HALL",
        "capacity": 189,
        "enrollment": 126
      }
    ]
  },
  {
    "id": "COMS1404W",
    "name": "EMERGING SCHOLARS PROG SEMINAR",
    "description": "Peer-led weekly seminar intended for first and second year undergraduates considering a major in Computer Science. Pass/fail only. May not be used towards satisfying the major or SEAS credit requirements.",
    "credits": 1,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Chris Murphy",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 16,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Chris Murphy",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 16,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Chris Murphy",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 16,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Chris Murphy",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 16,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "9:30am-10:45am",
        "professor": "Chris Murphy",
        "location": "327 SEELEY W. MUDD BUILDING",
        "capacity": 16,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "11:00am-12:15pm",
        "professor": "Chris Murphy",
        "location": "327 SEELEY W. MUDD BUILDING",
        "capacity": 16,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "12:30pm-1:45pm",
        "professor": "Chris Murphy",
        "location": "327 SEELEY W. MUDD BUILDING",
        "capacity": 16,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "2:00pm-3:15pm",
        "professor": "Chris Murphy",
        "location": "327 SEELEY W. MUDD BUILDING",
        "capacity": 16,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "COMS2132W",
    "name": "Intermediate Computing in Python",
    "description": "Essential data structures and algorithms in Python with practical software development skills, applications in a variety of areas including biology,  natural language processing, data science and others.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Daniel Bauer",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 80,
        "enrollment": 86
      }
    ]
  },
  {
    "id": "COMS3134W",
    "name": "DATA STRUCTURES IN JAVA",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) Data types and structures: arrays, stacks, singly and doubly linked lists, queues, trees, sets, and graphs. Programming techniques for processing such structures: sorting and searching, hashing, garbage collection. Storage management. Rudiments of the analysis of algorithms. Taught in Java. Note: Due to significant overlap, students may receive credit for only one of the following three courses: COMS W3134, COMS W3136, COMS W3137.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Paul Blaer",
        "location": "417 INTERNATIONAL AFFAIRS BLDG",
        "capacity": 320,
        "enrollment": 224
      },
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "5:40pm-6:55pm",
        "professor": "Paul Blaer",
        "location": "501 NORTHWEST CORNER",
        "capacity": 164,
        "enrollment": 164
      }
    ]
  },
  {
    "id": "COMS3136W",
    "name": "ESSENTIAL DATA STRUCTURES",
    "description": "A second programming course intended for nonmajors with at least one semester of introductory programming experience. Basic elements of programming in C and C++, arraybased data structures, heaps, linked lists, C programming in UNIX environment, object-oriented programming in C++, trees, graphs, generic programming, hash tables. Due to significant overlap, students may only receive credit for either COMS W3134, W3136, or W3137.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:30pm",
        "professor": "Brian Borowski",
        "location": "453 COMPUTER SCIENCE BLDG",
        "capacity": 30,
        "enrollment": 9
      }
    ]
  },
  {
    "id": "COMS3157W",
    "name": "ADVANCED PROGRAMMING",
    "description": "C programming language and Unix systems programming. Also covers Git, Make, TCP/IP networking basics, C++ fundamentals.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Brian Borowski",
        "location": "501 SCHERMERHORN HALL",
        "capacity": 164,
        "enrollment": 164
      },
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "5:40pm-6:55pm",
        "professor": "Brian Borowski",
        "location": "501 SCHERMERHORN HALL",
        "capacity": 164,
        "enrollment": 124
      }
    ]
  },
  {
    "id": "COMS3203W",
    "name": "DISCRETE MATHEMATICS",
    "description": "Logic and formal proofs, sequences and summation, mathematical induction, binomial coefficients, elements of finite probability, recurrence relations, equivalence relations and partial orderings, and topics in graph theory (including isomorphism, traversability, planarity, and colorings).",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Ansaf Salleb-Aouissi",
        "location": "301 URIS HALL",
        "capacity": 215,
        "enrollment": 215
      },
      {
        "days": [
          "Friday"
        ],
        "time": "2:10pm-4:40pm",
        "professor": "Tony Dear",
        "location": "833 SEELEY W. MUDD BUILDING",
        "capacity": 120,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "COMS3261W",
    "name": "COMPUTER SCIENCE THEORY",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) Regular languages: deterministic and non-deterministic finite automata, regular expressions. Context-free languages: context-free grammars, push-down automata. Turing machines, the Chomsky hierarchy, and the Church-Turing thesis. Introduction to Complexity Theory and NP-Completeness.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Mihalis Yannakakis",
        "location": "833 SEELEY W. MUDD BUILDING",
        "capacity": 110,
        "enrollment": 119
      },
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Mihalis Yannakakis",
        "location": "833 SEELEY W. MUDD BUILDING",
        "capacity": 110,
        "enrollment": 110
      }
    ]
  },
  {
    "id": "COMS4111W",
    "name": "INTRODUCTION TO DATABASES",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) The fundamentals of database design and application development using databases: entity-relationship modeling, logical design of relational databases, relational data definition and manipulation languages, SQL, XML, query processing, physical database tuning, transaction processing, security. Programming projects are required.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-12:40pm",
        "professor": "Donald Ferguson",
        "location": "402 CHANDLER",
        "capacity": 125,
        "enrollment": 141
      }
    ]
  },
  {
    "id": "COMS4118W",
    "name": "OPERATING SYSTEMS I",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) Design and implementation of operating systems. Topics include process management, process synchronization and interprocess communication, memory management, virtual memory, interrupt handling, processor scheduling, device management, I/O, and file systems. Case study of the UNIX operating system. A programming project is required.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Hubertus Franke",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 110,
        "enrollment": 117
      },
      {
        "days": [],
        "time": "",
        "professor": "Hubertus Franke",
        "location": "",
        "capacity": 99,
        "enrollment": 10
      }
    ]
  },
  {
    "id": "COMS4167W",
    "name": "COMPUTER ANIMATION",
    "description": "Satisfies Science Requirement (Columbia College and General Studies)",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Changxi Zheng",
        "location": "214 PUPIN LABORATORIES",
        "capacity": 50,
        "enrollment": 56
      }
    ]
  },
  {
    "id": "COMS4170W",
    "name": "USER INTERFACE DESIGN",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) Introduction to the theory and practice of computer user interface design, emphasizing the software design of graphical user interfaces. Topics include basic interaction devices and techniques, human factors, interaction styles, dialogue design, and software infrastructure. Design and programming projects are required.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Celeste Layne",
        "location": "301 PUPIN LABORATORIES",
        "capacity": 200,
        "enrollment": 214
      },
      {
        "days": [],
        "time": "",
        "professor": "Celeste Layne",
        "location": "",
        "capacity": 99,
        "enrollment": 5
      }
    ]
  },
  {
    "id": "COMS4172W",
    "name": "3D UI AND AUGMENTED REALITY",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) Design, development, and evaluation of 3D user interfaces. Interaction techniques and metaphors, from desktop to immersive. Selection and manipulation. Travel and navigation. Symbolic, menu, gestural, and multimodal interaction. Dialogue design. 3D software support. 3D interaction devices and displays. Virtual and augmented reality. Tangible user interfaces. Review of relevant 3D math.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Steven Feiner",
        "location": "233 SEELEY W. MUDD BUILDING",
        "capacity": 45,
        "enrollment": 38
      }
    ]
  },
  {
    "id": "COMS4232W",
    "name": "Advanced Algorithms",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) Introduces classic and modern algorithmic ideas that are central to many areas of Computer Science. The focus is on most powerful paradigms and techniques of how to design algorithms, and how to measure their efficiency. The intent is to be broad, covering a diversity of algorithmic techniques, rather than be deep. The covered topics have all been implemented and are widely used in industry. Topics include: hashing, sketching/streaming, nearest neighbor search, graph algorithms, spectral graph theory, linear programming, models for large-scale computation, and other related topics",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Alexandr Andoni",
        "location": "1127 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 46
      },
      {
        "days": [],
        "time": "",
        "professor": "Alexandr Andoni",
        "location": "",
        "capacity": 99,
        "enrollment": 14
      }
    ]
  },
  {
    "id": "COMS4281W",
    "name": "INTRO TO QUANTUM COMPUTING",
    "description": "Satisfies Science Requirement (Columbia College and General Studies)",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "James Bartusek",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 100,
        "enrollment": 100
      }
    ]
  },
  {
    "id": "COMS4419W",
    "name": "Internet Technology, Economics, and Policy",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) Technology, economic and policy aspects of the Internet. Summarizes how the Internet works technically, including protocols, standards, radio spectrum, global infrastructure and interconnection. Micro-economics with a focus on media and telecommunication economic concerns, including competition and monopolies, platforms, and behavioral economics. US constitution, freedom of speech, administrative procedures act and regulatory process, universal service, role of FCC. Not a substitute for CSEE4119. Suitable for non-majors.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Henning Schulzrinne",
        "location": "825 SEELEY W. MUDD BUILDING",
        "capacity": 44,
        "enrollment": 49
      }
    ]
  },
  {
    "id": "COMS4460W",
    "name": "PRIN-INNOVATN/ENTREPRENEURSHIP",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) Team project centered course focused on principles of planning, creating, and growing a technology venture. Topics include: identifying and analyzing opportunities created by technology paradigm shifts, designing innovative products, protecting intellectual property, engineering innovative business models.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "8:40am-9:55am",
        "professor": "William Reinisch",
        "location": "415 SCHAPIRO CEPSER",
        "capacity": 40,
        "enrollment": 38
      }
    ]
  },
  {
    "id": "COMS4701W",
    "name": "ARTIFICIAL INTELLIGENCE",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) Prior knowledge of Python is recommended. Provides a broad understanding of the basic techniques for building intelligent computer systems. Topics include state-space problem representations, problem reduction and and-or graphs, game playing and heuristic search, predicate calculus, and resolution theorem proving, AI systems and languages for knowledge representation, machine learning and concept formation and other topics such as natural language processing may be included as time permits.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Adam Lin",
        "location": "402 CHANDLER",
        "capacity": 120,
        "enrollment": 130
      },
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "6:40pm-7:55pm",
        "professor": "Adam Lin",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 110,
        "enrollment": 119
      },
      {
        "days": [],
        "time": "",
        "professor": "Adam Lin",
        "location": "",
        "capacity": 99,
        "enrollment": 7
      }
    ]
  },
  {
    "id": "COMS4705W",
    "name": "NATURAL LANGUAGE PROCESSING",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) Computational approaches to the analysis, understanding, and generation of natural language text at scale. Emphasis on machine learning techniques for NLP, including deep learning and large language models. Applications may include information extraction, sentiment analysis, question answering, summarization, machine translation, and conversational AI. Discussion of datasets, benchmarking and evaluation, interpretability, and ethical considerations. Due to significant overlap in content, only one of COMS 4705 or Barnard COMS 3705BC may be taken for credit.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Zhou Yu",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 110,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Daniel Bauer",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 110,
        "enrollment": 123
      },
      {
        "days": [
          "Monday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Andrei Simion",
        "location": "209 HAVEMEYER HALL",
        "capacity": 90,
        "enrollment": 80
      },
      {
        "days": [],
        "time": "",
        "professor": "Andrei Simion",
        "location": "",
        "capacity": 99,
        "enrollment": 10
      }
    ]
  },
  {
    "id": "COMS4710W",
    "name": "Ethical and Responsible AI",
    "description": "Sustainability Related Principles of Ethical Artificial Intelligence across technical and societal dimensions. Combines technical AI and machine learning implementations and ethical analysis. Students will learn to build, audit, and mitigate ethical risks in AI systems using tools like fairness libraries, explainability frameworks, and privacy-preserving techniques. Emphasizes coding, algorithmic critique, and real-world cases. Topics include: foundations of AI ethics, fairness, interpretability, explainability,  accountability, privacy, robustness, alignment, safety, and societal benefit. Assessments include coding projects, bias auditing assignments, and ethical analysis papers.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Ansaf Salleb-Aouissi",
        "location": "614 SCHERMERHORN HALL",
        "capacity": 120,
        "enrollment": 131
      },
      {
        "days": [],
        "time": "",
        "professor": "Ansaf Salleb-Aouissi",
        "location": "",
        "capacity": 99,
        "enrollment": 24
      }
    ]
  },
  {
    "id": "COMS4721W",
    "name": "MACHINE LEARNING FOR DATA SCI",
    "description": "Satisfies Science Requirement (Columbia College and General Studies)",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Yining Liu",
        "location": "142 URIS HALL",
        "capacity": 100,
        "enrollment": 87
      },
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Yining Liu",
        "location": "142 URIS HALL",
        "capacity": 100,
        "enrollment": 105
      },
      {
        "days": [],
        "time": "",
        "professor": "Yining Liu",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "COMS4732W",
    "name": "Computer Vision II: Learning",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) Advanced course in computer vision. Topics include convolutional networks and back-propagation, object and action recognition, self-supervised and few-shot learning, image synthesis and generative models, object tracking, vision and language, vision and audio, 3D representations, interpretability, and bias, ethics, and media deception.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "9:10am-11:40am",
        "professor": "Aleksander Holynski",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 110,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "COMS4771W",
    "name": "MACHINE LEARNING",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) Basic statistical principles and algorithmic paradigms of supervised machine learning. Prerequisites: Multivariable calculus (e.g. MATH1201 or MATH1205 or APMA2000), linear algebra (e.g. COMS3251 or MATH2010 or MATH2015), probability (e.g. STAT1201 or STAT4001 or IEOR3658 or MATH2015), discrete math (COMS3203), and general mathematical maturity. Programming and algorithm analysis (e.g. COMS 3134). COMS 3770 is recommended for students who wish to refresh their math background.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Tony Dear",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 110,
        "enrollment": 113
      },
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Tony Dear",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 110,
        "enrollment": 109
      },
      {
        "days": [],
        "time": "",
        "professor": "Tony Dear",
        "location": "",
        "capacity": 99,
        "enrollment": 12
      }
    ]
  },
  {
    "id": "COMS4995W",
    "name": "TOPICS IN COMPUTER SCIENCE",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) Selected topics in computer science. Content and prerequisites vary between sections and semesters. May be repeated for credit. Check “topics course” webpage on the department website for more information on each section.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Timothy Roughgarden",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 60,
        "enrollment": 62
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Gary Zamchick",
        "location": "644 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 42
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Gary Zamchick",
        "location": "644 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 41
      },
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Jae Lee",
        "location": "633 SEELEY W. MUDD BUILDING",
        "capacity": 70,
        "enrollment": 66
      },
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "5:40pm-6:55pm",
        "professor": "Jae Lee",
        "location": "402 CHANDLER",
        "capacity": 120,
        "enrollment": 105
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Christian Swinehart",
        "location": "1024 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 37
      },
      {
        "days": [
          "Monday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Yongwhan Lim",
        "location": "310 FAYERWEATHER",
        "capacity": 90,
        "enrollment": 34
      },
      {
        "days": [
          "Friday"
        ],
        "time": "12:10pm-2:00pm",
        "professor": "Suman Jana",
        "location": "825 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 24
      },
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Adam Block",
        "location": "415 SCHAPIRO CEPSER",
        "capacity": 40,
        "enrollment": 35
      },
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "5:40pm-6:55pm",
        "professor": "Zhuo Zhang",
        "location": "601B FAIRCHILD LIFE SCIENCES BLDG",
        "capacity": 20,
        "enrollment": 19
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "7:05pm-9:35pm",
        "professor": "Adam Kelleher",
        "location": "209 HAVEMEYER HALL",
        "capacity": 75,
        "enrollment": 54
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Spencer Luo",
        "location": "310 FAYERWEATHER",
        "capacity": 90,
        "enrollment": 38
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Andrei Simion",
        "location": "310 FAYERWEATHER",
        "capacity": 90,
        "enrollment": 81
      }
    ]
  },
  {
    "id": "COMS6156E",
    "name": "TOPICS IN SOFTWARE ENGINEERING",
    "description": "Topics in Software engineering arranged as the need and availability arises. Topics are usually offered on a one-time basis. Since the content of this course changes, it may be repeated for credit with advisor approval. Consult the department for section assignment.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Gail Kaiser",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 26
      },
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Gail Kaiser",
        "location": "ONLINE ONLY",
        "capacity": 99,
        "enrollment": 4
      }
    ]
  },
  {
    "id": "COMS6178E",
    "name": "Human-Computer Interaction",
    "description": "Human–computer interaction (HCI) studies (1) what computers are used for, (2) how people interact with computers, and (3) how either of those should change in the future. Topics include ubiquitous computing, mobile health, interaction techniques, social computing, mixed reality, accessibility, and ethics. Activities include readings, presentations, and discussions of research papers. Substantial HCI research project required.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Brian Smith",
        "location": "1024 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 1
      },
      {
        "days": [],
        "time": "",
        "professor": "Brian Smith",
        "location": "",
        "capacity": 99,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "COMS6184E",
    "name": "ANONYMITY & PRIVACY",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "12:10pm-2:00pm",
        "professor": "Sebastian Zimmeck",
        "location": "545 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 23
      },
      {
        "days": [
          "Friday"
        ],
        "time": "12:10pm-2:00pm",
        "professor": "Sebastian Zimmeck",
        "location": "ONLINE ONLY",
        "capacity": 99,
        "enrollment": 5
      }
    ]
  },
  {
    "id": "COMS6261E",
    "name": "ADVANCED CRYPTOGRAPHY",
    "description": "A study of advanced cryptographic research topics such as: secure computation, zero knowledge, privacy, anonymity, cryptographic protocols. Concentration on theoretical foundations, rigorous approach, and provable security. Contents varies between offerings. May be repeated for credit.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Miranda Christ",
        "location": "524 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 8
      }
    ]
  },
  {
    "id": "COMS6424E",
    "name": "HARDWARE SECURITY",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Simha Sethumadhavan",
        "location": "1024 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "COMS6706E",
    "name": "Advanced Spoken Language Processing",
    "description": "Applications of spoken language processing, including text-to-speech and dialogue systems. Analysis of speech and text, including entrainment, empathy, personality, emotion, humor, sarcasm, deception, trust, radicalization, and charisma.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:00pm",
        "professor": "Julia Hirschberg",
        "location": "750 SCHAPIRO CEPSER",
        "capacity": 70,
        "enrollment": 76
      },
      {
        "days": [],
        "time": "",
        "professor": "Julia Hirschberg",
        "location": "",
        "capacity": 99,
        "enrollment": 14
      }
    ]
  },
  {
    "id": "COMS6732E",
    "name": "COMPUTATIONAL IMAGING",
    "description": "Computational imaging uses a combination of novel imaging optics and a computational module to  produce new forms of visual information. Survey of the state-of-the-art in computational imaging.  Review of recent papers on omnidirectional and panoramic imaging, catadioptric imaging, high  dynamic range imaging, mosaicing and superresolution. Classes are seminars with the instructor,  guest speakers, and students presenting papers and discussing them.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:00pm",
        "professor": "Shree Nayar",
        "location": "453 COMPUTER SCIENCE BLDG",
        "capacity": 20,
        "enrollment": 15
      }
    ]
  },
  {
    "id": "COMS6975E",
    "name": "Advanced Topics in Natural Language Processing",
    "description": "Selected topics in Natural Language Processing (advanced level). Content and prerequisites vary between sections and semesters. May be repeated for credit. Check the \"topics courses\" webpage on the department website for more information on each section.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "12:10pm-2:00pm",
        "professor": "John Hewitt",
        "location": "524 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 28
      }
    ]
  },
  {
    "id": "COMS6998E",
    "name": "TOPICS IN COMPUTER SCIENCE",
    "description": "Selected topics in computer science (advanced level). Content and prerequisites vary between sections and semesters. May be repeated for credit. Check “topics course” webpage on the department website for more information on each section.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:00pm",
        "professor": "Silvia Sellan",
        "location": "306 URIS HALL",
        "capacity": 20,
        "enrollment": 18
      },
      {
        "days": [
          "Friday"
        ],
        "time": "12:10pm-2:00pm",
        "professor": "Vasileios Kalantzis",
        "location": "829 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 5
      },
      {
        "days": [
          "Monday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Kaoutar El Maghraoui",
        "location": "614 SCHERMERHORN HALL",
        "capacity": 120,
        "enrollment": 129
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "IHsin Chung",
        "location": "825 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 43
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Josh Alman",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 14
      },
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-12:00pm",
        "professor": "Henry Yuen",
        "location": "415 SCHAPIRO CEPSER",
        "capacity": 40,
        "enrollment": 16
      },
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-12:00pm",
        "professor": "Martha Kim",
        "location": "644 SEELEY W. MUDD BUILDING",
        "capacity": 20,
        "enrollment": 9
      },
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-12:00pm",
        "professor": "Yunzhu Li",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 45
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "1:10pm-3:55pm",
        "professor": "Toniann Pitassi",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 20,
        "enrollment": 4
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Richard Zemel",
        "location": "333 URIS HALL",
        "capacity": 50,
        "enrollment": 45
      },
      {
        "days": [],
        "time": "",
        "professor": "Kaoutar El Maghraoui",
        "location": "",
        "capacity": 99,
        "enrollment": 13
      }
    ]
  },
  {
    "id": "COMS9902E",
    "name": "SEMINAR IN COMPUTER SCIENCE",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Eugene Wu",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 25,
        "enrollment": 29
      }
    ]
  },
  {
    "id": "CSEE3827W",
    "name": "FUNDAMENTALS OF COMPUTER SYSTS",
    "description": "Fundamentals of computer organization and digital logic. Boolean algebra, Karnaugh maps, basic gates and components, flipflops and latches, counters and state machines, basics of combinational and sequential digital design. Assembly language, instruction sets, ALU’s, single-cycle and multi-cycle processor design, introduction to pipelined processors, caches, and virtual memory.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Daniel Rubenstein",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 110,
        "enrollment": 110
      },
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Daniel Rubenstein",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 110,
        "enrollment": 110
      }
    ]
  },
  {
    "id": "CSEE4119W",
    "name": "COMPUTER NETWORKS",
    "description": "Introduction to computer networks and the technical foundations of the Internet, including applications, protocols, local area networks, algorithms for routing and congestion control, security, elementary performance evaluation. Several written and programming assignments required.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Xia Zhou",
        "location": "614 SCHERMERHORN HALL",
        "capacity": 120,
        "enrollment": 130
      },
      {
        "days": [],
        "time": "",
        "professor": "Xia Zhou",
        "location": "",
        "capacity": 99,
        "enrollment": 9
      }
    ]
  },
  {
    "id": "CSEE4121W",
    "name": "COMPUTER SYSTEMS FOR DATA SCIENCE",
    "description": "An introduction to computer architecture and distributed systems with an emphasis on warehouse scale computing systems. Topics will include fundamental tradeoffs in computer systems, hardware and software techniques for exploiting instruction-level parallelism, data-level parallelism and task level parallelism, scheduling, caching, prefetching, network and memory architecture, latency and throughput optimizations, specialization, and an introduction to programming data center computers.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Waqar Aqeel",
        "location": "301 PUPIN LABORATORIES",
        "capacity": 200,
        "enrollment": 200
      }
    ]
  },
  {
    "id": "CSEE4840W",
    "name": "EMBEDDED SYSTEMS",
    "description": "Embedded system design and implementation combining hardware and software. I/O, interfacing, and peripherals. Weekly laboratory sessions and term project on design of a microprocessor-based embedded system including at least one custom peripheral. Knowledge of C programming and digital logic required.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Stephen Edwards",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 110,
        "enrollment": 117
      }
    ]
  },
  {
    "id": "CSEE6868E",
    "name": "EMBEDDED SCALABLE PLATFORMS",
    "description": "Inter-disciplinary graduate-level seminar on design and programming of embedded scalable platforms. Content varies between offerings to cover timely relevant issues and latest advances in system-on-chip design, embedded software programming, and electronic design automation. Requires substantial reading of research papers, class participation, and semester-long project.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "6:10pm-8:00pm",
        "professor": "Luca Carloni",
        "location": "451 COMPUTER SCIENCE BLDG",
        "capacity": 30,
        "enrollment": 19
      }
    ]
  },
  {
    "id": "CSEE6915E",
    "name": "TECH WRITING FOR CS AND ENGINRS",
    "description": "Topics to help CS/CE and EE graduate students’ communication skills. Emphasis on writing, presenting clear, concise proposals, journal articles, conference papers, theses, and technical presentations.  Credit may not be used to satisfy degree requirements.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "10:00am-12:00pm",
        "professor": "Janet Kayfetz",
        "location": "414 PUPIN LABORATORIES",
        "capacity": 25,
        "enrollment": 12
      }
    ]
  },
  {
    "id": "CSOR4231E",
    "name": "ANALYSIS OF ALGORITHMS I",
    "description": "Prerequisites: COMS W3134, COMS W3136, or COMS W3137, and COMS W3203. Introduction to the design and analysis of efficient algorithms. Topics include models of computation, efficient sorting and searching, algorithms for algebraic problems, graph algorithms, dynamic programming, probabilistic methods, approximation algorithms, and NP-completeness.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Daniel Bienstock",
        "location": "303 URIS HALL",
        "capacity": 65,
        "enrollment": 8
      }
    ]
  },
  {
    "id": "CSOR4231W",
    "name": "ANALYSIS OF ALGORITHMS I",
    "description": "Prerequisites: (COMS W3134 or COMS W3136COMS W3137) and (COMS W3203) Introduction to the design and analysis of efficient algorithms. Topics include models of computation, efficient sorting and searching, algorithms for algebraic problems, graph algorithms, dynamic programming, probabilistic methods, approximation algorithms, and NP-completeness.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-12:40pm",
        "professor": "Eleni Drinea",
        "location": "614 SCHERMERHORN HALL",
        "capacity": 120,
        "enrollment": 61
      },
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Alexandr Andoni",
        "location": "633 SEELEY W. MUDD BUILDING",
        "capacity": 70,
        "enrollment": 74
      },
      {
        "days": [],
        "time": "",
        "professor": "Eleni Drinea",
        "location": "",
        "capacity": 99,
        "enrollment": 7
      }
    ]
  },
  {
    "id": "EACE3250E",
    "name": "Hydrosystems Engineering",
    "description": "Sustainability Related A quantitative introduction to hydrologic and hydraulic systems, with a focus on integrated modeling and analysis of the water cycle and associated mass transport for water resources and environmental engineering. Coverage of unit hydrologic processes such as precipitation, evaporation, infiltration, runoff generation, open channel and pipe flow, subsurface flow and well hydraulics in the context of example watersheds and specific integrative problems such as risk-based design for flood control, provision of water, and assessment of environmental impact or potential for non-point source pollution. Spatial hydrologic analysis using GIS and watershed models.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "",
        "location": "307 URIS HALLJan 20, 2026 – May 4, 2026",
        "capacity": 20,
        "enrollment": 13
      }
    ]
  },
  {
    "id": "EACE3255E",
    "name": "ENVIRONMENTAL CONTROL AND POLLUTION REDUCTION",
    "description": "Sustainability Related Sources of solid/gaseous air pollution and the technologies used for modern methods of abatement. Air pollution and its abatement from combustion of coal, oil, and natural gas and the thermodynamics of heat engines in power generation. Catalytic emission control is contrasted to thermal processes for abating carbon monoxide, hydrocarbons, oxides of nitrogen and sulfur from vehicles and stationary sources. Processing of petroleum for generating fuels. Technological challenges of controlling greenhouse gas emissions. Biomass and the hydrogen economy coupled with fuel cells as future sources of energy.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Robert Farrauto",
        "location": "304 HAMILTON HALL",
        "capacity": 40,
        "enrollment": 23
      }
    ]
  },
  {
    "id": "EACE4163E",
    "name": "Sustainable Water Treatment and Reuse",
    "description": "Sustainability Focused Fundamentals of water pollution and wastewater characteristics. Chemistry, microbiology, and reaction kinetics. Design of primary, secondary, and advanced treatment systems. Small community and residential systems.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Paul Knowles",
        "location": "467 EXT SCHERMERHORN HALL",
        "capacity": 40,
        "enrollment": 27
      }
    ]
  },
  {
    "id": "EACE4250E",
    "name": "Hydrosystems Engineering",
    "description": "Sustainability Related Quantitative introduction to hydrologic and hydraulic systems, with a focus on integrated modeling and analysis of the water cycle and associated mass transport for water resources and environmental engineering. Coverage of unit hydrologic processes such as precipitation, evaporation, infiltration, runoff generation, open channel and pipe flow, subsurface flow and well hydraulics in the context of example watersheds and specific integrative problems such as risk-based design for flood control, provision of water, and assessment of environmental impact or potential for non-point source pollution. Spatial hydrologic analysis using GIS and watershed models.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "",
        "location": "307 URIS HALLJan 20, 2026 – May 4, 2026",
        "capacity": 24,
        "enrollment": 12
      }
    ]
  },
  {
    "id": "EACE4252E",
    "name": "Foundations of Environmental Engineering",
    "description": "Sustainability Focused Engineering aspects of problems involving human interaction with the natural environment. Review of fundamental principles that underlie the discipline of environmental engineering, i.e. constituent transport and transformation processes in environmental media such as water, air, and ecosystems. Engineering applications for addressing environmental problems such as water quality and treatment, air pollution emissions, and hazardous waste remediation. Presented in the context of current issues facing the practicing engineers and government agencies, including legal and regulatory framework, environmental impact assessments, and natural resource management.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Benjamin Bostick",
        "location": "333 URIS HALL",
        "capacity": 40,
        "enrollment": 22
      }
    ]
  },
  {
    "id": "EAEE3800E",
    "name": "EARTH & ENVIR ENGIN LAB",
    "description": "Experiments on fundamental aspects of Earth and environmental engineering with emphasis on the applications of chemistry, biology and thermodynamics to environmental processes: energy generation, analysis and purification of water, environmental biology, and biochemical treatment of wastes. Students will learn the laboratory procedures and use analytical equipment firsthand, hence demonstrating experimentally the theoretical concepts learned in class.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:00am-1:00pm",
        "professor": "Luana Llanes",
        "location": "332 URIS HALL",
        "capacity": 15,
        "enrollment": 6
      }
    ]
  },
  {
    "id": "EAEE3900E",
    "name": "UNDERGRAD RES-ENVIRONMTL ENGIN",
    "description": "This course may be repeated for credit, but no more than 3 points of this course may be counted towards the satisfaction of the B. S. degree requirements. Candidates for the B.S. degree may conduct an investigation in Earth and Environmental Engineering, or carry out a special project under the supervision of EAEE faculty. Credit for the course is contingent on the submission of an acceptable thesis or final report. This course cannot substitute for the Undergraduate design project (EAEE E3999x or EAEE E3999y)",
    "credits": 3,
    "times": []
  },
  {
    "id": "EAEE3999E",
    "name": "UNDERGRADUATE PROJECT II",
    "description": "Students must enroll for both 3998x and 3999y during their senior year. Selection of an actual problem in Earth and environmental engineering, and design of an engineering solution including technical, economic, environmental, ethical, health and safety, social issues. Use of software for design, visualization, economic analysis, and report preparation. Students may work in teams. Presentation of results in a formal report and public presentation.",
    "credits": 2,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "5:00pm-6:00pm",
        "professor": "Robert Farrauto",
        "location": "423 KENT HALL",
        "capacity": 15,
        "enrollment": 8
      }
    ]
  },
  {
    "id": "EAEE4002E",
    "name": "ALTERNATIVE ENERGY RESOURCES",
    "description": "An engineering and economic analysis of past, present and future energy resources. Technological options and their role in the world energy markets. Understanding limits of energy and power density and its impact of resource adoption and feasibility. Comparison of  renewable and non-renewable energy resources and analysis of the consequences of various technological choices and constraints. Economic considerations, energy availability, and the environmental consequences of large-scale, widespread use of each particular technology. Critical analysis of carbon dioxide capture and carbon dioxide disposal as a means of sustaining the fossil fuel options in comparison to dramatic increase of electrified resources.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Dan Steingart",
        "location": "428 PUPIN LABORATORIES",
        "capacity": 100,
        "enrollment": 79
      }
    ]
  },
  {
    "id": "EAEE4003E",
    "name": "AQUATIC CHEMISTRY",
    "description": "Principles of physical chemistry applied to equilibria and kinetics of aqueous solutions in contact with minerals and anthropogenic residues. The scientific background for addressing problems of aqueous pollution, water treatment, and sustainable production of materials with minimum environmental impact. Hydrolysis, oxidation-reduction, complex formation, dissolution and precipitation, predominance diagrams; examples of natural water systems, processes for water treatment and for the production of inorganic materials from minerals.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Oscar Nordness",
        "location": "420 PUPIN LABORATORIES",
        "capacity": 50,
        "enrollment": 13
      }
    ]
  },
  {
    "id": "EAEE4009E",
    "name": "GIS-RES,ENVIR,INFRASTRUCTR MGT",
    "description": "Basic concepts of spatial data representation and organization, and analytical tools are introduced and applied in a form of case studies from hydrology, environmental conservation, and emergency response to natural or man-made hazards, among others. Technical content includes geographic topics (map projections, cartography, etc.), spatial statistics, database design and use, interpolation and visualization of spatial surfaces and volumes, and multi-criteria decision analysis. Students will learn the basics of ArcGIS Pro, Model Builder and Python. Elective term projects or final exams emphasize spatial information synthesis towards the solution of a specific problem.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "6:15pm-8:30pm",
        "professor": "Yuri Gorokhovich",
        "location": "420 PUPIN LABORATORIES",
        "capacity": 50,
        "enrollment": 19
      },
      {
        "days": [
          "Monday",
          "Tuesday"
        ],
        "time": "8:40pm-9:55pm",
        "professor": "Yuri Gorokhovich",
        "location": "420 PUPIN LABORATORIES",
        "capacity": 50,
        "enrollment": 2
      }
    ]
  },
  {
    "id": "EAEE4103E",
    "name": "Environmental Soil Chemistry",
    "description": "Sustainability Focused Introduction to principles of chemical reactions in soils, soil chemical properties and processes, and the chemical nature of soil solids. The scientific background for characterizing soil health, addressing soil pollution, performing soil remediation, and sustainable use of soil/subsurface resources. Properties of elements and molecules in soil, soil water chemistry, redox reactions in natural systems, mineralogy and weathering processes in soils, soil carbon cycling, climate change impact on soil, soil organic matter formation and structure, and legacy and emerging contaminants.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Adeyemi Adeleye",
        "location": "307 URIS HALL",
        "capacity": 40,
        "enrollment": 6
      }
    ]
  },
  {
    "id": "EAEE4140E",
    "name": "ENVIRONMENTAL PHYSICOCHEMICAL PROCESSES",
    "description": "Sustainability Focused Fundamentals and applications of key physicochemical processes relevant to water quality engineering (such as water treatment, waste water treatment/reuse/recycling, desalination) and the natural environment (e.g. lakes, rivers, groundwater).",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Yin Yip Ngai",
        "location": "333 URIS HALL",
        "capacity": 35,
        "enrollment": 9
      }
    ]
  },
  {
    "id": "EAEE4222E",
    "name": "Interfacial Engineering for Sustainable Energy and Materials",
    "description": "Cross disciplinary interfacial engineering principles and applications in sustainable energy and material science. Surface science and systems analysis across different technology sectors - material production and processing, waste management, device manufacture, composites, coatings, ceramics, membranes, biomaterials, and microelectronics.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Raymond Farinato",
        "location": "333 URIS HALL",
        "capacity": 50,
        "enrollment": 8
      },
      {
        "days": [],
        "time": "",
        "professor": "Raymond Farinato",
        "location": "",
        "capacity": 99,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "EAEE4257E",
    "name": "ENVIR DATA ANALYSIS & MODELING",
    "description": "Sustainability Focused Introduction parametric and non-parametric statistical models applied to climate and environmental data analysis. Time and space data analysis methods will be focused, including clustering, autoregressive models, trend analysis, Bayesian analysis, missing data imputation, geostatistics, principal components analysis. Application to problems of climate variation and change; hydrology; air, water and soil pollution dynamics; disease propagation; ecological change; and resource assessment. The class requires the use of R with hands-on programming applied to a current environmental data analysis problem.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Bolun Xu",
        "location": "420 PUPIN LABORATORIES",
        "capacity": 50,
        "enrollment": 35
      }
    ]
  },
  {
    "id": "EAEE4280E",
    "name": "Issues Facing the Water Industry",
    "description": "Principles and practice of water treatment and utility management will be presented.  Project-based class where students will work in teams to solve an issue for a water utility.  Variety of external experts will lecture and serve as a resource for students for the project.  Allows students to better understand the role of the water utility in providing safe drinking water in a sustainable manner. Students will become familiar with the challenges facing water utilities, gain knowledge in the design and operation of water treatment systems, and learn how to develop solutions to water supply and water quality issues which will allow them to pursue productive careers in the consulting, utility, or regulatory fields.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "William Becker",
        "location": "602 NORTHWEST CORNER",
        "capacity": 30,
        "enrollment": 7
      }
    ]
  },
  {
    "id": "EAEE4302E",
    "name": "CARBON CAPTURE",
    "description": "Major technologies to store carbon dioxide, geological, ocean, and in the carbon chemical pool. Carbon dioxide transport technologies also covered. In addition to basic science and engineering challenges of each technology, full spectrum of economic, environmental, regulatory, and political/policy aspects, and their implication for regional and global carbon management strategies of the future. Combination of lectures, class debates and breakout groups, student presentations, and independent final projects.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Xiaoyang Shi",
        "location": "304 HAMILTON HALL",
        "capacity": 40,
        "enrollment": 38
      }
    ]
  },
  {
    "id": "EAEE4305E",
    "name": "CO2 UTILIZATION AND CONVERSION",
    "description": "Introduction to various CO2 utilization and conversion technologies that can reduce the overall  carbon footprint of commodity chemicals and materials. Fundamentals of thermodynamics, fluid  mechanics, reaction kinetics, catalysis and reactor design will be discussed using technological  examples such as enhanced oil recovery, shale fracking, photo and electrochemical conversion of  CO2 to chemical and fuels, and formation of solid carbonates and their various uses. Life cycle  analyses of potential products and utilization schemes will also be discussed, as well as the use of  renewable energy for CO2 conversion.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Robert Farrauto",
        "location": "420 PUPIN LABORATORIES",
        "capacity": 50,
        "enrollment": 37
      }
    ]
  },
  {
    "id": "EAEE4990E",
    "name": "Special Topics in Earth and Environmental Engineering",
    "description": "Sustainability Related Special topics in earth and environmental engineering. Content and prerequisites vary between sections and semesters. May be repeated for credit.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "6:10pm-7:25pm",
        "professor": "",
        "location": "415 SCHAPIRO CEPSERJan 20, 2026 – May 4, 2026",
        "capacity": 40,
        "enrollment": 9
      }
    ]
  },
  {
    "id": "EAEE9271E",
    "name": "EARTH & ENVIRONMNTL ENG THESIS",
    "description": "Research work culminating in a creditable dissertation on a problem of a fundamental nature selected in conference between student and adviser. Wide latitude is permitted in choice of a subject, but independent work of distinctly graduate character is required in its handling.",
    "credits": 6,
    "times": []
  },
  {
    "id": "EAEE9280E",
    "name": "EARTH & ENVIRONMENTAL COLLOQ",
    "description": "All graduate students are required to attend the departmental colloquium as long as they are in residence. Advanced doctoral students may be excused after three years of residence. No degree credit is granted.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Oscar Nordness",
        "location": "602 HAMILTON HALL",
        "capacity": 85,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "EAEE9305E",
    "name": "EARTH/ENVIRONMNTL ENG RESEARCH",
    "description": "Graduate research directed toward solution of a problem in mineral processing or chemical metallurgy",
    "credits": 12,
    "times": []
  },
  {
    "id": "EAEE9800E",
    "name": "DOCTORAL RESEARCH INSTRUCTION",
    "description": "A candidate for the Eng.Sc.D. degree in mineral engineering must register for 12 points of doctoral research instruction. Registration in EAEE E9800 may not be used to satisfy the minimum residence requirement for the degree.",
    "credits": 12,
    "times": []
  },
  {
    "id": "ECBM4070E",
    "name": "Computing with Brain Circuits of Model Organisms",
    "description": "Building the functional map of the fruit fly brain. Molecular transduction and spatio-temporal encoding in the early visual system. Predictive coding in the Drosophila retina. Canonical circuits in motion detection. Canonical navigation circuits in the central complex. Molecular transduction and combinatorial encoding in the early olfactory system. Predictive coding in the antennal lobe. The functional role of the mushroom body and the lateral horn. Canonical circuits for associative learning and innate memory. Projects in Python.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Aurel Lazar",
        "location": "1127 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 21
      },
      {
        "days": [],
        "time": "",
        "professor": "Aurel Lazar",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "ECBM6070E",
    "name": "TPC NEUROSCI & DEEP LEARN",
    "description": "Selected advanced topics in neuroscience and deep learning. Content varies from year to year, and different topics rotate through the course numbers 6070 to 6079.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Aurel Lazar",
        "location": "1127 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 11
      },
      {
        "days": [],
        "time": "",
        "professor": "Aurel Lazar",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "EECS4340E",
    "name": "COMPUTER HARDWARE DESIGN",
    "description": "Practical aspects of computer hardware design through the implementation, simulation, and prototyping of a PDP-8 processor. High-level and assembly languages, I/O, interrupts, datapath and control design, pipelining, busses, memory architecture. Programmable logic and hardware prototyping with FPGAs. Fundamentals of VHDL for register-transfer level design. Testing and validation of hardware. Hands-on use of industry CAD tools for simulation and synthesis.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Tanvir Ahmed Khan",
        "location": "633 SEELEY W. MUDD BUILDING",
        "capacity": 55,
        "enrollment": 53
      }
    ]
  },
  {
    "id": "EECS6321E",
    "name": "ADV DIGITAL ELECTRONIC CIRCUIT",
    "description": "Advanced topics in the design of digital integrated circuits. Clocked and non-clocked combinational logic styles. Timing circuits: latches and flip-flops, phase-locked loops, delay-locked loops. SRAM and DRAM memory circuits. Modeling and analysis of on-chip interconnect. Power distribution and power-supply noise. Clocking, timing, and synchronization issues. Circuits for chip-to-chip electrical communication. Advanced technology issues that affect circuit design. The class may include a team circuit design project.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Mingoo Seok",
        "location": "717 HAMILTON HALL",
        "capacity": 80,
        "enrollment": 81
      }
    ]
  },
  {
    "id": "EECS6691E",
    "name": "TOPICS DATA-DRIVEN ANAL & COMP",
    "description": "Selected advanced topics in data-driven analysis and computation. Content varies from year to year, and different topics rotate through the course numbers 6690 to 6699.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "10:10am-12:40pm",
        "professor": "Zoran Kostic",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 39
      }
    ]
  },
  {
    "id": "EECS6692E",
    "name": "TOPICS DATA-DRIVEN ANAL & COMP",
    "description": "Selected advanced topics in data-driven analysis and computation. Content varies from year to year, and different topics rotate through the course numbers 6690 to 6699.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Zoran Kostic",
        "location": "",
        "capacity": 25,
        "enrollment": 12
      }
    ]
  },
  {
    "id": "EECS6699E",
    "name": "TOPICS DATA-DRIVEN ANAL & COMP",
    "description": "Selected advanced topics in data-driven analysis and computation. Content varies from year to year, and different topics rotate through the course numbers 6690 to 6699.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Predrag Jelenkovic",
        "location": "614 SCHERMERHORN HALL",
        "capacity": 100,
        "enrollment": 107
      }
    ]
  },
  {
    "id": "EECS6720E",
    "name": "BAYESIAN MOD MACHINE LEARNING",
    "description": "Basic statistics and machine learning strongly recommended. Bayesian approaches to machine learning. Topics include mixed-membership models, latent factor models, Bayesian nonparametric methods, probit classification, hidden Markov models, Gaussian mixture models, model learning with mean-field variational inference, scalable inference for Big Data. Applications include image processing, topic modeling, collaborative filtering and recommendation systems.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "John Paisley",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 50
      }
    ]
  },
  {
    "id": "EECS6792E",
    "name": "Deep Learning on the Edge",
    "description": "Advanced-level lab-based course. Build and experiment with deep-learning models implemented on low-power GPU edge computing device. Topics: architectures of low-power GPU devices, algorithms and DL models suitable for edge implementation, CUDA language, pre-processing of data, labeling for ground-truth annotation, profiling techniques, connectivity between edge devices and cloud computing servers, real-life data for experimentation, comparison of performance for a variety of methods, comparison of performance of edge-computing and cloud computing approaches.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Zoran Kostic",
        "location": "644 SEELEY W. MUDD BUILDING",
        "capacity": 25,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "EECS6890E",
    "name": "TOPICS-INFORMATION PROCESSING",
    "description": "This course covers the fundamentals of quantum engineering, including core quantum information concepts, noise and decoherence in quantum hardware, as well as basic quantum control and error correction strategies.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Zhaoyou Wang",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 14
      }
    ]
  },
  {
    "id": "EECS6892E",
    "name": "TOPICS-INFORMATION PROCESSING",
    "description": "Advanced topics spanning electrical engineering and computer science such as speech processing and recognition, image and multimedia content analysis, and other areas drawing on signal processing, information theory, machine learning, pattern recognition, and related topics. Content varies from year to year, and different topics rotate through the course numbers 6890 to 6899.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "10:10am-12:40pm",
        "professor": "Javad Ghaderi",
        "location": "141 URIS HALL",
        "capacity": 65,
        "enrollment": 65
      },
      {
        "days": [],
        "time": "",
        "professor": "Javad Ghaderi",
        "location": "",
        "capacity": 5,
        "enrollment": 2
      }
    ]
  },
  {
    "id": "EECS6895E",
    "name": "TOPICS-INFORMATION PROCESSING",
    "description": "Advanced topics spanning Electrical Engineering and Computer Science such as speech processing and recognition, image and multimedia content analysis, and other areas drawing on signal processing, information theory, machine learning, pattern recognition, and related topics. Content varies from year to year, and different topics rotate through the course numbers 6890 to 6899.  Topic: Advanced Big Data Analytics.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Ching-yung Lin",
        "location": "1127 SEELEY W. MUDD BUILDING",
        "capacity": 60,
        "enrollment": 66
      }
    ]
  },
  {
    "id": "EECS6899E",
    "name": "Topics-Information Processing",
    "description": "Advanced topics spanning electrical engineering and computer science such as speech processing and recognition, image and multimedia content analysis, and other areas drawing on signal processing, information theory, machine learning, pattern recognition, and related topics. Content varies from year to year, and different topics rotate through the course numbers 6890 to 6899.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Jack Kouloheris",
        "location": "702 HAMILTON HALL",
        "capacity": 50,
        "enrollment": 20
      }
    ]
  },
  {
    "id": "EEME4601E",
    "name": "DISCRETE CONTROL SYSTEMS",
    "description": "The course studies control strategies and their implementation in the discrete domain. Introduction with examples; review of continuous control and Laplace Transforms; review of continuous state-space representation and Solutions; review of  difference equations, discretization in time and frequency, the WKS (aka Shannon) sampling theorem, windowing, filters, Transforms: Fourier series, Fourier transform, z-transform and their inverses; Ideal sampler, Sample-and-hold devices, zero, one, polygonal, and slewer hold; Transfer functions, block diagrams, and signal flow graphs for discrete systems; Discrete State-Space transformation, controllabililty, observability, and stability in the state-space domain. Discrete time and z domain analysis, steady state analysis, discrete-time root-locus, and pole-zero placement; Discrete Nyquist stability criterion, Bode plot, Gain and Phase Margin analysis, Nichols chart, bandwidth and sensitivity analysis; Design criteria, self-tuning regulator, Kalman filter, and simulation, followed by advanced stability analysis such as Lyapunov stability; Overview of the discrete Euler-Lagrange equations, discrete maximum and minimum principle, optimal linear discrete regulator design, optimality and dynamic programming.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Homayoon Beigi",
        "location": "1127 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 27
      },
      {
        "days": [],
        "time": "",
        "professor": "Homayoon Beigi",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      },
      {
        "days": [],
        "time": "",
        "professor": "Homayoon Beigi",
        "location": "",
        "capacity": 99,
        "enrollment": 4
      }
    ]
  },
  {
    "id": "EEME6912E",
    "name": "Topics in Control",
    "description": "This proposed course allows for a variety of potential advanced courses to be taught as part of the proposed concentration on control.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Navid Asr",
        "location": "209 HAVEMEYER HALL",
        "capacity": 60,
        "enrollment": 23
      }
    ]
  },
  {
    "id": "EEOR6616E",
    "name": "CONVEX OPTIMIZATION",
    "description": "Convex sets and functions, and operations preserving convexity. Convex optimization problems. Convex duality. Applications of convex optimization problems ranging from signal processing and information theory to revenue management. Convex optimization in Banach spaces. Algorithms for solving constrained convex optimization problems.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Bento Natura",
        "location": "233 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 30
      },
      {
        "days": [],
        "time": "",
        "professor": "Bento Natura",
        "location": "",
        "capacity": 99,
        "enrollment": 2
      },
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Adam Sobel",
        "location": "555 EXT SCHERMERHORN HALL",
        "capacity": 25,
        "enrollment": 10
      }
    ]
  },
  {
    "id": "ELEN1201E",
    "name": "INTRO-ELECTRICAL ENGINEERING",
    "description": "Basic concepts of electrical engineering. Exploration of selected topics and their application. Electrical variables, circuit laws, nonlinear and linear elements, ideal and real sources, transducers, operational amplifiers in simple circuits, external behavior of diodes and transistors, first order RC and RL circuits. Digital representation of a signal, digital logic gates, flipflops. A lab is an integral part of the course. Required of electrical engineering and computer engineering majors.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "David Vallancourt",
        "location": "501 NORTHWEST CORNER",
        "capacity": 160,
        "enrollment": 147
      }
    ]
  },
  {
    "id": "ELEN3082E",
    "name": "DIGITAL SYSTEMS LABORATORY",
    "description": "Companion lab course for CSEE W3827. Experiments cover such topics as logic gates; flip-flops; shift registers; counters; combinational logic circuits; sequential logic circuits; programmable logic devices. The lab generally meets on alternate weeks.",
    "credits": 1,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Kenneth Shepard",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 42,
        "enrollment": 38
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Kenneth Shepard",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 42,
        "enrollment": 42
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Kenneth Shepard",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 42,
        "enrollment": 35
      }
    ]
  },
  {
    "id": "ELEN3083E",
    "name": "ELECTRONIC CIRCUITS LABORATORY",
    "description": "Companion lab course for ELEN E3331. Experiments cover such topics as macromodeling of nonidealities of opamps using SPICE; Schmitt triggers and astable multivibrations using op-amps and diodes; logic inverters and amplifiers using bipolar junction transistors; logic inverters and ring oscillators using MOSFETs; filter design using opamps. The lab generally meets on alternate weeks.",
    "credits": 1,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "David Vallancourt",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 46,
        "enrollment": 45
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "David Vallancourt",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 46,
        "enrollment": 32
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "David Vallancourt",
        "location": "1205 SEELEY W. MUDD BUILDING",
        "capacity": 46,
        "enrollment": 28
      }
    ]
  },
  {
    "id": "ELEN3331E",
    "name": "ELECTRONIC CIRCUITS",
    "description": "Operational amplifier circuits. Diodes and diode circuits. MOS and bipolar junction transistors. Biasing techniques. Small-signal models. Single-stage transistor amplifiers. Analysis and design of CMOS logic gates. A/D and D/A converters.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "David Vallancourt",
        "location": "209 HAVEMEYER HALL",
        "capacity": 95,
        "enrollment": 101
      }
    ]
  },
  {
    "id": "ELEN3390E",
    "name": "EE SENIOR DESIGN PROJECT",
    "description": "Students work in teams to specify, design, implement and test an engineering prototype. Involves technical as well as non-technical considerations, such as manufacturability, impact on the environment, economics, adherence to engineering standards, and other real-world constraints. Projects are presented publicly by each design team in a school-wide expo.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "David Vallancourt",
        "location": "1206 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 5
      },
      {
        "days": [
          "Friday"
        ],
        "time": "6:00pm-7:00pm",
        "professor": "David Vallancourt",
        "location": "1206 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 18
      }
    ]
  },
  {
    "id": "ELEN3401E",
    "name": "ELECTROMAGNETICS",
    "description": "Basic field concepts. Interaction of time-varying electromagnetic fields. Field calculation of lumped circuit parameters. Transition from electrostatic to quasistatic and electromagnetic regimes. Transmission lines. Energy transfer, dissipation, and storage. Waveguides. Radiation.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Keren Bergman",
        "location": "141 URIS HALL",
        "capacity": 80,
        "enrollment": 79
      }
    ]
  },
  {
    "id": "ELEN3701E",
    "name": "INTRO TO COMMUNICATION SYSTEMS",
    "description": "A basic course in communication theory, stressing modern digital communication systems. Nyquist sampling, PAM and PCM/DPCM systems, time division multipliexing, high frequency digital (ASK, OOK, FSK, PSK) systems, and AM and FM systems. An introduction to noise processes, detecting signals in the presence of noise, Shannons theorem on channel capacity, and elements of coding theory.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Irving Kalet",
        "location": "633 SEELEY W. MUDD BUILDING",
        "capacity": 65,
        "enrollment": 71
      }
    ]
  },
  {
    "id": "ELEN3990E",
    "name": "FIELDWORK",
    "description": "May be repeated for credit, but no more than 3 total points may be used for degree credit. Only for Electrical Engineering and Computer Engineering undergraduate students who include relevant off-campus work experience as part of their approved program of study. Final report and letter of evaluation required. May not be used as technical or nontechnical electives or to satisfy any other Electrical Engineering or Computer Engineering major requirements. May not be taken for pass/fail credit or audited.",
    "credits": 2,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Xiaodong Wang",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "ELEN3998E",
    "name": "PROJECTS IN ELEC ENGINEERING",
    "description": "May be repeated for credit, but no more than 3 total points may be used for degree credit. Independent project involving laboratory work, computer programming, analytical investigation, or engineering design.",
    "credits": 3,
    "times": []
  },
  {
    "id": "ELEN4193E",
    "name": "MOD DISPLAY SCI & TECHNOLOGY",
    "description": "Introduction to modern display systems in an engineering context. The basis for visual perception, image representation, color space, metrics of illumination. Physics of luminescence, propagation and manipulation of light in anisotropic media, emissive displays, and spatial light modulators. Fundamentals of display addressing, the Alt-Pleshko theorem, multiple line addressing. Large area electronics, fabrication, and device integration of commercially important display types. A series of short laboratories will reinforce material from the lectures. Enrollment may be limited.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Ioannis Kymissis",
        "location": "516 HAMILTON HALL",
        "capacity": 54,
        "enrollment": 49
      }
    ]
  },
  {
    "id": "ELEN4314E",
    "name": "COMMUNICATION CIRCUITS",
    "description": "Principles of electronic circuits used in the generation, transmission, and reception of signal waveforms, as used in analog and digital communication systems. Nonlinearity and distortion; power amplifiers; tuned amplifiers; oscillators; multipliers and mixers; modulators and demodulators; phase-locked loops. An extensive design project is an integral part of the course.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Emily Naviasky",
        "location": "702 HAMILTON HALL",
        "capacity": 60,
        "enrollment": 25
      }
    ]
  },
  {
    "id": "ELEN4510E",
    "name": "Grid Modernization & Clean Tech",
    "description": "Sustainability Focused Covers solar energy, battery storage, electric vehicles, and data centers — treated as sub-transmission level loads — as key distributed energy resources. Students learn how advanced metering data enables grid optimization through demand-side management, distributed energy resource coordination, and distribution system control. Topics include smart inverters, flexible loads, and cybersecurity for modern grid operations.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Sindhu Suresh",
        "location": "304 HAMILTON HALL",
        "capacity": 35,
        "enrollment": 28
      }
    ]
  },
  {
    "id": "ELEN4702E",
    "name": "DIGITAL COMMUNICATIONS",
    "description": "Digital communications for both point-to-point and switched applications is further developed. Optimum receiver structures and transmitter signal shaping for both binary and M-ary signal transmission. An introduction to block codes and convolutional codes, with application to space communications.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Alexei Ashikhmin",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 9
      }
    ]
  },
  {
    "id": "ELEN4730E",
    "name": "Quantum Optimization and Machine Learning",
    "description": "An introduction to the recent development in quantum optimization and quantum machine learning using gate-based Noisy Intermediate Scale Quantum (NISQ) computers. IBM’s quantum programming framework Qiskit is utilized. Qbits, quantum gates and quantum measurements, quantum algorithms (Grover’s search, Simon’s algorithm, quantum Fourier transform, quantum phase estimation) quantum optimization (quantum annealing, QAOA, variational quantum eigensolver), quantum machine learning (quantum support vector machine, quantum neural networks).",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Jeremy Johnston",
        "location": "545 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 28
      },
      {
        "days": [],
        "time": "",
        "professor": "Jeremy Johnston",
        "location": "",
        "capacity": 99,
        "enrollment": 3
      }
    ]
  },
  {
    "id": "ELEN4815E",
    "name": "RANDOM SIGNALS & NOISE",
    "description": "Characterization of stochastic processes as models of signals and noise; stationarity, ergodicity, correlation functions, and power spectra. Gaussian processes as models of noise in linear and nonlinear systems; linear and nonlinear transformations of random processes; orthogonal series representations. Applications to circuits and devices, to communication, control, filtering, and prediction.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Irving Kalet",
        "location": "1127 SEELEY W. MUDD BUILDING",
        "capacity": 60,
        "enrollment": 46
      },
      {
        "days": [],
        "time": "",
        "professor": "Irving Kalet",
        "location": "",
        "capacity": 99,
        "enrollment": 2
      }
    ]
  },
  {
    "id": "ELEN4830E",
    "name": "DIGITAL IMAGE PROCESSING",
    "description": "Introduction to the mathematical tools and algorithmic implementation for representation and processing of digital pictures, videos, and visual sensory data. Image representation, filtering, transform, quality enhancement, restoration, feature extraction, object segmentation, motion analysis, classification, and coding for data compression. A series of programming assignments reinforces material from the lectures.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "10:10am-12:40pm",
        "professor": "Christine Hendon",
        "location": "303 URIS HALL",
        "capacity": 60,
        "enrollment": 19
      },
      {
        "days": [],
        "time": "",
        "professor": "Christine Hendon",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "ELEN4904E",
    "name": "TOPICS IN EE & CE",
    "description": "Selected topics in electrical and computer engineering. Content varies from year to year, and different topics rotate through the course numbers 4900 to 4909.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Hui Jin",
        "location": "702 HAMILTON HALL",
        "capacity": 80,
        "enrollment": 28
      }
    ]
  },
  {
    "id": "ELEN4998E",
    "name": "INTERMEDIATE PROJECTS",
    "description": "May be repeated for credit, but no more than 3 total points may be used for degree credit. Substantial independent project involving laboratory work, computer programming, analytical investigation, or engineering design.",
    "credits": 3,
    "times": []
  },
  {
    "id": "ELEN6002E",
    "name": "ADVANCED PROJECTS",
    "description": "May be repeated for up to 6 points of credit. Graduate-level projects in various areas of electrical engineering and computer science. In consultation with an instructor, each student designs his or her project depending on the students previous training and experience. Students should consult with a professor in their area for detailed arrangements no later than the last day of registration.",
    "credits": 4,
    "times": []
  },
  {
    "id": "ELEN6312E",
    "name": "ADV ANALOG INTEGRATED CIRCUITS",
    "description": "Integrated circuit device characteristics and models; temperature- and supply-independent biasing; IC operational amplifier analysis and design and their applications; feedback amplifiers, stability and frequency compensation techniques; noise in circuits and low-noise design; mismatch in circuits and low-offset design. Computer-aided analysis techniques are used in homework(s) or a design project.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Armagan Dascurcu",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 44
      }
    ]
  },
  {
    "id": "ELEN6316E",
    "name": "Analog-Digital Interfaces in VLSI",
    "description": "Analog-to-digital and digital-to-analog conversion techniques for very large scale integrated circuits and systems. Precision sampling; quantization; A/D and D/A converter architectures and metrics; Nyquist architectures; oversampling architectures; correction techniques; system considerations. A design project is an integral part of this course.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Timothy Dickson",
        "location": "702 HAMILTON HALL",
        "capacity": 60,
        "enrollment": 45
      }
    ]
  },
  {
    "id": "ELEN6318E",
    "name": "MICROWAVE CIRCUIT DESIGN",
    "description": "Introduction to microwave engineering and microwave circuit design. Review of transmission lines. Smith chart, S-parameters, microwave impedance matching, transformation and power combining networks, active and passive microwave devices, S-parameter-based design of RF and microwave amplifiers. A microwave circuit design project (using microwave CAD) is an integral part of the course.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Yves Baeyens",
        "location": "313 FAYERWEATHER",
        "capacity": 45,
        "enrollment": 27
      }
    ]
  },
  {
    "id": "ELEN6333E",
    "name": "SEMICONDUCTOR DEVICE PHYSICS",
    "description": "Physics and properties of semiconductors. Transport and recombination of excess carriers. Schottky, P-N, MOS, and heterojunction diodes. Field effect and bipolar junction transistors. Dielectric and optical properties. Optical devices including semiconductor lamps, lasers, and detectors.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Xiang Meng",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 44
      }
    ]
  },
  {
    "id": "ELEN6350E",
    "name": "VLSI DESIGN LABORATORY",
    "description": "Design of a CMOS mixed-signal integrated circuit. The class divides up into teams to work on mixed-signal integrated circuit designs. The chips are fabricated to be tested the following term. Lectures cover use of computer-aided design tools, design issues specific to the projects, and chip integration issues. This course shares lectures with E4350, but the complexity requirements of integrated circuits are higher.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Harish Krishnaswamy",
        "location": "606 LEWISOHN HALL",
        "capacity": 35,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "ELEN6414E",
    "name": "PHOTONIC INTEGRATED CIRCUITS",
    "description": "Photonic integrated circuits are important subsystem components for telecommunications, optically controlled radar, optical signal processing, and photonic local area networks. An introduction to the devices and the design of these circuits. Principle and modeling of dielectric waveguides (including silica on silicon and InP based materials), waveguide devices (simple and star couplers), and surface diffractive elements. Discussion of numerical techniques for modeling circuits, including beam propagation and finite difference codes, and design of other devices: optical isolators, demultiplexers.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Michal Lipson",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 22
      }
    ]
  },
  {
    "id": "ELEN6570E",
    "name": "Future Energy: Economics, Systems, Policies",
    "description": "Sustainability Focused Holistic understanding of the science and socioeconomic modelling of climate change, the properties of renewable energy sources, their economic and engineering implications, and the policy decisions in the transition to future energy. Fundamentals of systems needed to support deep penetration of renewable energy, including grid stability, transmission and storage systems, and the design and operations of carbonaware datacenters.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Debasis Mitra",
        "location": "1024 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 22
      },
      {
        "days": [],
        "time": "",
        "professor": "Debasis Mitra",
        "location": "",
        "capacity": 5,
        "enrollment": 5
      }
    ]
  },
  {
    "id": "ELEN6593E",
    "name": "Topics in Smart Electric Energy",
    "description": "Sustainability Focused Selected advanced topics in smart electric energy. Content varies from year to year.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Mohamed Kamaludeen",
        "location": "516 HAMILTON HALL",
        "capacity": 35,
        "enrollment": 10
      }
    ]
  },
  {
    "id": "ELEN6730E",
    "name": "Quantum Sensing Theory",
    "description": "Introduction to quantum detection and estimation theory and its applications to quantum communications, quantum radar, quantum metrology, and quantum tomography. Background on quantum mechanics, quantum detection, composite quantum systems, Gaussian states, and quantum estimation.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Xiaodong Wang",
        "location": "1024 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 10
      },
      {
        "days": [],
        "time": "",
        "professor": "Xiaodong Wang",
        "location": "",
        "capacity": 99,
        "enrollment": 4
      }
    ]
  },
  {
    "id": "ELEN6771E",
    "name": "TOPICS IN NETWORKING",
    "description": "Further study of areas such as communication protocols and architectures, flow and congestion control in data networks, performance evaluation in integrated networks. Content varies from year to year, and different topics rotate through the course numbers 6770 to 6779.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Doru Calin",
        "location": "141 URIS HALL",
        "capacity": 60,
        "enrollment": 15
      }
    ]
  },
  {
    "id": "ELEN6772E",
    "name": "TOPICS IN NETWORKING",
    "description": "Further study of areas such as communication protocols and architectures, flow and congestion control in data networks, performance evaluation in integrated networks. Content varies from year to year, and different topics rotate through the course numbers 6770 to 6779.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Anwar Walid",
        "location": "633 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 36
      }
    ]
  },
  {
    "id": "ELEN6873E",
    "name": "Statistical signal processing and learning",
    "description": "Introduction to the fundamental principles of statistical signal processing related to detection and estimation. Hypothesis testing, signal detection, parameter estimation, signal estimation, and selected advanced topics. Suitable for students doing research in communications, control, signal processing, and related areas.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "10:10am-12:40pm",
        "professor": "Guido Jajamovich",
        "location": "330 URIS HALL",
        "capacity": 60,
        "enrollment": 8
      }
    ]
  },
  {
    "id": "ELEN6876E",
    "name": "Sparse and Low-Dimensional Models for High-Dimensional Data",
    "description": "Overview of theory, computation and applications for sparse and low-dimensional data modeling. Recoverability of sparse and low-rank models. Optimization methods for low-dim data modeling. Applications to imaging, neuroscience, communications, web data.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "John Wright",
        "location": "1127 SEELEY W. MUDD BUILDING",
        "capacity": 60,
        "enrollment": 27
      },
      {
        "days": [],
        "time": "",
        "professor": "John Wright",
        "location": "",
        "capacity": 99,
        "enrollment": 4
      }
    ]
  },
  {
    "id": "ELEN6883E",
    "name": "TOPICS IN SIGNAL PROCESSING",
    "description": "Advanced topics in signal processing, such as multidimensional signal processing, image feature extraction, image/video editing and indexing, advanced digital filter design, multirate signal processing, adaptive signal processing, and wave-form coding of signals. Content varies from year to year, and different topics rotate through the course numbers 6880 to 6889.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "8:10am-10:00am",
        "professor": "Chong Li",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 35
      }
    ]
  },
  {
    "id": "ELEN6889E",
    "name": "TOPICS IN SIGNAL PROCESSING",
    "description": "Advanced topics in signal processing, such as multidimensional signal processing, image feature extraction, image/video editing and indexing, advanced digital filter design, multirate signal processing, adaptive signal processing, and wave-form coding of signals. Content varies from year to year, and different topics rotate through the course numbers 6880 to 6889.  Topic: Large Data Stream Processing.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Deepak Turaga",
        "location": "633 SEELEY W. MUDD BUILDING",
        "capacity": 70,
        "enrollment": 14
      }
    ]
  },
  {
    "id": "ELEN6908E",
    "name": "TOPICS IN ELECTRICAL AND COMPUTER ENGINE",
    "description": "Selected topics in electrical and computer engineering. Content varies from year to year, and different topics rotate through the course numbers 6900 to 6909.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Xiaofan Jiang",
        "location": "717 HAMILTON HALL",
        "capacity": 80,
        "enrollment": 64
      }
    ]
  },
  {
    "id": "ELEN6945E",
    "name": "DEVICE NANOFABRICATION",
    "description": "This course provides an understanding of the methods used for structuring matter on the nanometer length: thin-film technology; lithographic patterning and technologies including photon, electron, ion and atom, scanning probe, soft lithography, and nanoimprinting; pattern transfer; self-assembly; process integration; and applications.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Jose Bahamonde",
        "location": "214 PUPIN LABORATORIES",
        "capacity": 50,
        "enrollment": 3
      }
    ]
  },
  {
    "id": "ELEN6999E",
    "name": "FIELDWORK",
    "description": "May be repeated for credit, but no more than 3 total points may be used for degree credit. Only for electrical engineering and computer engineering graduate students who include relevant off-campus work experience as part of their approved program of study. Final report required. May not be taken for pass/fail credit or audited.",
    "credits": 1,
    "times": []
  },
  {
    "id": "ELEN9002E",
    "name": "RESEARCH II",
    "description": "Points of credit to be approved by the department. Requires submission of an outline of the proposed research for approval by the faculty member who is to supervise the work of the student. The research facilities of the department are available to qualified students interested in advanced study.",
    "credits": 6,
    "times": []
  },
  {
    "id": "ELEN9701E",
    "name": "INFO & COMMUNICATION THEORIES",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Gil Zussman",
        "location": "306 URIS HALL",
        "capacity": 20,
        "enrollment": 5
      }
    ]
  },
  {
    "id": "ELEN9800E",
    "name": "DOCTORAL RESEARCH INSTRUCTION",
    "description": "A candidate for the Eng.Sc.D. degree in electrical engineering must register for 12 points of doctoral research instruction. Registration in ELEN E9800 may not be used to satisfy the minimum residence requirement for the degree.",
    "credits": 12,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Christine Hendon",
        "location": "",
        "capacity": 99,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "ENGI1006E",
    "name": "INTRO TO COMP FOR ENG/APP SCI",
    "description": "Satisfies Science Requirement (Columbia College and General Studies) An interdisciplinary course in computing intended for first year SEAS students. Introduces computational thinking, algorithmic problem solving and Python programming with applications in science and engineering. Assumes no prior programming background.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Maxwell Levatich",
        "location": "309 HAVEMEYER HALL",
        "capacity": 200,
        "enrollment": 221
      }
    ]
  },
  {
    "id": "ENGI1102E",
    "name": "THE ART OF ENGINEERING",
    "description": "Bridge between the science-oriented, high school way of thinking and the engineering point of view. Fundamental concepts of math and science reviewed and re-framed in an engineering context; numerous examples of each concept drawn from all disciplines of engineering represented at Columbia. Non-technical issues of importance in professional engineering practice such as ethics, engineering project management, and societal impact. Only open to Columbia Engineering first-year undergraduate students or second-year transfer students. Lab fee: $150.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "11:00am-1:00pm",
        "professor": "David Vallancourt",
        "location": "301 PUPIN LABORATORIES",
        "capacity": 258,
        "enrollment": 239
      }
    ]
  },
  {
    "id": "ENGI4000E",
    "name": "PROF DEVELOPMENT&LEADERSHIP",
    "description": "The PDL course aims to enhance and expand Columbia Engineering graduate students' interpersonal, professional, and leadership skills, through five core sessions, covering (1) in-person communication skills; (2) resume; (3) business writing; (4) social media and the job search; and (5) academic and professional ethics and integrity. ENGI E4000 also requires 5 elective sessions to further students' development based on their personal interests. Students must select at least one life management elective and one interview elective. This course is offered at the Pass/D/Fail grading option.",
    "credits": 79,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Elizabeth Strauss",
        "location": "",
        "capacity": 150,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "ENGI4510E",
    "name": "Capstone",
    "description": "Applies core tools of Executive Master of Science Program to development or design challenge in concentration area. Integrates learning to practice the application of new skills. Students can propose a challenge or join an existing challenge proposed by faculty.",
    "credits": 3,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Hugh Thomas",
        "location": "",
        "capacity": 0,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "ENGI4800E",
    "name": "DATA SCIENCE CAPSTONE&ETHICS",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "2:10pm-4:00pm",
        "professor": "Robert Kramer",
        "location": "633 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 25
      }
    ]
  },
  {
    "id": "ENGI4990E",
    "name": "ADVANCED MASTER'S RESEARCH",
    "description": "Research Course for Master's Students. Students must be nominated by a faculty member. The research credits may not be counted towards the credits required for the Master’s degree.",
    "credits": 6,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Alexis Moore",
        "location": "",
        "capacity": 49,
        "enrollment": 52
      }
    ]
  },
  {
    "id": "ENGI5000E",
    "name": "WORKPLACE COMMUNICATION IN ENGLISH",
    "description": "English communication proficiency is important for academic achievement and career success. Columbia Engineering provides English communication instruction for students who would like to improve their communication skills in English. In a small group setting (15-20 students), enrollees will obtain opportunities to interact with the instructor and fellow classmates to improve communication skills.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "10:00am-11:40am",
        "professor": "",
        "location": "253 ENGINEERING TERRACE",
        "capacity": 18,
        "enrollment": 0
      },
      {
        "days": [
          "Thursday"
        ],
        "time": "3:00pm-4:40pm",
        "professor": "",
        "location": "327 URIS HALL",
        "capacity": 18,
        "enrollment": 2
      },
      {
        "days": [
          "Saturday"
        ],
        "time": "10:20am-12:00pm",
        "professor": "",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 18,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "ENGI5001E",
    "name": "PROFESSIONAL PRESENTATION",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Tuesday",
          "Wednesday",
          "Thursday",
          "Friday"
        ],
        "time": "2:00pm-3:40pm",
        "professor": "",
        "location": "",
        "capacity": 18,
        "enrollment": 6
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "1:00pm-2:40pm",
        "professor": "",
        "location": "337 SEELEY W. MUDD BUILDING",
        "capacity": 18,
        "enrollment": 4
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "1:00pm-2:40pm",
        "professor": "",
        "location": "253 ENGINEERING TERRACE",
        "capacity": 18,
        "enrollment": 4
      }
    ]
  },
  {
    "id": "ENGI5002E",
    "name": "PROFESSIONAL COMMUNICATION IN ENGLISH",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "1:00pm-2:40pm",
        "professor": "Hyoseon Lee",
        "location": "703 HAMILTON HALL",
        "capacity": 18,
        "enrollment": 8
      }
    ]
  },
  {
    "id": "ENGI5003E",
    "name": "ACADEMIC WRITING",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "10:40am-12:20pm",
        "professor": "Hyoseon Lee",
        "location": "414 PUPIN LABORATORIES",
        "capacity": 18,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "ENGI5004E",
    "name": "PROFESSIONAL&WORKPLACE COMM IN ENGLISH",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "10:40am-12:20pm",
        "professor": "Hyoseon Lee",
        "location": "253 ENGINEERING TERRACE",
        "capacity": 18,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "ENGI5009E",
    "name": "INDEPENDENT STUDY",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "3:00pm-4:40pm",
        "professor": "Hyoseon Lee",
        "location": "604 Martin Luther King Building",
        "capacity": 5,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "ENGI7001E",
    "name": "PROFESSIONAL PRESENTATION",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "1:00pm-2:40pm",
        "professor": "Hyoseon Lee",
        "location": "253 ENGINEERING TERRACE",
        "capacity": 18,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "ENGI7009E",
    "name": "INDEPENDENT STUDY",
    "description": "",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "3:00pm-4:40pm",
        "professor": "Hyoseon Lee",
        "location": "253 ENGINEERING TERRACE",
        "capacity": 5,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "ENME3105E",
    "name": "MECHANICS",
    "description": "Elements of statics; dynamics of a particle and systems of particles.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "",
        "location": "310 FAYERWEATHER",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Jeffrey Kysar",
        "location": "310 FAYERWEATHER",
        "capacity": 95,
        "enrollment": 95
      }
    ]
  },
  {
    "id": "ENME3106E",
    "name": "DYNAMICS AND VIBRATIONS",
    "description": "Kinematics of rigid bodies; momentum and energy methods; vibrations of discrete and continuous systems; eigen-value problems, natural frequencies and modes. Basics of computer simulation of dynamics problems using MATLAB or Mathematica.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Andrew Smyth",
        "location": "312 MATHEMATICS BUILDING",
        "capacity": 116,
        "enrollment": 122
      }
    ]
  },
  {
    "id": "ENME3114E",
    "name": "EXPERIMENTAL MECH OF MATERIALS",
    "description": "Material behavior and constitutive relations. Mechanical properties of metals and cement composites. Structural materials. Modern construction materials. Experimental investigation of material properties and behavior of structural elements including fracture, fatigue, bending, torsion, buckling.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Shiho Kawashima",
        "location": "327 SEELEY W. MUDD BUILDING",
        "capacity": 35,
        "enrollment": 19
      }
    ]
  },
  {
    "id": "ENME4113E",
    "name": "ADVANCED MECHANICS OF SOLIDS",
    "description": "Stress and deformation formulation in two-and three-dimensional solids; viscoelastic and plastic material in one and two dimensions energy methods.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Huiming Yin",
        "location": "829 SEELEY W. MUDD BUILDING",
        "capacity": 25,
        "enrollment": 6
      }
    ]
  },
  {
    "id": "ENME4114E",
    "name": "MECHANCS OF FRACTURE & FATIGUE",
    "description": "Elastic stresses at a crack; energy and stress intensity criteria for crack growth; effect of plastic zone at the crack; fracture testing applications. Fatigue characterization by stress-life and strain-life; damage index; crack propagation; fail safe and safe life analysis.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Adrian Brugger",
        "location": "227 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 6
      }
    ]
  },
  {
    "id": "ENME4117E",
    "name": "Mechanics of Fiber-Reinforced Composites",
    "description": "Overview of composite materials, including history, background, and manufacturing processes. Macro-mechanics: anisotropic elasticity and stress transformation. Micro-mechanics: Rule of Mixture, Composites Cylinder Model (CCM) and other models. Macro-mechanics: Classic Lamination Theory (CLT). Hygrothermal effects, residual stresses, Composite mechanical testing, fabrication. Failure modes and lamina-based failure theories. Bending and Buckling of composite plates. ICME of Composites (nano-, micro-, meso- and macro-scale analysis, experimental validation, process modeling, integration).",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Marianna Maiaru",
        "location": "644 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 10
      }
    ]
  },
  {
    "id": "ENME4214E",
    "name": "THEORY OF PLATES AND SHELLS",
    "description": "Static flexural response of thin, elastic, rectangular, and circular plates. Exact (series) and approximate (Ritz) solutions. Circular cylindrical shells. Axisymmetric and non-axisymmetric membrane theory. Shells of arbitrary shape.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "10:10am-12:40pm",
        "professor": "Gautam Dasgupta",
        "location": "604 Martin Luther King Building",
        "capacity": 20,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "ENME6216E",
    "name": "STRUCTURAL HEALTH MONITORING",
    "description": "Principles of traditional and emerging sensors, data acquisition and signal processing techniques, experimental modal analysis (input-output), operational modal analysis (output-only), model-based diagnostics of structural integrity, data-based diagnostics of structural integrity, long-term monitoring and intelligent maintenance. Lectures and demonstrations, hands-on laboratory experiments.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Raimondo Betti",
        "location": "327 SEELEY W. MUDD BUILDING",
        "capacity": 25,
        "enrollment": 7
      }
    ]
  },
  {
    "id": "ENME6220E",
    "name": "STOCHASTIC ENGINEERING MECHANICS",
    "description": "Review of random variables. Random process theory: stationary and ergodic processes, correlation functions and power spectra, non-stationary, non-white and non-Gaussian processes. Uncertainty quantification and simulation of environmental excitations and material/media properties, even when subject to limited/incomplete data: joint time-frequency analysis, sparse representations and compressive sampling concepts and tools. Stochastic dynamics and reliability assessment of diverse engineering systems: complex nonlinear/hysteretic behaviors and/or fractional derivative modeling. Emphasis on solution methodologies based on Monte Carlo simulation, statistical linearization, and Wiener path integral. Examples from civil, marine, mechanical and aerospace engineering.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Ioannis Kougioumtzoglou",
        "location": "424 KENT HALL",
        "capacity": 25,
        "enrollment": 4
      }
    ]
  },
  {
    "id": "ENME6320E",
    "name": "COMPUTATIONAL POROMECHANICS",
    "description": "A fluid infiltrating porous solid is a multiphase material whose mechanical behavior is significantly influenced by the pore fluid. Diffusion, advection, capillarity, heating, cooling, and freezing of pore fluid, buildup of pore pressure, and mass exhanges among solid and fluid constituents all influence the stability and integrity of the solid skeleton, causing shrinkage, swelling, fracture, or liquefaction. These coupling phenomena are important for numerous disciplines, including geophysics, biomechanics, and material sciences. Fundamental principles of poromechanics essential for engineering practice and advanced study on porous media. Topics include balance principles, Biot’s poroelasticity, mixture theory, constitutive modeling of path independent and dependent multiphase materials, numerical methods for parabolic and hyperbolic systems, inf-sup conditions, and common stabilization procedures for mixed finite element models, explicit and implicit time integrators, and operator splitting techniques for poromechanics problems.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "1:10pm-3:40pm",
        "professor": "Waiching Sun",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 25,
        "enrollment": 2
      }
    ]
  },
  {
    "id": "ENME6333E",
    "name": "FINITE ELEM ANALYSIS II",
    "description": "FE formulation for beams and plates. Generalized eigenvalue problems (vibrations and buckling). FE formulation for time-dependent parabolic and hyperbolic problems. Nonlinear problems, linearization, and solution algorithms. Geometric and material nonlinearities. Introduction to continuum mechanics. Total and updated Lagrangian formulations. Hyperelasticity and plasticity. Special topics: fracture and damage mechanics, extended finite element method.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "7:00pm-9:30pm",
        "professor": "Haim Waisman",
        "location": "327 SEELEY W. MUDD BUILDING",
        "capacity": 25,
        "enrollment": 7
      }
    ]
  },
  {
    "id": "ENME6370E",
    "name": "TURBULENCE THEORY & MODELING",
    "description": "Ordinary and partial differential equations. Turbulence phenomenology; spatial and temporal scales in turbulent flows; statistical description, filtering and Reynolds decomposition, equations governing the resolved flow, fluctuations and their energetics; turbulence closure problem for RANS and LES; two equation turbulence models and second moment closures.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Marco Giometto",
        "location": "C01 80 CLAREMONT",
        "capacity": 25,
        "enrollment": 17
      }
    ]
  },
  {
    "id": "GRAP4005E",
    "name": "COMPUTER GRAPHICS IN ENGIN",
    "description": "Numerical and symbolic (algebraic) problem solving with Mathematica. Formulation for graphics application in civil, mechanical, and bioengineering. Example of two-and three-dimensional curve and surface objects in C++ and Mathematica; special projects of interest to electrical and computer science.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Gautam Dasgupta",
        "location": "327 SEELEY W. MUDD BUILDING",
        "capacity": 25,
        "enrollment": 3
      }
    ]
  },
  {
    "id": "IEME4200E",
    "name": "HUMAN-CENTERED DESIGN AND INNOVATION",
    "description": "Open to SEAS graduate and advanced undergraduate students, Business School, and GSAPP. Students from other schools may apply. Fast-paced introduction to human-centered design. Students learn the vocabulary of design methods, understanding of design process. Small group projects to create prototypes. Design of simple product, more complex systems of products and services, and design of business.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "",
        "location": "CIN ALFRED LERNER HALL",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "11:25am-12:40pm",
        "professor": "Harry West",
        "location": "430 RIVER SIDE CHURCH",
        "capacity": 60,
        "enrollment": 61
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "",
        "location": "CIN ALFRED LERNER HALL",
        "capacity": 0,
        "enrollment": 0
      },
      {
        "days": [
          "Wednesday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Harry West",
        "location": "430 RIVER SIDE CHURCH",
        "capacity": 60,
        "enrollment": 61
      }
    ]
  },
  {
    "id": "IEOR1000E",
    "name": "Frontiers in Operations Research and Data Analytics",
    "description": "Introductory course for overview of modern approaches and ideas of operations research and data analytics. Through a series of interactive sessions, students engage in activities exploring OR topics with various faculty members from the IEOR department.",
    "credits": 1,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "1:30pm-2:30pm",
        "professor": "Yi Zhang",
        "location": "330 URIS HALL",
        "capacity": 60,
        "enrollment": 25
      }
    ]
  },
  {
    "id": "IEOR2000E",
    "name": "Data Engineering with Python",
    "description": "Introduction to essential data engineering methods. Potential topics include Arrays, Linked Lists, Stacks and Queues, Trees and Graphs, Hash Tables, Search Algorithms and Efficiency, Relational databases, SQL, NoSQL, and Data Wrangling. Practice both theory and applications using Python programming.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Yi Zhang",
        "location": "627 SEELEY W. MUDD BUILDING",
        "capacity": 50,
        "enrollment": 56
      }
    ]
  },
  {
    "id": "IEOR3402E",
    "name": "PRODUCTN-INVENTORY PLAN-CONTRL",
    "description": "For undergraduates only. Required for all undergraduate students majoring in IE, OR:EMS, OR:FE, and OR. Must be taken during (or before) the sixth semester. Inventory management and production planning. Continuous and periodic review models: optimal policies and heuristic solutions, deterministic and probabilistic demands. Material requirements planning. Aggregate planning of production, inventory, and work force. Multi-echelon integrated production-inventory systems. Production scheduling. Term project. Recitation section required.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Ali Sadighian",
        "location": "310 FAYERWEATHER",
        "capacity": 90,
        "enrollment": 17
      }
    ]
  },
  {
    "id": "IEOR3404E",
    "name": "SIMULATION MODELING AND ANALYSIS",
    "description": "It is strongly advised that Stochastic modeling (IEOR E3106 or IEOR E4106) be taken before this course. This is an introductory course to simulation, a statistical sampling technique that uses the power of computers to study complex stochastic systems when analytical or numerical techniques do not suffice. The course focuses on discrete-event simulation, a general technique used to analyze a model over time and determine the relevant quantities of interest. Topics covered in the course include the generation of random numbers, sampling from given distributions, simulation of discrete-event systems, output analysis, variance reduction techniques, goodness of fit tests, and the selection of input distributions. The first half of the course is oriented toward the design and implementation of algorithms, while the second half is more theoretical in nature and relies heavily on material covered in prior probability courses. The teaching methodology consists of lectures, recitations, weekly homework, and both in-class and take-home exams. Homework almost always includes a programming component for which students are encouraged to work in teams.",
    "credits": 4,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "5:40pm-6:55pm",
        "professor": "Yi Zhang",
        "location": "142 URIS HALL",
        "capacity": 90,
        "enrollment": 80
      }
    ]
  },
  {
    "id": "IEOR3609E",
    "name": "ADVANCED OPTIMIZATION",
    "description": "For undergraduates only. Required for all undergraduate students majoring in IE, OR:EMS, OR:FE, and OR. This is a follow-up to IEOR E3608 and will cover advanced topics in optimization, including integer optimization, convex optimization, and optimization under uncertainty, with a strong focus on modeling, formulations, and applications.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Bento Natura",
        "location": "602 HAMILTON HALL",
        "capacity": 80,
        "enrollment": 67
      }
    ]
  },
  {
    "id": "IEOR3658E",
    "name": "PROBABILITY FOR ENGINEERS",
    "description": "Introductory course to probability theory and does not assume any prior knowledge of subject. Teaches foundations required to use probability in applications, but course itself is theoretical in nature. Basic definitions and axioms of probability and notions of independence and conditional probability introduced. Focus on random variables, both continuous and discrete, and covers topics of expectation, variance, conditional distributions, conditional expectation and variance, and moment generating functions. Also Central Limit Theorem for sums of random variables. Consists of lectures, recitations, weekly homework, and in-class exams.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Daniel Lacker",
        "location": "614 SCHERMERHORN HALL",
        "capacity": 115,
        "enrollment": 116
      }
    ]
  },
  {
    "id": "IEOR3700E",
    "name": "Research Immersion in OR and Data Analytics",
    "description": "An overview of active research areas in Operations Research and Data Analytics, and an introduction to the essential components of research studies. This course helps students develop fundamental research skills, including paper reading, problem formulation, problem-solving, scientific writing, and research presentation. Classes are in seminar format, with students analyzing research papers, developing research projects, and presenting research findings.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Adam Elmachtoub",
        "location": "326 URIS HALL",
        "capacity": 30,
        "enrollment": 10
      }
    ]
  },
  {
    "id": "IEOR3900E",
    "name": "UNDERGRAD RESEARCH OR PROJECT",
    "description": "Independent work involving experiments, computer programming, analytical investigation, or engineering design.",
    "credits": 3,
    "times": []
  },
  {
    "id": "IEOR3999E",
    "name": "FIELDWORK",
    "description": "Final reports are required. This course may not be taken for pass/fail credit or audited.",
    "credits": 2,
    "times": [
      {
        "days": [],
        "time": "",
        "professor": "Yi Zhang",
        "location": "",
        "capacity": 50,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "IEOR4004E",
    "name": "OPTIMIZATION MODELS AND METHODS",
    "description": "A graduate course only for MS&E, IE, and OR students. This is also required for students in the Undergraduate Advanced Track. For students who have not studied linear programming. Some of the main methods used in IEOR applications involving deterministic models: linear programming, the simplex method, nonlinear, integer and dynamic programming.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Yaren Kaya",
        "location": "428 PUPIN LABORATORIES",
        "capacity": 140,
        "enrollment": 146
      },
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Yaren Kaya",
        "location": "207 MATHEMATICS BUILDING",
        "capacity": 147,
        "enrollment": 94
      },
      {
        "days": [],
        "time": "",
        "professor": "Yaren Kaya",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "IEOR4010E",
    "name": "Artificial Intelligence for OR and FE",
    "description": "Introduces modern artificial intelligence (AI), focus on applications to operations and decision-making in domains such as healthcare, finance, energy systems, and supply chain management. Topics: machine learning, neural networks, large language models (LLMs), reinforcement learning, game theory, multi-agent systems, and agentic frameworks.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "10:10am-11:25am",
        "professor": "Shipra Agrawal",
        "location": "313 FAYERWEATHER",
        "capacity": 60,
        "enrollment": 60
      }
    ]
  },
  {
    "id": "IEOR4102E",
    "name": "STOCHASTIC MODELING FOR MSE",
    "description": "Introduction to stochastic processes and models, with emphasis on applications to engineering and management; random walks, gambler’s ruin problem, Markov chains in both discrete and continuous time, Poisson processes, renewal processes, stopping times, Wald’s equation, binomial lattice model for pricing risky assets, simple option pricing; simulation of simple stochastic processes, Brownian motion, and geometric Brownian motion. A specialized version of IEOR E4106 for MSE students.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Karl Sigman",
        "location": "142 URIS HALL",
        "capacity": 95,
        "enrollment": 58
      }
    ]
  },
  {
    "id": "IEOR4106E",
    "name": "STOCHASTIC MODELS",
    "description": "Some of the main stochastic models used in engineering and operations research applications: discrete-time Markov chains, Poisson processes, birth and death processes and other continuous Markov chains, renewal reward processes. Applications: queueing, reliability, inventory, and finance.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "5:40pm-6:55pm",
        "professor": "Antonius Dieker",
        "location": "428 PUPIN LABORATORIES",
        "capacity": 127,
        "enrollment": 123
      },
      {
        "days": [],
        "time": "",
        "professor": "Antonius Dieker",
        "location": "",
        "capacity": 99,
        "enrollment": 3
      }
    ]
  },
  {
    "id": "IEOR4108E",
    "name": "SUPPLY CHAIN ANALYTICS",
    "description": "Sustainability Related Supply chain management, model design of a supply chain network, inventories, stock systems, commonly used inventory models, supply contracts, value of information and information sharing, risk pooling, design for postponement, managing product variety, information technology and supply chain management; international and environmental issues. Note: replaced IEOR E4000 beginning in fall 2018.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "1:10pm-2:25pm",
        "professor": "Elioth Sanabria Buenaventura",
        "location": "633 SEELEY W. MUDD BUILDING",
        "capacity": 40,
        "enrollment": 38
      }
    ]
  },
  {
    "id": "IEOR4111E",
    "name": "OPERATIONS CONSULTING",
    "description": "Aims to develop and harness the modeling, analytical, and managerial skills of engineering students and apply them to improve the operations of both service and manufacturing firms. Structured as a hands-on laboratory in which students \"learn by doing\" on real-world consulting projects (October to May). The student teams focus on identifying, modeling, and testing (and sometimes implementing) operational improvements and innovations with high potential to enhance the profitability and/or achieve sustainable competitive advantage for their sponsor companies. The course is targeted toward students planning careers in technical consulting (including operations consulting) and management consulting, or pursuing positions as business analysts in operations, logistics, supply chain and revenue management functions, positions in general management, and future entrepreneurs.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "7:10pm-9:40pm",
        "professor": "Soulaymane Kachani",
        "location": "501 NORTHWEST CORNER",
        "capacity": 90,
        "enrollment": 0
      }
    ]
  },
  {
    "id": "IEOR4199E",
    "name": "MSIEOR Quantitative Bootcamp",
    "description": "Zero-credit course. Primer on quantitative and mathematical concepts. Required for all incoming MSOR and MSIE students.",
    "credits": 3,
    "times": []
  },
  {
    "id": "IEOR4402E",
    "name": "Corporate Finance, Accounting & Investment Banking",
    "description": "Interpret financial statements, build cash flow models, value projects, value companies, and make Corporate Finance decisions. Additional topics include: cost of capital, dividend policy, debt policy, impact of taxes, Shareholder/Debtholder agency costs, dual-class shares, using option pricing theory to analyze management behavior, investment banking activities, including equity underwriting, syndicated lending, venture capital, private equity investing and private equity secondaries. Application of theory in real-world situations: analyzing financial activities of companies such as General Electric, Google, Snapchat, Spotify, and Tesla.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "4:30pm-7:00pm",
        "professor": "Rodney Sunada-Wong",
        "location": "303 SEELEY W. MUDD BUILDING",
        "capacity": 65,
        "enrollment": 63
      }
    ]
  },
  {
    "id": "IEOR4404E",
    "name": "SIMULATION",
    "description": "Generation of random numbers from given distributions; variance reduction; statistical output analysis; introduction to simulation languages; application to financial, telecommunications, computer, and production systems. Graduate students must register for 3 points. Undergraduate students must register for 4 points. Note: Students who have taken IEOR E4703 Monte Carlo simulation may not register for this course for credit. Recitation section required.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "2:40pm-3:55pm",
        "professor": "Henry Lam",
        "location": "207 MATHEMATICS BUILDING",
        "capacity": 150,
        "enrollment": 141
      },
      {
        "days": [],
        "time": "",
        "professor": "Henry Lam",
        "location": "",
        "capacity": 99,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "IEOR4405E",
    "name": "PRODUCTION SCHEDULING",
    "description": "Required for undergraduate students majoring in IE and OR. Job shop scheduling: parallel machines, machines in series; arbitrary job shops. Algorithms, complexity, and worst-case analysis. Effects of randomness: machine breakdowns, random processing time. Term project.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "8:40am-9:55am",
        "professor": "Clifford Stein",
        "location": "633 SEELEY W. MUDD BUILDING",
        "capacity": 60,
        "enrollment": 15
      }
    ]
  },
  {
    "id": "IEOR4505E",
    "name": "OPERATION RES IN PUBLIC POLICY",
    "description": "Sustainability Focused Aims to give the student a broad overview of the role of Operations Research in public policy. The specific areas covered include voting theory, apportionment, deployment of emergency units, location of hazardous facilities, health care, organ allocation, management of natural resources, energy policy, and aviation security. Draws on a variety techniques such as linear and integer programming, statistical and probabilistic methods, decision analysis, risk analysis, and analysis and control of dynamic systems.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "11:40am-12:55pm",
        "professor": "Eric Stratman",
        "location": "717 HAMILTON HALL",
        "capacity": 50,
        "enrollment": 33
      }
    ]
  },
  {
    "id": "IEOR4510E",
    "name": "PROJECT MANAGEMENT",
    "description": "Management of complex projects and the tools that are available to assist managers with such projects. Topics include project selection, project teams and organizational issues, project monitoring and control, project risk management, project resource management, and managing multiple projects.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "10:10am-12:40pm",
        "professor": "Dave Begun",
        "location": "517 HAMILTON HALL",
        "capacity": 80,
        "enrollment": 27
      }
    ]
  },
  {
    "id": "IEOR4511E",
    "name": "Industry Projects in Analytics & Operations Research",
    "description": "Teams of students work on real-world projects in analytics. Focus on three aspects of analytics: identifying client analytical requirements; assembling, cleaning and organizing data; identifying and implementing analytical techniques (e.g., statistics and/or machine learning); and delivering results in a client-friendly format. Each project has a defined goal and pre-identified data to analyze in one semester. Client facing class. Class requires 10 hours of time per week and possible client visits on Fridays.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday"
        ],
        "time": "9:00am-11:30am",
        "professor": "Michael Robbins",
        "location": "CIN ALFRED LERNER HALL",
        "capacity": 80,
        "enrollment": 38
      }
    ]
  },
  {
    "id": "IEOR4523E",
    "name": "Data Analytics and Machine Learning",
    "description": "IEOR students only; priority to MSBA students. Practical survey of Python tools for acquiring, cleaning, and analyzing data. Techniques for obtaining data from files, web scraping, and APIs (CSV, HTML, JSON, XML); performing core data-cleaning tasks; and using data analysis, machine learning, and visualization  libraries (NumPy, Pandas, Matplotlib, Seaborn, TensorFlow/Keras). Introduces foundational machine learning and deep learning concepts, including backpropagation, gradient descent, and implementation of neural networks with TensorFlow/Keras. Covers text mining using word, sentence, and document embeddings. Includes a group project requiring students to collect, store, and analyze a dataset of their choice and build a predictive model.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Tuesday",
          "Thursday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Uday Menon",
        "location": "833 SEELEY W. MUDD BUILDING",
        "capacity": 100,
        "enrollment": 1
      }
    ]
  },
  {
    "id": "IEOR4524E",
    "name": "ANALYTICS IN PRACTICE",
    "description": "MSBA students only. Groups of students will work on real world projects in analytics, focusing on three aspects: identifying client analytical requirements; assembling, cleaning, and organizing data; identifying and implementing analytical techniques (statistics, OR, machine learning); and delivering results in a client-friendly format. Each project has a well-defined goal, comes with sources of data preidentified, and has been structured so that it can be completed in one semester. Client-facing class with numerous on-site client visits; students should keep Fridays clear for this purpose.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Thursday"
        ],
        "time": "7:10pm-9:40pm",
        "professor": "Hardeep Johar",
        "location": "301 PUPIN LABORATORIES",
        "capacity": 260,
        "enrollment": 209
      },
      {
        "days": [
          "Tuesday"
        ],
        "time": "4:10pm-6:40pm",
        "professor": "Yaren Kaya",
        "location": "327 SEELEY W. MUDD BUILDING",
        "capacity": 30,
        "enrollment": 15
      }
    ]
  },
  {
    "id": "IEOR4525E",
    "name": "MACHINE LEARNING FE & OPR",
    "description": "MS IEOR students only. Introduction to machine learning, practical use of ML algorithms and applications to financial engineering and operations. Supervised learning: regression, classification, resampling methods, regularization, support vector machines (SVMs), and deep learning. Unsupervised learning: dimensionality reduction, matrix decomposition, and clustering algorithms.",
    "credits": 3,
    "times": [
      {
        "days": [
          "Monday",
          "Wednesday"
        ],
        "time": "4:10pm-5:25pm",
        "professor": "Daniel Bienstock",
        "location": "142 URIS HALL",
        "capacity": 100,
        "enrollment": 73
      }
    ]
  },
  {
    "id": "IEOR4532E",
    "name": "Visualization and Storytelling with Data",
    "description": "Data visualization and how to build a story with data. Using complex data or statistics to communicate results effectively. Learn to present analysis and results conscisely and effectively.",
    "credits": 1,
    "times": [
      {
        "days": [
          "Friday"
        ],
        "time": "9:00am-5:00pm",
        "professor": "Michelle Glaser",
        "location": "313 FAYERWEATHER",
        "capacity": 60,
        "enrollment": 56
      }
    ]
  }
]